{
  "version": "https://jsonfeed.org/version/1.1",
  "title": "Approved Thoughts",
  "home_page_url": "https://www.approvedthoughts.com",
  "feed_url": "https://www.approvedthoughts.com/feed.json",
  "description": "",
  "author": {
    "name": "Apoorv Trivedi",
    "url": "https://www.approvedthoughts.com"
  },
  "language": "en",
  "items": [
    {
      "id": "https://www.approvedthoughts.com/posts/2026/links-22-feb-2026.html",
      "url": "https://www.approvedthoughts.com/posts/2026/links-22-feb-2026.html",
      "title": "Links: Weeks of 22 Feb 2026",
      "content_html": "<h4>AI Links</h4>\n<ol>\n<li><p><a href=\"https://www.natesilver.net/p/the-singularity-wont-be-gentle\" target=\"_blank\" rel=\"noopener\">The singularity won&#39;t be gentle</a>: </p>\n<blockquote>\n<p>If AI has even a fraction of the impact that many people in Silicon Valley now expect on the fabric of work and daily life, it’s going to have profound and unpredictable political impacts.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.approvedthoughts.com/https://marginalrevolution.com/marginalrevolution/2026/02/rebuilding-our-world-with-reference-to-strong-ai.html\" target=\"_blank\" rel=\"noopener\">Rebuilding our world, with reference to strong AI</a>: </p>\n<blockquote>\n<p>When 2012 passed into 2013, we did not have to rebuild our world, not in most countries at least.  It sufficed to make adjustments at the margin.</p>\n\n\n\n<p>After the Roman Empire fell, parts of Europe had to rebuild their worlds.  It took a long time, but they ended up doing pretty well.</p>\n\n\n\n<p>After the American Revolution, the newly independent colonies had to rebuild their own world.  They did so brutally, but with considerable success.</p>\n\n\n\n<p>After WWII, Western Europe had the chance to rebuild its own world, and did a great job.</p>\n\n\n\n<p>We moderns are not used to having to rebuild our world.</p>\n\n\n\n<p>It is now the case that strong AI is here/coming, and we will have to rebuild our own world.  Many of us are terrified at this prospect, others are just extremely pessimistic.  It seems so impossible.  How are all the new pieces supposed to fit together?  Who amongst us can explain that process in a reassuring way?</p>\n\n\n\n<p>Yet we have done it many times before.  Not always with success, however.  After WWI ended, Europe was supposed to rebuild its own world, but they came up with something far worse than what they had before.  Nonetheless, in the broader sweep of history world rebuilding projects have had positive expected value.</p>\n\n\n\n<p>And so we will rebuilding our world yet again.  Or maybe you think we are simply incapable of that.</p>\n\n\n\n<p>As this happens, it can be useful to distinguish “criticisms of AI” from “people who cannot imagine that world rebuilding will go well.”  A lot of what parades as the former is actually the latter.</p>\n\n\n\n<p>In any case, it all will be quite something to witness.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://x.com/stevesi/status/2019167552794948020\" target=\"_blank\" rel=\"noopener\">Death of Software. nah.</a>: </p>\n<blockquote>\n<p>Strap in. This is the most exciting time for business and technology, ever.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://simonwillison.net/2026/Feb/9/ai-intensifies-work/#atom-everything\" target=\"_blank\" rel=\"noopener\">AI Doesn&#39;t Reduce Work - It Intensifies It</a>:</p>\n<blockquote>\n<p>I think we&#39;ve just disrupted decades of existing intuition about sustainable working practices. It&#39;s going to take a while and some discipline to find a good new balance.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://x.com/sebkrier/status/2020561261751062664\" target=\"_blank\" rel=\"noopener\">Seb Krier</a>: Some of this was weirdly scary.</p>\n</li>\n</ol>\n<div class=\"tweet-container\" style=\"margin:0 auto 1rem;\">\n  <blockquote class=\"twitter-tweet\" data-width=\"350\">\n    <a href=\"https://twitter.com/sebkrier/status/2020561261751062664\" target=\"_blank\" rel=\"noopener\"></a>\n  </blockquote>\n</div>\n\n<ol start=\"5\">\n<li><p><a href=\"https://restofworld.org/2026/ai-deepfakes-grief-celebrations-india/\" target=\"_blank\" rel=\"noopener\">Family deepfakes help people celebrate and grieve in India</a>: </p>\n<blockquote>\n<p>When the lights dimmed at Jaideep Sharma’s wedding reception in the north Indian city of Ajmer, guests expected to see a cheesy montage of the young couple in various attractive locations. Instead, they saw Sharma’s father — dead for more than a year — on the screen, smiling and blessing the newlyweds.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://x.com/kareldoostrlnck/status/2019477361557926281\" target=\"_blank\" rel=\"noopener\">I spent $10,000 to automate my research at OpenAI with Codex</a></p>\n</li>\n<li><p><a href=\"https://mitchellh.com/writing/my-ai-adoption-journey\" target=\"_blank\" rel=\"noopener\">My AI Adoption Journey</a></p>\n</li>\n<li><p><a href=\"https://x.com/andrewyng/status/2016564878098780245\" target=\"_blank\" rel=\"noopener\">Agent Skills with Anthropic</a></p>\n</li>\n</ol>\n<h4>Other Stuff</h4>\n<ol>\n<li><p><a href=\"https://www.nytimes.com/2026/02/13/magazine/gisele-pelicot-france-rape-case-story.html?unlocked_article_code=1.MVA.Q6_h.VC-GNEuOSqZt&smid=nytcore-ios-share\" target=\"_blank\" rel=\"noopener\">‘They All Tried to Break Me’: Gisèle Pelicot Shares Her Story</a>: Words fail me. </p>\n<blockquote>\n<p>I think we’re going to do great things together. I think we’ll make the most of these beautiful years we have left, and I hope they’ll last very long.</p>\n</blockquote>\n<p> Amen.</p>\n</li>\n<li><p><a href=\"https://x.com/realgenekim/status/1975707331129450559\" target=\"_blank\" rel=\"noopener\">Navigating ER / Hostpital in US</a>:</p>\n<blockquote>\n<p>The most important thing I&#39;ve learned about hospitals over the last decade: if your loved one needs to be admitted to the hospital, chances are they will get incredible care... as long as that care can be immediately administered in the ED.  </p>\n\n\n\n<p>However, if they need to move outside the ED, you must learn as much as you can so you can help expedite the process, advocating to them to get to where they need to go — usually an inpatient floor, as quickly as possible. </p>\n\n\n\n<p>The stakes are probably higher than you think.  </p>\n</blockquote>\n</li>\n<li></li>\n</ol>\n<div class=\"tweet-container\" style=\"margin:0 auto 1rem;\">\n  <blockquote class=\"twitter-tweet\" data-width=\"350\">\n    <a href=\"https://twitter.com/FreeRangeLawyer/status/2011077281041744275\" target=\"_blank\" rel=\"noopener\"></a>\n  </blockquote>\n</div>\n\n<ol start=\"4\">\n<li><a href=\"https://x.com/ZReitano/status/2016862026501378535\" target=\"_blank\" rel=\"noopener\">The Economics of a Super Bowl Ad</a>:</li>\n</ol>\n<div class=\"tweet-container\" style=\"margin:0 auto 1rem;\">\n  <blockquote class=\"twitter-tweet\" data-width=\"350\">\n    <a href=\"https://twitter.com/ZReitano/status/2016862026501378535\" target=\"_blank\" rel=\"noopener\"></a>\n  </blockquote>\n</div>\n\n<ol start=\"5\">\n<li><p><a href=\"https://www.approvedthoughts.com/https://marginalrevolution.com/marginalrevolution/2026/02/codex.html\" target=\"_blank\" rel=\"noopener\">Codex</a>:</p>\n<blockquote>\n<p>No, this is not an AI post.  Codex is a NYC bookshop at 1 Bleecker St., at Bowery.  It is quite extraordinary in its curation of used books.  The fiction section is large, yet you can pick up virtually any title on the shelves and it is worth reading.  A wonderful place to go to get reading ideas, plus the prices are reasonable and the used books are in decent shape.  Such achievements should be praised.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.astralcodexten.com/p/record-low-crime-rates-are-real-not?publication_id=89120&r=3o9\" target=\"_blank\" rel=\"noopener\">Record Low Crime Rates Are Real, Not Just Reporting Bias Or Improved Medical Care</a>: </p>\n<blockquote>\n<p>This post will do two things:</p>\n\n\n\n<ol>\n<li>Establish that our best data show crime rates are historically low</li>\n</ol>\n\n\n\n<ol start=\"2\">\n<li>Argue that this is a real effect, not just reporting bias (people report fewer crimes to police) or an artifact of better medical care (victims are more likely to survive, so murders get downgraded to assaults)</li>\n</ol>\n</blockquote>\n</li>\n<li><p><a href=\"https://x.com/FreeRangeLawyer/status/2011077281041744275\" target=\"_blank\" rel=\"noopener\">Rob Johnson</a>:</p>\n</li>\n</ol>\n<div class=\"tweet-container\" style=\"margin:0 auto 1rem;\">\n  <blockquote class=\"twitter-tweet\" data-width=\"350\">\n    <a href=\"https://twitter.com/FreeRangeLawyer/status/2011077281041744275\" target=\"_blank\" rel=\"noopener\"></a>\n  </blockquote>\n</div>\n\n<ol start=\"8\">\n<li><a href=\"https://www.nbcnews.com/pop-culture/music/super-bowl-bushes-people-rcna258256\" target=\"_blank\" rel=\"noopener\">What it was like to be a bush at Bad Bunny’s Super Bowl performance</a>:<blockquote>\n<p>Some of the biggest stars to emerge from this year&#39;s Super Bowl halftime show never even showed their faces on camera. They were the ones who dressed as bunches of grass to transform a football stadium into the sugarcane fields of Puerto Rico.</p>\n</blockquote>\n</li>\n</ol>",
      "summary": "AI Links\n1. [The singularity won't be gentle](https://www.natesilver.net/p/the-singularity-wont-be-gentle): \n    > If AI has even a fraction of the im...",
      "date_published": "2026-02-22T00:00:00.000Z",
      "tags": [
        "links"
      ],
      "authors": [
        {
          "name": "Apoorv Trivedi",
          "url": "https://www.approvedthoughts.com"
        }
      ]
    },
    {
      "id": "https://www.approvedthoughts.com/posts/2026/links-10-jan-2026.html",
      "url": "https://www.approvedthoughts.com/posts/2026/links-10-jan-2026.html",
      "title": "Links: Weeks of 10 Jan 2026 - The Vibe Shift",
      "content_html": "<p>For the last 2-3 weeks I had been noticing a &quot;vibe-shift&quot; about a jump in the abilities of the leading LLMs. This week that conversation took center stage as many blog posts and tweets raving about the enhanced abilities of Claud Code, especially when using the command line interface (CLI) went viral. I have not had the chance to test it out myself, as I am pre-occupied with the family&#39;s upcoming relocation. However, after that, this is top of the list for me now and all links but two below are on this topic. I recommend everyone go down this rabbit hole.</p>\n<ol>\n<li><p><a href=\"https://x.com/mollycantillon/status/2008918474006122936\" target=\"_blank\" rel=\"noopener\">A Personal Panopticon (via MR)</a>: A great summary.</p>\n<blockquote>\n<p>A few months ago, I started running my life out of Claude Code. Not out of intention to do so, it was just the place where everything met. And it just kept working. Empires are won by conquest. What keeps them standing is something much quieter. Before a king can tax, he must count. Before he can conscript, he must locate. Before he can rule, he must see. Legibility is the precondition for governance…</p>\n\n\n\n<p>The first thing Claude solved was product blindness. NOX now runs on a cron job: pulling Amplitude, cross-referencing GitHub, and pointing me to what needs building. It handles A/B testing, generates winning copy, and has turned customer support into a fully autonomous department.</p>\n\n\n\n<p>Once I saw this was possible, I chased it everywhere. Email, hitting inbox zero for the first time ever, with auto-drafted replies for everything inbound. Workouts, accommodating horrendously erratic travel schedules. Sleep, built a projector wired to my WHOOP after exactly six hours that wakes me with my favorite phrases. Subscriptions, found and returned $2000 I didn’t know I was paying. The dozen SFMTA citations I’d ignored, the action items I’d procrastinated into oblivion. People are using it to, I discovered, run vending machines, home automation systems, and keep plants alive.</p>\n\n\n\n<p>The feeling is hard to name. It is the violent gap between how blind you were and how obvious everything feels now with an observer that reads all the feeds, catches what you’ve unconsciously dropped, notices patterns across domains you’d kept stubbornly separate, and—crucially—tells you what to do about it.</p>\n\n\n\n<p>My personal finances are now managed in the terminal. Overnight it picks the locks of brokerages that refuse to talk to each other, pulls congressional and hedge fund disclosures, Polymarket odds, X sentiment, headlines and 10-Ks from my watchlist. Every morning, a brief gets added in ~/𝚝𝚛𝚊𝚍𝚎𝚜. Last month it flagged Rep. Fields buying NFLX shares. Three weeks later, the Warner Bros deal. I don’t always trade, sometimes I argue with the thesis. But I’m never tracking fifteen tabs at 6am anymore.</p>\n\n\n\n<p>It feels borderline unfair seeing around corners, being in ten places at once, surveilling yourself with the attention span of a thousand clones.</p>\n\n\n\n<p>A panopticon still, but the tower belongs to you.</p>\n</blockquote>\n</li>\n</ol>\n<div class=\"tweet-container\" style=\"margin:0 auto 1rem;\">\n  <blockquote class=\"twitter-tweet\" data-width=\"350\">\n    <a href=\"https://twitter.com/mollycantillon/status/2008918474006122936\" target=\"_blank\" rel=\"noopener\"></a>\n  </blockquote>\n</div>\n\n<ol start=\"2\">\n<li><p><a href=\"https://thezvi.substack.com/p/claude-codes\" target=\"_blank\" rel=\"noopener\">Claude Codes</a>: The definitive guide to the developments and the conversation, including some useful guides. </p>\n<blockquote>\n<p>Claude Code with Opus 4.5 is so hot right now. The cool kids use it for everything.</p>\n\n\n\n<p>They definitely use it for coding, often letting it write all of their code.</p>\n\n\n\n<p>They also increasingly use it for everything else one can do with a computer.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://x.com/tobi/status/2009311882553765914\" target=\"_blank\" rel=\"noopener\">Toby Lutke, Founder &amp; CEO, Shopify</a>: Do endorsments come any stronger than this?</p>\n</li>\n</ol>\n<div class=\"tweet-container\" style=\"margin:0 auto 1rem;\">\n  <blockquote class=\"twitter-tweet\" data-width=\"350\">\n    <a href=\"https://twitter.com/tobi/status/2009311882553765914\" target=\"_blank\" rel=\"noopener\"></a>\n  </blockquote>\n</div>\n\n<ol start=\"4\">\n<li><a href=\"https://x.com/petergyang/status/2002402550570758283\" target=\"_blank\" rel=\"noopener\">Claude Code Tutorials</a>: Not tried. Saving here for later.</li>\n</ol>\n<div class=\"tweet-container\" style=\"margin:0 auto 1rem;\">\n  <blockquote class=\"twitter-tweet\" data-width=\"350\">\n    <a href=\"https://twitter.com/petergyang/status/2002402550570758283\" target=\"_blank\" rel=\"noopener\"></a>\n  </blockquote>\n</div>\n\n<ol start=\"5\">\n<li><p><a href=\"https://www.hyperdimensional.co/p/among-the-agents?\" target=\"_blank\" rel=\"noopener\">Among the Agents</a>: Examples and implications. </p>\n</li>\n<li><p><a href=\"https://x.com/karpathy/status/2004607146781278521?s=20\" target=\"_blank\" rel=\"noopener\">Andrej Karpathy</a>: Don&#39;t worry if you feel you are behind. So does Andrej and he&#39;s among the best out there.</p>\n</li>\n</ol>\n<div class=\"tweet-container\" style=\"margin:0 auto 1rem;\">\n  <blockquote class=\"twitter-tweet\" data-width=\"350\">\n    <a href=\"https://twitter.com/karpathy/status/2004607146781278521?s=20\" target=\"_blank\" rel=\"noopener\"></a>\n  </blockquote>\n</div>\n\n<ol start=\"7\">\n<li><p><a href=\"https://thezvi.substack.com/p/advancements-in-self-driving-cars\" target=\"_blank\" rel=\"noopener\">Self-Driving Cars</a>: The robots are coming too. What a time. </p>\n</li>\n<li><p><a href=\"https://finaloffshoring.com/The_Final_Offshoring.pdf\" target=\"_blank\" rel=\"noopener\">The Final Offshoring</a>: More on robots. </p>\n<blockquote>\n<p>Thus, why should the future be any different? Why should one expect a sudden, dramatic wave of robotics working not just in the coming decade, but the coming handful of years? Why should the curse of Moravec’s Paradox suddenly break? </p>\n\n\n\n<p>The standard answer a savvy technologist would give is that increasingly capable AI video and world models will serve as a “base,” providing real-world understanding, while deployments, whether through teleoperation, data gloves, or egocentric capture, will generate an additional data flywheel. This has already led to interesting emergent behaviors: absorbing egocentric data, tactile sensing, and generalization across environments. And we’re about to scale everything up by 100x. Long robotics. Things will be big soon.</p>\n\n\n\n<p>I think this is mostly correct, but let me add some nuance around both why to be bullish and two of the challenges that robotics faces today. </p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.approvedthoughts.com/https://www.nytimes.com/2026/01/07/movies/timothee-chalamet-michael-b-jordan-oscar-curse.html\" target=\"_blank\" rel=\"noopener\">Can Timothée Chalamet Break This Oscar Curse? (NYT)</a>: Woke comes full-circle with NYT worrying about unfair treatment of young, white, male actors?</p>\n<blockquote>\n<p>For nearly a century, Oscar voters have been reluctant to hand the best-actor prize to young men, almost always opting to reward more seasoned performers.</p>\n\n\n\n<p>Though Oscar voters have no qualms about rewarding young actresses, they traditionally want to see more mileage on their men.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.approvedthoughts.com/https://marginalrevolution.com/marginalrevolution/2026/01/the-tyranny-of-the-complainers.html\" target=\"_blank\" rel=\"noopener\">The Tyranny of the Complainers</a>: </p>\n<blockquote>\n<p>In 2015, for example, 6,852 of the 8,760 complaints submitted to Ronald Reagan Washington National Airport originated from one residence in the affluent Foxhall neighborhood of northwest Washington, DC. The residents of that particular house called Reagan National to express irritation about aircraft noise an average of almost 19 times per day during 2015.</p>\n</blockquote>\n</li>\n</ol>",
      "summary": "For the last 2-3 weeks I had been noticing a \"vibe-shift\" about a jump in the abilities of the leading LLMs. This week that conversation took center s...",
      "date_published": "2026-01-03T00:00:00.000Z",
      "tags": [
        "links"
      ],
      "authors": [
        {
          "name": "Apoorv Trivedi",
          "url": "https://www.approvedthoughts.com"
        }
      ]
    },
    {
      "id": "https://www.approvedthoughts.com/posts/2026/links-03-jan-2026.html",
      "url": "https://www.approvedthoughts.com/posts/2026/links-03-jan-2026.html",
      "title": "Links: Weeks of 03 Jan 2026",
      "content_html": "<ol>\n<li><p><a href=\"https://www.nytimes.com/2025/12/29/magazine/marjorie-taylor-greene-trump-maga-split.html?unlocked_article_code=1.AVA.0XIc.Rf3rYSGTA4Nx&smid=nytcore-ios-share\" target=\"_blank\" rel=\"noopener\">‘I Was Just So Naïve’: Inside Marjorie Taylor Greene’s Break With Trump</a>: Starting the new year with a revelation - people can surprise you. </p>\n<blockquote>\n<p>&quot;“After Charlie died, I realized that I’m part of this toxic culture. I really started looking at my faith. I wanted to be more like Christ.”</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.nytimes.com/athletic/6928990/2025/12/30/kazuyoshi-miura-age-oldest-player/?source=user_shared_article\" target=\"_blank\" rel=\"noopener\">Kazuyoshi Miura, 58, signs with new club to extend record-breaking soccer career - The Athletic</a>: </p>\n<blockquote>\n<p>He’s known as “King Kazu” in Japan and has played 40 professional seasons dating back to the mid-1980s. He started in Brazil’s Serie A, the country’s top division, with Santos in 1986. He has had brief, varying spells abroad over the course of his career, in Australia, Italy, and Croatia, all before 2000, when he returned to Japan for good, firstly with Kyoto Purple Sanga in 1999.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.sammendelsohn.com/post/beginner-s-guide-to-the-mahabharata-and-ramayana\" target=\"_blank\" rel=\"noopener\">Beginner’s Guide to the Mahabharata and Ramayana</a>: </p>\n<blockquote>\n<p>Do you desire to know the stories of India’s two great epics, but are intimidated by the massive tomes with hundreds of characters and thousands of pages full of sentences like this: “Ugrasrava, the son of Lomaharshana, surnamed Sauti, well-versed in the Puranas, bending with humility, one day approached the great sages of rigid vows, sitting at their ease, who had attended the twelve years’ sacrifice of Saunaka, surnamed Kulapati, in the forest of Naimisha.”</p>\n\n\n\n<p>Well if so, I’ve got just the guide for you!</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://x.com/systematicls/status/2004900241745883205\" target=\"_blank\" rel=\"noopener\">The Prison Of Financial Mediocrity</a>: I saw this a fair bit on my timeline. The response in the tweet below makes a lot more sense to me though. </p>\n<blockquote>\n<p>A 25-year-old making $70k is constantly fed content from people their age making $2mn, living in Bali, &quot;working&quot; four hours a day. The baseline for &quot;enough&quot; keeps moving.</p>\n\n\n\n<p>You never catch up. No matter what you achieve, social media will show you what you&#39;re missing. The spread between your life and the life you &quot;should&quot; have is maintained algorithmically, forever uncollapsible.</p>\n\n\n\n<p>So you have AI shrinking your timeline AND social media ensuring you never feel like you&#39;ve arrived. The pressure to escape, NOW, FAST, before it&#39;s too late, compounds daily.</p>\n</blockquote>\n</li>\n</ol>\n<div class=\"tweet-container\" style=\"margin:0 auto 1rem;\">\n  <blockquote class=\"twitter-tweet\" data-width=\"350\">\n    <a href=\"https://twitter.com/jaredkubin/status/2006028297688297475\" target=\"_blank\" rel=\"noopener\"></a>\n  </blockquote>\n</div> \n\n<p>5. </p>\n<div class=\"tweet-container\" style=\"margin:0 auto 1rem;\">\n  <blockquote class=\"twitter-tweet\" data-width=\"350\">\n    <a href=\"https://twitter.com/sebkrier/status/2005424424254673263\" target=\"_blank\" rel=\"noopener\"></a>\n  </blockquote>\n</div>\n\n<p>6. </p>\n<div class=\"tweet-container\" style=\"margin:0 auto 1rem;\">\n  <blockquote class=\"twitter-tweet\" data-width=\"350\">\n    <a href=\"https://twitter.com/kimmonismus/status/2005269273858777197\" target=\"_blank\" rel=\"noopener\"></a>\n  </blockquote>\n</div>\n\n<p>7. </p>\n<div class=\"tweet-container\" style=\"margin:0 auto 1rem;\">\n  <blockquote class=\"twitter-tweet\" data-width=\"350\">\n    <a href=\"https://twitter.com/davidmoss/status/2006255297212358686\" target=\"_blank\" rel=\"noopener\"></a>\n  </blockquote>\n</div>",
      "summary": "1. [‘I Was Just So Naïve’: Inside Marjorie Taylor Greene’s Break With Trump](https://www.nytimes.com/2025/12/29/magazine/marjorie-taylor-greene-trump-...",
      "date_published": "2026-01-03T00:00:00.000Z",
      "tags": [
        "links"
      ],
      "authors": [
        {
          "name": "Apoorv Trivedi",
          "url": "https://www.approvedthoughts.com"
        }
      ]
    },
    {
      "id": "https://www.approvedthoughts.com/posts/2025/links-20-28-dec.html",
      "url": "https://www.approvedthoughts.com/posts/2025/links-20-28-dec.html",
      "title": "Links: Weeks of 20 & 27 Dec 2025",
      "content_html": "<p>A long one to mark a year of link posts. Starting with feel-good stories for the festive season. </p>\n<ol>\n<li>The <a href=\"https://www.bbc.com/news/articles/cdxwllqz1l0o\" target=\"_blank\" rel=\"noopener\">best story</a> you’ll read this Christmas. Truly.</li>\n</ol>\n<div class=\"tweet-container\" style=\"margin:0 auto 1rem;\">\n  <blockquote class=\"twitter-tweet\" data-width=\"350\">\n    <a href=\"https://twitter.com/jameschappers/status/2004246851998884076\" target=\"_blank\" rel=\"noopener\"></a>\n  </blockquote>\n</div>\n\n<ol start=\"2\">\n<li><p><a href=\"https://www.nytimes.com/2025/12/24/opinion/community-housing-friendship.html?unlocked_article_code=1._E8.Q-Ij.uj6eZ0xBQBY_&smid=nytcore-ios-share\" target=\"_blank\" rel=\"noopener\">Your Social Muscles Are Wasting Away. Here Is How to Retrain Them.</a>: Everything old is new again and the search for connection is timeless. </p>\n<blockquote>\n<p>I’m a married 41-year-old woman who lives with housemates by choice. Rather than trying to acquire as much space and privacy as we could as quickly as we could, my husband and I decided to do the opposite. Parenting in our mid-30s, bursting out of our small London flat, we rented and then bought a London home with another couple. </p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.abc.net.au/news/2025-12-23/sisters-in-sweat-football-movement-without-judgement/106099240\" target=\"_blank\" rel=\"noopener\">Sisters in Sweat</a>: A couple years ago I played soccer every saturday morning, for about a year. Great memories. I get this. New year resolution. </p>\n<blockquote>\n<p>SiS has become a lifeline for thousands of women like Almeida in India, helping build a rare space where sport turns into an experience of liberation and camaraderie.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://buttondown.com/Booktime/archive/book-time-26-how-i-read/\" target=\"_blank\" rel=\"noopener\">How I read</a>: I have stopped reading long form for a while, so I am a sucker for these guides. Not a New Year resolution though. </p>\n<blockquote>\n<p>One of the many joys of living in New York City is the library system. The Performing Arts Library and Stavros Niarchos Foundation Library (on Fifth Ave across from the main branch) are both delightful places to spend a few hours in Manhattan, and in Brooklyn I spent more than my fair share of afternoons at the Grand Army Plaza main branch. I pick a section and walk the shelves until I get hungry, thirsty, or under-caffeinated.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.s-anand.net/blog/i-count-ai-summarized-books-as-read/\" target=\"_blank\" rel=\"noopener\">I count AI summarized books as “Read”</a>: Possibly a New Year resolution. </p>\n<blockquote>\n<p>I upload books to Claude and ask it to “Comprehensively and engagingly summarize and fact-check, writing in Malcolm Gladwell’s style, the book …”. I can read it in an hour instead of twelve. Four bullet points instead of forty. With (this surprised me) roughly the same number of insights I actually do something with.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.lesswrong.com/posts/dmLnWjyqAi5N2pqqz/ruby-s-ultimate-guide-to-thoughtful-gifts\" target=\"_blank\" rel=\"noopener\">Ruby&#39;s Ultimate Guide to Thoughtful Gifts</a>: New Year resolution?? Who am I kidding?</p>\n<blockquote>\n<p>Give a man a gift and he smiles for a day. Teach a man to gift and he’ll cause smiles for the rest of his life.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.compactmag.com/article/the-lost-generation/\" target=\"_blank\" rel=\"noopener\">The Lost Generation</a>: Tough reading. </p>\n<blockquote>\n<p>At the time, I blamed those women. Of course I did. They’ve since ascended the TV ladder and work as co-executive producers on major shows. On some level, even today I can’t help but think: That could have been me. That should have been me.</p>\n\n\n\n<p>But those women didn’t take our jobs any more than the 50-year-old Hollywood lifers had. The lifers were still there. They’re still there. And I’m not angry at the women and people of color who made it instead of me—people have the right, in most cases the responsibility, to take the opportunities that are offered them—or even at the older white guys who ensured that I didn’t. </p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.lesswrong.com/posts/yXSKGm4txgbC3gvNs/paranoia-a-beginner-s-guide\" target=\"_blank\" rel=\"noopener\">Paranoia: A Beginner&#39;s Guide</a>: Worth reading just for the first line. </p>\n<blockquote>\n<p>People sometimes make mistakes. (Citation Needed)</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://karpathy.bearblog.dev/chemical-hygiene/\" target=\"_blank\" rel=\"noopener\">Chemical hygiene</a>: A good follow up to the previous link?</p>\n</li>\n<li><p><a href=\"https://www.nytimes.com/interactive/2025/12/13/world/asia/cia-nuclear-device-himalayas-nanda-devi.html?unlocked_article_code=1.8k8.yB_i.Rl6p6NkHRzcq&smid=nytcore-ios-share\" target=\"_blank\" rel=\"noopener\">How Did the C.I.A. Lose a Nuclear Device?</a> Where else but in India?</p>\n<blockquote>\n<p>A plutonium-packed generator disappeared on one of the world’s highest mountains in a hush-hush mission the U.S. still won’t talk about.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://x.com/DrDominicNg/status/1999506871997313193\" target=\"_blank\" rel=\"noopener\">Castration increases lifespan across vertebrates</a>: Or at least, it feels longer.</p>\n</li>\n</ol>\n<div class=\"tweet-container\" style=\"margin:0 auto 1rem;\">\n  <blockquote class=\"twitter-tweet\" data-width=\"350\">\n    <a href=\"https://twitter.com/DrDominicNg/status/1999506871997313193\" target=\"_blank\" rel=\"noopener\"></a>\n  </blockquote>\n</div>\n\n<ol start=\"12\">\n<li><p><a href=\"https://parentheticallyspeaking.org/articles/pedagogy-recommendations/\" target=\"_blank\" rel=\"noopener\">Pedagogy Recommendations</a>: </p>\n<blockquote>\n<p>I think the single most thing important I can say is this: Every time you are inclined to use the word “teach”, replace it with “learn”. That is, instead of saying, “I teach”, say “They learn”. It’s very easy to determine what you teach; you can just fill slides with text and claim to have taught. Shift your focus to determining how you know whether they learned what you claim to have taught (or indeed anything at all!). That is much harder, but that is also the real objective of any educator.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://laurenleek.substack.com/p/how-google-maps-quietly-allocates?triedRedirect=true\" target=\"_blank\" rel=\"noopener\">How Google Maps quietly allocates survival across London’s restaurants</a>: It&#39;s amazing the rabbit holes people will go down. </p>\n<blockquote>\n<p>I needed a restaurant recommendation, so I did what every normal person would do: I scraped every single restaurant in Greater London and built a machine-learning model.</p>\n</blockquote>\n</li>\n<li><p>I didn&#39;t think the current LLMs could solve &quot;out-of-sample&quot; problems, ones that are not in their training set. But I <a href=\"https://x.com/JohSch314/status/2001300666917208222\" target=\"_blank\" rel=\"noopener\">was wrong</a>. And <a href=\"https://x.com/spicey_lemonade/status/2004558572496035892\" target=\"_blank\" rel=\"noopener\">another one</a>. These are hard problems from the looks of it.</p>\n</li>\n</ol>\n<div class=\"tweet-container\" style=\"margin:0 auto 1rem;\">\n  <blockquote class=\"twitter-tweet\" data-width=\"350\">\n    <a href=\"https://twitter.com/JohSch314/status/2001300666917208222\" target=\"_blank\" rel=\"noopener\"></a>\n  </blockquote>\n</div>\n    \n<div class=\"tweet-container\" style=\"margin:0 auto 1rem;\">\n  <blockquote class=\"twitter-tweet\" data-width=\"350\">\n    <a href=\"https://twitter.com/spicey_lemonade/status/2004558572496035892\" target=\"_blank\" rel=\"noopener\"></a>\n  </blockquote>\n</div>\n\n<ol start=\"15\">\n<li><a href=\"https://t.co/lGGBjlfe7b\" target=\"_blank\" rel=\"noopener\">Automate your life with Claude Code</a>:</li>\n</ol>\n<div class=\"video-container\">\n  <iframe\n    src=\"https://www.youtube.com/embed/uBJdwRPO1QE\"\n    allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\"\n    allowfullscreen>\n  </iframe>\n</div>\n\n<ol start=\"16\">\n<li><p><a href=\"https://simonwillison.net/2025/Dec/14/copywriters-reveal-how-ai-has-decimated-their-industry/#atom-everything\" target=\"_blank\" rel=\"noopener\">Copywriters reveal how AI has decimated their industry</a>: It is coming for the white-collar jobs.</p>\n<blockquote>\n<p>AI is really dehumanizing, and I am still working through issues of self-worth as a result of this experience. When you go from knowing you are valuable and valued, with all the hope in the world of a full career and the ability to provide other people with jobs... To being relegated to someone who edits AI drafts of copy at a steep discount because “most of the work is already done” ...</p>\n</blockquote>\n</li>\n<li></li>\n</ol>\n<div class=\"tweet-container\" style=\"margin:0 auto 1rem;\">\n  <blockquote class=\"twitter-tweet\" data-width=\"350\">\n    <a href=\"https://twitter.com/sebkrier/status/1999994684203045003\" target=\"_blank\" rel=\"noopener\"></a>\n  </blockquote>\n</div>\n\n<ol start=\"18\">\n<li><a href=\"https://snippet.finance/content-hub/\" target=\"_blank\" rel=\"noopener\">A curated list of the best finance blogs, tools, and webpages.</a></li>\n</ol>",
      "summary": "A long one to mark a year of link posts. Starting with feel-good stories for the festive season....",
      "date_published": "2025-12-27T00:00:00.000Z",
      "tags": [
        "links"
      ],
      "authors": [
        {
          "name": "Apoorv Trivedi",
          "url": "https://www.approvedthoughts.com"
        }
      ]
    },
    {
      "id": "https://www.approvedthoughts.com/posts/2025/links-13-dec-2025.html",
      "url": "https://www.approvedthoughts.com/posts/2025/links-13-dec-2025.html",
      "title": "Links: Week of 13 Dec 2025",
      "content_html": "<ol>\n<li><p><a href=\"https://pluralistic.net/2025/12/05/pop-that-bubble/\" target=\"_blank\" rel=\"noopener\">The Reverse-Centaur’s Guide to Criticizing AI</a>: </p>\n<blockquote>\n<p>Over the summer I wrote a book about what I think about AI, which is really about what I think about AI criticism, and more specifically, how to be a good AI critic. By which I mean: &quot;How to be a critic whose criticism inflicts maximum damage on the parts of AI that are doing the most harm.&quot; I titled the book The Reverse Centaur&#39;s Guide to Life After AI, and Farrar, Straus and Giroux will publish it in June, 2026.</p>\n\n\n\n<p>But you don&#39;t have to wait until then because I am going to break down the entire book&#39;s thesis for you tonight, over the next 40 minutes. I am going to talk fast.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://jaredhenderson.substack.com/p/the-best-philosophy-lectures-on-youtube\" target=\"_blank\" rel=\"noopener\">The Best Philosophy Lectures on YouTube</a>: </p>\n<blockquote>\n<p>Platforms like YouTube are the home of most slop, but they are also home to some fantastic educational content. I’ve compiled a list of philosophy lectures which you can enjoy, free of charge, to further your philosophical education.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://kyla.substack.com/p/everyone-is-gambling-and-no-one-is\" target=\"_blank\" rel=\"noopener\">Everyone is Gambling and No One is Happy</a>: </p>\n<blockquote>\n<p>A few weeks ago, Michael Green wrote an article stating that $140k is the new poverty line, that no one can afford to participate in society. It took over the Internet in a fiery storm. There have been many rebuttals, from Tyler Cowen to Jeremy Horpedahl. But the reaction to the piece was very interesting, as John Burn Murdoch wrote about.</p>\n\n\n\n<p>People overwhelmingly agreed with the article (many of the rebuttals to the rebuttals were “who cares if the math is wrong, the vibe is correct!). Both More Perfect Union and the Free Press republished it. People on both sides of the aisle, read the article and said “Well, yes, that is why things feel so bad. This is poverty. My economic pain is justified by the data now. What a relief.”</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.nytimes.com/video/world/australia/100000010580713/tangled-parachute-leaves-skydiver-hanging-from-plane.html?smid=url-share\" target=\"_blank\" rel=\"noopener\">Tangled Parachute Leaves Skydiver Hanging From Plane (NYT)</a>: Video at the link.</p>\n</li>\n</ol>",
      "summary": "1. [The Reverse-Centaur’s Guide to Criticizing AI](https://pluralistic.net/2025/12/05/pop-that-bubble/): \n    > Over the summer I wrote a book about w...",
      "date_published": "2025-12-13T00:00:00.000Z",
      "tags": [
        "links"
      ],
      "authors": [
        {
          "name": "Apoorv Trivedi",
          "url": "https://www.approvedthoughts.com"
        }
      ]
    },
    {
      "id": "https://www.approvedthoughts.com/posts/2025/links-06-dec-2025.html",
      "url": "https://www.approvedthoughts.com/posts/2025/links-06-dec-2025.html",
      "title": "Links: Week of 06 Dec 2025",
      "content_html": "<ol>\n<li><p><a href=\"https://wapo.st/3Kwgm3S\" target=\"_blank\" rel=\"noopener\">Humans killed millions of vultures. Now people are paying the price. (WaPo)</a>: So many unexpected links and unintended consequences. </p>\n<blockquote>\n<p>Although other animals scavenge dead cattle, none do so as effectively as vultures. The birds will pick ovedthoughts\n clean a bull carcass in 30 to 40 minutes.</p>\n\n\n\n<p>A paper published a year ago in the American Economic Review concluded that in certain districts, “the functional extinction of vultures — efficient scavengers who removed carcasses from the environment — increased human mortality by over 4% because of a large negative shock to sanitation.”</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.theatlantic.com/magazine/2026/01/elite-university-student-accommodation/684946/?gift=o6MjJQpusU9ebnFuymVdsFCUJZQ0G9lMNnLXcGfnS-w\" target=\"_blank\" rel=\"noopener\">Accommodation Nation</a>: </p>\n<blockquote>\n<p>At Brown and Harvard, more than 20 percent of undergraduates are registered as disabled. At Amherst, that figure is 34 percent.</p>\n\n\n\n<p>The types of accommodations vary widely. Some are uncontroversial, such as universities outfitting buildings with ramps and providing course materials in braille. These allow disabled students to access the same opportunities as their classmates. Some students get approved for housing accommodations, including single rooms and emotional-support animals.</p>\n\n\n\n<p>Other accommodations risk putting the needs of one student over the experience of their peers. One administrator told me that a student at a public college in California had permission to bring their mother to class. This became a problem, because the mom turned out to be an enthusiastic class participant.</p>\n\n\n\n<p>Professors told me that the most common—and most contentious—accommodation is the granting of extra time on exams. For students with learning disabilities, the extra time may be necessary to complete the test. But unlike a wheelchair ramp, this kind of accommodation can be exploited. Research confirms what intuition suggests: Extra time can confer an advantage to students who don’t have a disability.</p>\n</blockquote>\n</li>\n</ol>\n<div class=\"tweet-container\" style=\"margin:0 auto 1rem;\">\n  <blockquote class=\"twitter-tweet\" data-width=\"350\">\n    <a href=\"https://twitter.com/DKThomp/status/1995899910009626790?s=20\" target=\"_blank\" rel=\"noopener\"></a>\n  </blockquote>\n</div>\n\n\n<ol start=\"3\">\n<li><p><a href=\"https://medium.com/@tomwhitwell/52-things-i-learned-in-2025-edeca7e3fdd8\" target=\"_blank\" rel=\"noopener\">52 things I learned in 2025</a>: </p>\n<blockquote>\n<p>Global suicide rates have declined by 29% since 2000, due to measures like pesticide bans, more responsible media reporting of suicide, mental health education in schools and improved healthcare responses.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.nytimes.com/2025/12/06/health/rabies-death-skunk-kidney-transplant.html?unlocked_article_code=1.608.k035.oLxVa6Tf7ytX&smid=url-share\" target=\"_blank\" rel=\"noopener\">Kidney Recipient Dies After Transplant From Organ Donor Who Had Rabies (NYT)</a>: When its your time...</p>\n<blockquote>\n<p>Since 1978, four organ donors have passed rabies to 13 organ recipients, the report said. Of the 13 recipients, six who received treatment for rabies survived. The seven others, who did not receive treatment, died.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.nytimes.com/2025/12/06/arts/michael-buble-impersonator-documentary.html?unlocked_article_code=1.608.EZUE.bsciBnBdyzGf&smid=nytcore-ios-share\" target=\"_blank\" rel=\"noopener\">Bublé for a Day, but He Can’t Sing and There’s Little Resemblance (NYT)</a>: </p>\n<blockquote>\n<p>“Any outcome is funny,” Perlman, 36, said in an interview. “If they hate me, it’s funny. If they’re confused, it’s funny. If they love me, it’s funny. And my ego is not wrapped up in the idea of being the best Michael Bublé impersonator, so there’s some freedom in that.”</p>\n\n\n\n<p>After the performance, Perlman was astonished as people approached him for autographs and photos. He riffed about his Christmas special, his children and his love of Canada, and assured a handful of skeptics that, yes, he was the real Bublé.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.nytimes.com/2025/12/05/us/waymo-kit-kat-san-francisco.html?unlocked_article_code=1.608.ByvU.9N8971TJWuAC&smid=url-share\" target=\"_blank\" rel=\"noopener\">How Kit Kat Was Killed: Video Shows What a Robot Taxi Couldn’t See (NYT)</a>: Both the points below are correct but do they belong in the same paragraph? Of course, Ms. Brigman is right that Kit Kat might still be alive if there was a human driver behind the wheel of that car, but how many more cats and humans will die and be injured because the emotional response to incidents like these delays the adoption of self-driving cars? The response to this accident will <a href=\"https://www.nbcbayarea.com/news/local/waymo-driverless-cars-safety-record/3858460/\" target=\"_blank\" rel=\"noopener\">make every Waymo better</a>. The same is not true of accidents with human drivers. </p>\n<blockquote>\n<p>Those who defend Waymo taxis have pointed out that human drivers kill hundreds of animals each year in San Francisco. But Ms. Brigman believes that Kit Kat might still be alive if a human had been behind the wheel that October night.</p>\n</blockquote>\n</li>\n</ol>",
      "summary": "1. [Humans killed millions of vultures. Now people are paying the price. (WaPo)](https://wapo.st/3Kwgm3S): So many unexpected links and unintended con...",
      "date_published": "2025-12-07T00:00:00.000Z",
      "tags": [
        "links"
      ],
      "authors": [
        {
          "name": "Apoorv Trivedi",
          "url": "https://www.approvedthoughts.com"
        }
      ]
    },
    {
      "id": "https://www.approvedthoughts.com/posts/2025/links-29-nov-2025.html",
      "url": "https://www.approvedthoughts.com/posts/2025/links-29-nov-2025.html",
      "title": "Links: Week of 29 Nov 2025",
      "content_html": "<ol>\n<li><p><a href=\"https://www.nytimes.com/interactive/2025/11/20/us/typewriter-repair-seattle-bremerton.html?rsrc=flt&unlocked_article_code=1.5E8.lt5-.KUGQpncuXjWi&smid=url-share\" target=\"_blank\" rel=\"noopener\">How to Fix a Typewriter and Your Life</a>: What a story. </p>\n<blockquote>\n<p>One Sunday morning in 2014, he opened The Seattle Times and found a feature story about Bob Montgomery, age 92, known to friends, customers and locals simply as Mr. Montgomery. The article read like an obituary for a vanishing trade — fixing typewriters — suggesting that when Mr. Montgomery went, seven decades of expertise would vanish into the digital ether.</p>\n\n\n\n<p>Lundy read it once, then a second time. He had never given old typewriters much thought, but something stirred in him that he could not quite name. He showed the story to his wife, Lisa.</p>\n\n\n\n<p>“I think this might be it,” he told her. The next weekend, he drove to Bremerton, a weary naval town an hour’s ferry ride away and a world apart from gleaming, digitized Seattle.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.wsj.com/finance/investing/charlie-munger-life-final-years-berkshire-7c20c18e?st=sSqEkL&reflink=desktopwebshare_permalink\" target=\"_blank\" rel=\"noopener\">The Untold Story of Charlie Munger’s Final Years</a>: What a life.</p>\n<blockquote>\n<p>Near the end of life, Munger leaned on humor for strength. He told family members that Diet Coke was responsible for his longevity, lightening the mood.</p>\n\n\n\n<p>​And he shared a wish with a visitor.</p>\n\n\n\n<p>“Oh, to be 86 again,” he said.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.nytimes.com/2025/11/21/world/cryptography-group-lost-election-results.html?unlocked_article_code=1.5E8.-LX4.gAsr6z8DU8Rr&smid=url-share\" target=\"_blank\" rel=\"noopener\">Cryptographers Held an Election. They Can’t Decrypt the Results.</a>: </p>\n<blockquote>\n<p>A global group of researchers was unable to read the vote tally, after an official lost one of three secret code keys needed to unlock a hyper-secure election system.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://x.com/poezhao0605/status/1993525043415191566?s=20\" target=\"_blank\" rel=\"noopener\">AI in Education?</a>:</p>\n</li>\n</ol>\n<div class=\"tweet-container\" style=\"margin:0 auto 1rem;\">\n  <blockquote class=\"twitter-tweet\" data-width=\"350\">\n    <a href=\"https://twitter.com/poezhao0605/status/1993525043415191566?s=20\" target=\"_blank\" rel=\"noopener\"></a>\n  </blockquote>\n</div>\n\n<ol start=\"5\">\n<li><p><a href=\"https://wapo.st/3Xt3GNZ\" target=\"_blank\" rel=\"noopener\">Try a ‘fart walk’ to ease the pressure after that big Thanksgiving meal</a>: Nominate for the Ignobel Prize.</p>\n<blockquote>\n<p>Walking to relieve bloating and gas had long been advocated by doctors, but for years, we had no real experimental proof that it works. So in the mid-2000s, researchers from Barcelona decided to end the speculation and test whether even mild exercise could propel gas forward … and outward.</p>\n\n\n\n<p>The group first looked at healthy volunteers who pedaled on an adapted bicycle going at the equivalent of around 7 mph. The scientists infused gas into the people’s small intestines — mimicking what happens with meals — and then measured how much gas was expelled both during exercise and at rest.</p>\n\n\n\n<p>At rest, the result was a net gain in gas. Not fun.</p>\n\n\n\n<p>But after exercise? Things got juicy. After short bursts of mild physical activity, the scientists found that the amount of gas evacuated was greater than the amount infused. Exercise forced the removal of the added experimental gas and then some — meaning, it also pushed out gas hanging around even at baseline.</p>\n\n\n\n<p>So after a fart walk, you’ll be better off than you started.</p>\n</blockquote>\n</li>\n</ol>\n<div class=\"tweet-container\" style=\"margin:0 auto 1rem;\">\n  <blockquote class=\"twitter-tweet\" data-width=\"350\">\n    <a href=\"https://twitter.com/dieworkwear/status/1994646553391501712?s=20\" target=\"_blank\" rel=\"noopener\"></a>\n  </blockquote>\n</div>",
      "summary": "1. [How to Fix a Typewriter and Your Life](https://www.nytimes.com/interactive/2025/11/20/us/typewriter-repair-seattle-bremerton.html?rsrc=flt&unlocke...",
      "date_published": "2025-11-29T00:00:00.000Z",
      "tags": [
        "links"
      ],
      "authors": [
        {
          "name": "Apoorv Trivedi",
          "url": "https://www.approvedthoughts.com"
        }
      ]
    },
    {
      "id": "https://www.approvedthoughts.com/posts/2025/links-15-22-nov-2025.html",
      "url": "https://www.approvedthoughts.com/posts/2025/links-15-22-nov-2025.html",
      "title": "Links: Weeks of 15 & 22 Nov 2025",
      "content_html": "<ol>\n<li><p><a href=\"https://carlhendrick.substack.com/p/the-algorithmic-turn-the-emerging\" target=\"_blank\" rel=\"noopener\">The Algorithmic Turn: The Emerging Evidence On AI Tutoring That&#39;s Hard to Ignore</a>: An excellent and balanced piece on impact of AI on education. </p>\n<blockquote>\n<p>The Harvard study was conducted using GPT-4 in autumn 2023; by the time the paper was published in 2025, the underlying technology had already advanced. If AI tutoring can produce effect sizes of 0.73 to 1.3 standard deviations now, whilst still requiring pre-written solutions and careful scaffolding to prevent errors, what happens when the models can reason through physics problems independently? When they can diagnose misconceptions in real time? When they can adapt not just to individual students but to culturally specific contexts?</p>\n</blockquote>\n<p> and </p>\n<blockquote>\n<p>Yet there is a troubling paradox at the heart of AI tutoring. The very same technology that can produce effect sizes above 0.7 standard deviations can also make students demonstrably worse at learning. And I would argue that the harmful version is the one most students are currently using today.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.s-anand.net/blog/if-a-bot-passes-your-exam-what-are-you-teaching/\" target=\"_blank\" rel=\"noopener\">If a bot passes your exam, what are you teaching?</a></p>\n<blockquote>\n<p>My Tools in Data Science course has a Remote Online Exam. It was so difficult that, in 2023, it sparked threads titled “What is the purpose of an impossible ROE?” </p>\n\n\n\n<p>Today, despite making the test harder, students solve it easily with Claude, ChatGPT, etc. </p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.approvedthoughts.com/https://marginalrevolution.com/marginalrevolution/2025/11/the-effect-of-video-watching-on-childrens-skills.html\" target=\"_blank\" rel=\"noopener\">The Effect of Video Watching on Children’s Skills</a>:   </p>\n<blockquote>\n<p>This paper documents video consumption among school-aged children in the U.S. and explores its impact on human capital development. Video watching is common across all segments of society, yet surprisingly little is known about its developmental consequences. With a bunching identification strategy, we find that an additional hour of daily video consumption has a negative impact on children’s noncognitive skills, with harmful effects on both internalizing behaviors (e.g., depression) and externalizing behaviors (e.g., social difficulties). We find a positive effect on math skills, though the effect on an aggregate measure of cognitive skills is smaller and not statistically significant. These findings are robust and largely stable across most demographics and different ways of measuring skills and video watching. We find evidence that for Hispanic children, video watching has positive effects on both cognitive and noncognitive skills—potentially reflecting its role in supporting cultural assimilation. Interestingly, the marginal effects of video watching remain relatively stable regardless of how much time children spend on the activity, with similar incremental impacts observed among those who watch very little and those who watch for many hours.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://johnstone.substack.com/p/friction-was-the-feature\" target=\"_blank\" rel=\"noopener\">Friction Was the Feature</a>: </p>\n<blockquote>\n<p>There was a time when applying for a job meant choosing a handful of roles, tailoring a resume, and writing a real cover letter. The effort was a nuisance, but it quietly enforced focus. If you were going to burn a Saturday on an application, you probably cared about the job.</p>\n\n\n\n<p>Today, a candidate armed with an LLM can parse dozens of job postings, lift phrasing from each, and generate a set of keyword-optimized cover letters in no time. They can auto-tailor their resume to each posting. They can submit 30 applications in one sitting.</p>\n\n\n\n<p>This is better, right?</p>\n\n\n\n<p>Not for anyone, actually. Applications soar; recruiters drown. So we bolt on more automation: applicant tracking systems, resume parsers, AI interview schedulers. We convince ourselves we’ve built a better machine, but we haven’t redesigned the only machine that matters: the system matching the right people to the right work.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://simonwillison.net/2025/Nov/20/nano-banana-pro/#atom-everything\" target=\"_blank\" rel=\"noopener\">Nano Banana Pro aka gemini-3-pro-image-preview is the best available image generation model</a>: Read the whole thing and never believe an image again. </p>\n<blockquote>\n<p>That’s a pretty extraordinary result for such a simple prompt. The text is all spelled correctly and rendered without glitches. The content is solid too—it even included logos for the most popular publish platforms, and a tiny thumbnail of the Datasette UI which is close-enough for an infographic.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://x.com/aniketapanjwani/status/1987169152096989348\" target=\"_blank\" rel=\"noopener\">Optimize your LinkedIn</a>:</p>\n</li>\n</ol>\n<div class=\"tweet-container\" style=\"margin:0 auto 1rem;\">\n  <blockquote class=\"twitter-tweet\" data-width=\"350\">\n    <a href=\"https://twitter.com/aniketapanjwani/status/1987169152096989348\" target=\"_blank\" rel=\"noopener\"></a>\n  </blockquote>\n</div>\n\n<ol start=\"7\">\n<li><p><a href=\"https://constitutionofinnovation.eu/\" target=\"_blank\" rel=\"noopener\">The Constitution of Innovation</a>:</p>\n<blockquote>\n<p>However around 1980, this unprecedented growth period ended. While the United States maintained a remarkably constant 2 percent growth rate in average income, the European core economies decelerated, slowly and then sharply. Since 1995, Europe’s average annual growth has been just 1.1 percent; since 2004, it has been a mere 0.7 percent – all while the United States has continued on its steady track. By 2022 the relative gap in output per head has returned to where it was in 1970. Decades of convergence were surprisingly wiped out.4</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://citizenx.com/insights/norway-wealth-exodus/\" target=\"_blank\" rel=\"noopener\">Norway&#39;s Wealth Tax Unchains a Capital Exodus</a>: Perhaps Norway needs to click the previous link. </p>\n<blockquote>\n<p>Norway&#39;s wealth tax increase, expected to raise $146M, led to a $448M net loss as $54B in wealth left the country, reducing tax revenue by $594M.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.theguardian.com/uk-news/2025/nov/15/are-they-going-to-eat-me-alive-trail-runners-become-prey-in-newest-form-of-hunting\" target=\"_blank\" rel=\"noopener\">‘Are they going to eat me alive?’: trail runners become prey in newest form of hunting</a>: </p>\n<blockquote>\n<p>Would you like to be chased by a pack of hounds? It’s a question often put to highlight the cruelty of hunting, because the answer would seem to be no. Or so you would think.</p>\n\n\n\n<p>Yet increasing numbers of people are volunteering to be chased across the countryside by baying bloodhounds in what could soon be the only legal way to hunt with dogs in England and Wales, rather than pursuing animals or their scents.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.approvedthoughts.com/https://www.nytimes.com/2025/11/14/business/charlie-javice-jpmorgan-legal-bills.html\" target=\"_blank\" rel=\"noopener\">She Took JPMorgan for $175 Million. That Doesn’t Include Her Restaurant Bills.</a>: </p>\n<blockquote>\n<p>In September, Ms. Javice, 33, was sentenced to more than seven years in prison for fraud. In 2021, JPMorgan Chase acquired her start-up, Frank, for $175 million. Ms. Javice had claimed her company helped millions of people fill out their federal financial aid forms.</p>\n\n\n\n<p>After the acquisition, however, the bank discovered that she had lied about most of Frank’s customers. JPMorgan sued, and then prosecutors put Ms. Javice on trial. A jury convicted her this year.</p>\n\n\n\n<p>Along the way, Ms. Javice won a ruling that required the bank to pay her legal fees. JPMorgan has objected to the size of the fees in the past, and after her sentencing it decided to try to cut her off. The bank is trying the same maneuver with her former chief growth and acquisition officer, Olivier Amar, who was also convicted of fraud.    </p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.nytimes.com/2025/11/14/us/dog-shoots-owner-pennsylvania.html?smid=nytcore-ios-share\" target=\"_blank\" rel=\"noopener\">Dog Accidentally Shoots and Injures a Pennsylvania Man, the Police Say</a>: No comment.</p>\n<blockquote>\n<p>The man had been cleaning a shotgun and placed it on the bed shortly before it was fired. He received treatment at an area hospital.</p>\n</blockquote>\n</li>\n</ol>",
      "summary": "1. [The Algorithmic Turn: The Emerging Evidence On AI Tutoring That's Hard to Ignore](https://carlhendrick.substack.com/p/the-algorithmic-turn-the-eme...",
      "date_published": "2025-11-22T00:00:00.000Z",
      "tags": [
        "links"
      ],
      "authors": [
        {
          "name": "Apoorv Trivedi",
          "url": "https://www.approvedthoughts.com"
        }
      ]
    },
    {
      "id": "https://www.approvedthoughts.com/posts/2025/links-08-nov-2025.html",
      "url": "https://www.approvedthoughts.com/posts/2025/links-08-nov-2025.html",
      "title": "Links: Week of 08 Nov 2025",
      "content_html": "<ol>\n<li><p><a href=\"https://www.tiktok.com/@belligerentbarbies/video/7568380008633257271\" target=\"_blank\" rel=\"noopener\">Brenda</a>: </p>\n<blockquote>\n<p>I&#39;m worried that they put co-pilot in Excel because Excel is the beast that drives our entire economy and do you know who has tamed that beast?</p>\n\n\n\n<p>Brenda.</p>\n\n\n\n<p>Who is Brenda?</p>\n\n\n\n<p>She is a mid-level employee in every finance department, in every business across this stupid nation and the Excel goddess herself descended from the heavens, kissed Brenda on her forehead and the sweat from Brenda&#39;s brow is what allows us to do capitalism. [...]</p>\n\n\n\n<p>She&#39;s gonna birth that formula for a financial report and then she&#39;s gonna send that financial report to a higher up and he&#39;s gonna need to make a change to the report and normally he would have sent it back to Brenda but he&#39;s like oh I have AI and AI is probably like smarter than Brenda and then the AI is gonna fuck it up real bad and he won&#39;t be able to recognize it because he doesn&#39;t understand Excel because AI hallucinates.</p>\n\n\n\n<p>You know who&#39;s not hallucinating?</p>\n\n\n\n<p>Brenda.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.approvedthoughts.com/https://www.nytimes.com/2025/11/07/style/great-british-baking-show-jasmine-mitchell.html\" target=\"_blank\" rel=\"noopener\">Lovely Bakes, No Wig</a>: </p>\n<blockquote>\n<p>Jasmine Mitchell, the winner of the 16th season of “The Great British Baking Show,” stood out in the competition mainly for her creations — including a cake that was nearly four feet long — but also for her statement earrings, brightly colored outfits and her shiny, hairless head.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.pnas.org/doi/10.1073/pnas.1900712116\" target=\"_blank\" rel=\"noopener\">Optimists</a>: In stock market there&#39;s a saying: Pessimists sounds smart, optimists make money. Turns out they live longer too. </p>\n<blockquote>\n<p>Optimism is a psychological attribute characterized as the general expectation that good things will happen, or the belief that the future will be favorable because one can control important outcomes. Previous studies reported that more optimistic individuals are less likely to suffer from chronic diseases and die prematurely. Our results further suggest that optimism is specifically related to 11 to 15% longer life span, on average, and to greater odds of achieving “exceptional longevity,” that is, living to the age of 85 or beyond. These relations were independent of socioeconomic status, health conditions, depression, social integration, and health behaviors (e.g., smoking, diet, and alcohol use). Overall, findings suggest optimism may be an important psychosocial resource for extending life span in older adults.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.breakthroughjournal.org/p/why-i-stopped-being-a-climate-catastrophist\" target=\"_blank\" rel=\"noopener\">Why I Stopped Being a Climate Catastrophist</a>: Climate change seems quite visible. This year it rained in Indore through early November. In 90&#39;s and even early&#39;00s anything beyond mid-September was extremely unusual. But is it catastrophic? Will it become so? Maybe not. </p>\n<blockquote>\n<p>Depending on how much weight one gives to individual studies and models, versus broader literature reviews and scientific assessments, you can find some evidence for some intensification of some features of tropical cyclone behavior and frequency in some places. But what you won’t find, Norris’ reference to a single unpublished and unpeer-reviewed study notwithstanding, is good evidence that climate change has affected those things very much.</p>\n</blockquote>\n</li>\n<li><p><a href=\"\">He’s Been Charged With Dozens of Crimes. Nobody Knows His Name.</a></p>\n<blockquote>\n<p>Investigators confirmed that the caller was actually Carl Avinger and that the defendant was not. Nor was he Carl E. Avinger, John Stamp, Bobby Jackson, Craig Taylor, Graig T\n aylor, Anthony S. Williams, Kevin C. Windley, Kevin Windleg, Corey Blake Duncan, Marco Ferrari, Marco Ferrare, Elvis Taylor or Elvis Teller — names he had used to commit dozens of crimes across the city, on Long Island and as far away as Oklahoma over the last three decades, according to court, jail and prison records, and internal Police Department documents obtained by The New York Times.</p>\n\n\n\n<p>In the months that followed, Melinda Katz, the Queens district attorney, and her prosecutors from the housing bureau unearthed more information about the man whose roughly half-century life had been defined by deceit. But there was one fact they had yet to discover: his name.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://uatx.substack.com/p/uatx-is-ending-tuition-forever\" target=\"_blank\" rel=\"noopener\">UATX Is Ending Tuition Forever</a>: Interesting but will it matter? See #7. </p>\n<blockquote>\n<p>UATX will never charge tuition. And we will never take government money.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://inexactscience.substack.com/p/university-education-as-we-know-it\" target=\"_blank\" rel=\"noopener\">University education as we know it is over</a></p>\n<blockquote>\n<p>TL;DR: AI now solves university assignments perfectly in minutes. Students often use LLMs as a crutch rather than as a tutor, getting answers without understanding. To address these problems, I propose a barbell strategy: pure fundamentals (no AI) on one end, full-on AI projects on the other, with no mushy middle. Universities should focus on fundamentals.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://fly.io/blog/everyone-write-an-agent/\" target=\"_blank\" rel=\"noopener\">You Should Write An Agent</a>: </p>\n<blockquote>\n<p>Some concepts are easy to grasp in the abstract. Boiling water: apply heat and wait. Others you really need to try. You only think you understand how a bicycle works, until you learn to ride one.</p>\n\n\n\n<p>There are big ideas in computing that are easy to get your head around. The AWS S3 API. It’s the most important storage technology of the last 20 years, and it’s like boiling water. Other technologies, you need to get your feet on the pedals first.</p>\n\n\n\n<p>LLM agents are like that.</p>\n\n\n\n<p>People have wildly varying opinions about LLMs and agents. But whether or not they’re snake oil, they’re a big idea. You don’t have to like them, but you should want to be right about them. To be the best hater (or stan) you can be.</p>\n\n\n\n<p>So that’s one reason you should write an agent. But there’s another reason that’s even more persuasive, and that’s</p>\n\n\n\n<p>It’s Incredibly Easy    </p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.raphkoster.com/2025/11/03/game-design-is-simple-actually/\" target=\"_blank\" rel=\"noopener\">Game design is simple, actually</a>: </p>\n<blockquote>\n<p>So, let’s just walk through the whole thing, end to end. Here’s a twelve-step program for understanding game design.</p>\n</blockquote>\n<p> One thing I have noticing recently is that there are a ton of interesting blogs out there. Of course, there is substack, but there is a lot more and of extremely high quality except that my discovery model has broken down. Twitter / Google are no longer the best discovery option. I would like a better solution to this problem.</p>\n</li>\n</ol>",
      "summary": "1. [Brenda](https://www.tiktok.com/@belligerentbarbies/video/7568380008633257271): \n    > I'm worried that they put co-pilot in Excel because Excel is...",
      "date_published": "2025-11-08T00:00:00.000Z",
      "tags": [
        "links"
      ],
      "authors": [
        {
          "name": "Apoorv Trivedi",
          "url": "https://www.approvedthoughts.com"
        }
      ]
    },
    {
      "id": "https://www.approvedthoughts.com/posts/2025/links-01-nov-2025.html",
      "url": "https://www.approvedthoughts.com/posts/2025/links-01-nov-2025.html",
      "title": "Links: Week of 01 Nov 2025",
      "content_html": "<ol>\n<li><a href=\"https://x.com/statisticurban/status/1982995821655405017\" target=\"_blank\" rel=\"noopener\">5&#39;11&quot;?</a>:</li>\n</ol>\n<div class=\"tweet-container\" style=\"margin:0 auto 1rem;\">\n  <blockquote class=\"twitter-tweet\" data-width=\"350\">\n    <a href=\"https://twitter.com/statisticurban/status/1982995821655405017\" target=\"_blank\" rel=\"noopener\"></a>\n  </blockquote>\n</div>\n\n<ol start=\"2\">\n<li><p><a href=\"https://www.wsj.com/style/pumpkinscapers-are-making-a-killing-this-fall-ac74baa8\" target=\"_blank\" rel=\"noopener\">Pumpkin Stylists Are Making a Killing This Fall</a>: </p>\n<blockquote>\n<p>Her most popular package today is her smallest, which costs $325, comes with about 20 pumpkins and takes her six minutes to assemble into a display. The second-most popular is the biggest, at $1,350; that one takes her about 30 minutes. She can do the installations in the dark, wearing a headlamp. </p>\n</blockquote>\n</li>\n<li><p><a href=\"https://apnews.com/article/japan-sushi-jiro-centenarian-film-michelin-32dd0d4232d9818e38f8b8a984bab636\" target=\"_blank\" rel=\"noopener\">Japan’s sushi legend Jiro Ono turns 100 and is not ready for retirement</a>: </p>\n<blockquote>\n<p>What’s the secret of his health? “To work,” Ono replied to the question by Tokyo Gov. Yuriko Koike, who congratulated him.</p>\n\n\n\n<p>“I can no longer come to the restaurant every day ... but even at 100, I try to work if possible. I believe the best medicine is to work.”</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.washingtonpost.com/lifestyle/2025/10/29/appalachian-trail-hike-betty-kellenberger/\" target=\"_blank\" rel=\"noopener\">She hiked the entire Appalachian Trail at 80, unaware she’d just made history</a>: </p>\n<blockquote>\n<p>The day Betty Kellenberger hit a patch of freezing rain on Mount Madison, quitting crossed her mind. She was hungry, cold and sore.</p>\n\n\n\n<p>“You’re 80 years old,” she told herself in a pep talk atop a mountain in New Hampshire. “You can do it.”</p>\n\n\n\n<p>A few months later, Kellenberger stood at the Massachusetts-Vermont border, having just finished hiking the entire 2,197-mile Appalachian Trail. She became, without realizing it, the oldest woman ever to do it.</p>\n\n\n\n<p>“We put all kinds of limitations on ourselves,” said Kellenberger, who lives in Carson City, Michigan. “Sometimes the biggest one is we don’t get up and try it.”</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.youtube.com/watch?v=f3c4mQty_so\" target=\"_blank\" rel=\"noopener\">I Tried the First Humanoid Home Robot. It Got Weird.</a> I look forward to the day something like this becomes real and it may be &quot;real soon now&quot;, but I think this take from <a href=\"https://daringfireball.net/linked/2025/10/31/stern-1x-neo\" target=\"_blank\" rel=\"noopener\">Daring Fireball</a> is exactly right: </p>\n<blockquote>\n<p>The argument from CEO Bernt Børnich is that they’re using the videos from the current state of Neo, where its actions are entirely remote-controlled by employees of 1X Technologies, to train its autonomy. I call bullshit. This looks to me like nothing but a scam. It’s not autonomous at all, I don’t believe this company is going to achieve any practical degree of autonomy with this product, and even while it’s remote-controlled by human operators, it’s slow and clumsy.</p>\n</blockquote>\n</li>\n</ol>\n<div class=\"video-container\">\n  <iframe\n    src=\"https://www.youtube.com/embed/f3c4mQty_so\"\n    allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\"\n    allowfullscreen>\n  </iframe>\n</div>\n\n<ol start=\"6\">\n<li><p><a href=\"https://www.nytimes.com/2025/10/30/well/chatgpt-health-questions.html?\" target=\"_blank\" rel=\"noopener\">5 Tips When Consulting ‘Dr.’ ChatGPT</a>: As someone who has saved hundreds, if not thousands, of dollars in Physiotherapy bill using ChatGPT and is seemingly at the verge of fixing a long-standing chronic back pain, I am a fan. Used sensibly this is a powerful tool. Sensibly being the key word. </p>\n<p> For me, the ability to ask unlimited questions and provide unlimited context was a huge unlock relative to visiting a Physio. Also the time saved going to and from the clinic meant I could be much more regular. </p>\n<p> I fully agree that sharing detailed context and inviting clarifying questions are very important.  </p>\n<blockquote>\n<p>In general, A.I. chatbots are far better at offering answers than asking questions, so they tend to skip the important follow-ups a physician would ask, Dr. Turken said — like whether you have any underlying conditions or are taking any medications. This is especially problematic when you’re asking about potential diagnoses or medical advice.</p>\n\n\n\n<p>To compensate, Dr. Turken recommended prompting the chatbot with a line like: “Ask me any additional questions you need to reason safely.”</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.approvedthoughts.com/https://tommccarthy.net/when-quantum.html\" target=\"_blank\" rel=\"noopener\">When Will Quantum Computing Work?</a></p>\n<blockquote>\n<p>Huge investments are flowing into QC companies today. IonQ has a $19B market cap, Rigetti has a $10B cap, and PsiQuantum recently raised $1B.3D-Wave is not relevant, despite high qubit counts. Their machines are annealers, rather than gate based, and have less computational power than the QCs that IonQ, Rigetti, PsiQuantum, etc. are working on. This is a lot of money for an industry generating no real revenue, and without an apparent path to revenue over the next 5 years. Qubit counts have not been doubling each year, but even if they did, we&#39;d have 32 kq machines in 2030.4If qubits double each year, 1,000 qubits today grows to 32 kq in 5 years&#39; time. There are few - if any - commercial applications for machines of that size. Will these companies keep raising larger rounds until they achieve 100 kq? Or have they got some secret sauce we don&#39;t know about that investors are betting on? </p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.approvedthoughts.com/https://blog.dshr.org/2025/10/depreciation.html\" target=\"_blank\" rel=\"noopener\">Depreciation</a>: A skeptical take. </p>\n<blockquote>\n<p>He assumes that the ASICs are obsolete when they can no longer keep up with the hash rate so are no longer mining any Bitcoin. That is wrong. ASICs are obsolete when the Bitcoin they mine no longer pay for the electricity they use. The newer ASICs aren&#39;t just faster, they also use much less energy per hash. Look again at the depreciation graph, which suggests current ASICs go obsolete after 16 quarters. But Alex de Vries and Christian Stoll&#39;s estimate of 5 quarters to obsolescence is based on comparing the ASIC&#39;s production with the cost of their power consumption, which is the correct approach. The curves in the graph are correct out to the 40% line, but then should drop to zero.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.approvedthoughts.com/https://www.nytimes.com/2025/10/30/opinion/palantir-shyam-sankar-military.html\" target=\"_blank\" rel=\"noopener\">What Palantir Sees</a>: </p>\n<blockquote>\n<p>Douthat: So we’re going to talk about a lot of things. We’re going to talk about your biography and background, how you came to be an officer in the U.S. military, the future of technology and warfare. But we have to start with a very, very simple question: What is it that Palantir does?</p>\n\n\n\n<p>Sankar: Great question.</p>\n\n\n\n<p>Douthat: Thank you.</p>\n\n\n\n<p>Sankar: Obviously the most important question, yeah.</p>\n\n\n\n<p>Douthat: I spent a long time crafting it, I have to say.</p>\n</blockquote>\n</li>\n</ol>",
      "summary": "1. [5'11\"?](https://x.com/statisticurban/status/1982995821655405017):\n    ![embed](https://x.com/statisticurban/status/1982995821655405017)...",
      "date_published": "2025-11-01T00:00:00.000Z",
      "tags": [
        "links"
      ],
      "authors": [
        {
          "name": "Apoorv Trivedi",
          "url": "https://www.approvedthoughts.com"
        }
      ]
    },
    {
      "id": "https://www.approvedthoughts.com/posts/2025/links-25-oct-2025.html",
      "url": "https://www.approvedthoughts.com/posts/2025/links-25-oct-2025.html",
      "title": "Links: Week of 25 Oct 2025",
      "content_html": "<ol>\n<li><p><a href=\"https://www.nytimes.com/athletic/6721868/2025/10/21/landon-donovan-hairpiece-reaction-baldness/\" target=\"_blank\" rel=\"noopener\">Landon Donovan’s new hair, and the side effect he wasn’t expecting (NYT)</a>: As a man of a certain age, this hit a little too close to home. But, hats off (heheh!) to the man for having the courage to participate in a story like this. Making the world a hair safer for the rest of us.</p>\n<blockquote>\n<p>Donovan’s journey to a hair system started two decades ago when, as a 20-year-old, he noticed his hair was receding. He remembers one moment when he was warming up for a game against FC Dallas in Frisco and fans started chanting at him: “Rogaine! Rogaine!”</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://josephheath.substack.com/p/populism-fast-and-slow?publication_id=1796678&r=2smju\" target=\"_blank\" rel=\"noopener\">Populism fast and slow</a>: </p>\n<blockquote>\n<p>Working through the consequences of this, it is not difficult to see why the left has been unable to get much traction out of these changes, especially in developed countries. People are not rebelling against economic elites, but rather against cognitive elites. Narrowly construed, it is a rebellion against executive function. More generally, it is a rebellion against modern society, which requires the ceaseless exercise of cognitive inhibition and control, in order to evade exploitation, marginalization, addiction, and stigma. Elites have basically rigged all of society so that, increasingly, one must deploy the cognitive skills possessed by elites to successfully navigate the social world. (Try opening a bank account, renting an apartment, or obtaining a tax refund, without engaging in analytical processing.) The left, to the extent that it favours progress, is essentially committed to intensifying the features of the modern world that impose the greatest burdens of self-inhibition on individuals.</p>\n\n\n\n<p>Seeing things in this way makes it easier to understand why people get so worked up over seemingly minor issues, like language policing. The problem with demanding political correctness in speech, and punishing or ostracizing those who fail, is that it turns every conversation into a Stroop test, allowing elites the opportunity to exhibit conspicuous self-control. It requires the typical person, while speaking, to actively suppress the familiar word that is primed (e.g. “homeless”), and to substitute through explicit cognition the recently-minted word that is now favoured (e.g. “unhoused”). Elites are not just insensitive, but positively dismissive of the burdens that this imposes on many people. As a result, by performing the cognitive operation with such fluidity, they are not only demonstrating their superiority, they are rubbing other people’s faces in it. (From this perspective, it is not surprising that the demand for “they/them” pronouns upset some people even more, because the introduction of a plural pronoun forces a verb change, which requires an even more demanding cognitive performance.)</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://x.com/basedlayer/status/1979473779131625856\" target=\"_blank\" rel=\"noopener\">Age Inversion</a>:</p>\n<blockquote>\n<p>Everyone under 30 is prematurely old (worried about savings, career, FIRE).</p>\n\n\n\n<p>Everyone over 50 is desperately young (Burning Man, psychedelics).</p>\n\n\n\n<p>My theory: Information abundance aged the young by showing them all future problems all at once.</p>\n\n\n\n<p>Information abundance also made the old young by showing them all missed experiences all at once.</p>\n\n\n\n<p>So now Gen Z talks like retirement planners and boomers act like teenagers.</p>\n\n\n\n<p>It&#39;s so over.</p>\n</blockquote>\n</li>\n</ol>\n<div class=\"tweet-container\" style=\"margin:0 auto 1rem;\">\n  <blockquote class=\"twitter-tweet\" data-width=\"350\">\n    <a href=\"https://twitter.com/basedlayer/status/1979473779131625856\" target=\"_blank\" rel=\"noopener\"></a>\n  </blockquote>\n</div>\n\n<ol start=\"4\">\n<li><p><a href=\"\">The Remains of the Day</a> and the <a href=\"https://www.rottentomatoes.com/m/remains_of_the_day\" target=\"_blank\" rel=\"noopener\">movie</a>: </p>\n<p> I recently read <em>The Remains of the Day</em> by Kazuo Ishiguro, after coming across a positive review and remembering that there was an Oscar nominated movie based on the book in the &#39;90s, when watching the Oscars used to be in thing in India.</p>\n<p> After the first couple of chapters, thinking that this was perhaps an artsy book, I also opened up a chat with ChatGPT to improve my understanding of the book. </p>\n<p> This was useful but note to self: in future explicitly tell ChatGPT to avoid spoilers or otherwise reveal information or conclusions from the later chapters. To be fair, I did ask for themes to notice in rest of the book so its mostly on me. </p>\n<p> This isn&#39;t a thriller so in one sense the damage was limited. It is, however, a very subtle book that gradually unveils its layers and getting a bunch of bullet points upfront, spelling out every complexity and nuance wasn&#39;t ideal. </p>\n<p> The book is a masterpiece. Very few books have ever had this effect on me where, for days afterwards, I suddenly get a flash of feeling, a pang that forces me to stop for a breath. </p>\n<p> The closest analogy that came spontaneously to my mind was of eating great Japanese food (yes, even as a vegetarian) - the flavours are extremely subdued - very much the opposite of, say, Indian food. But they are unmistakable, sharp even, if you stop and notice, and you know it took a lot of effort and craftsmanship to pull it off just right.</p>\n<p> When reading fiction, I have a tendency to really flip pages towards the end, a tendency developed from years of reading mostly thriller novels. Because of this I found the book depressing, having barely spent any thought on the final pages. It is only while writing this post that I revisited the ending (and the title) and had to reconsider my understanding.   </p>\n<p> I had identified so deeply with the sense of loss in the middle of the book that I completely missed the gentle ray of hope that Ishiguro leaves us with at the end: as humans, on any given day and at any given time, all we can do is to make the best of whatever remains of the day. </p>\n<p> Highly recommended.</p>\n</li>\n</ol>",
      "summary": "1. [Landon Donovan’s new hair, and the side effect he wasn’t expecting (NYT)](https://www.nytimes.com/athletic/6721868/2025/10/21/landon-donovan-hairp...",
      "date_published": "2025-10-25T00:00:00.000Z",
      "tags": [
        "links"
      ],
      "authors": [
        {
          "name": "Apoorv Trivedi",
          "url": "https://www.approvedthoughts.com"
        }
      ]
    },
    {
      "id": "https://www.approvedthoughts.com/posts/2025/links-18-oct-2025.html",
      "url": "https://www.approvedthoughts.com/posts/2025/links-18-oct-2025.html",
      "title": "Links: Week of 18 Oct 2025",
      "content_html": "<ol>\n<li><p>Happy Diwali to those who celebrate! NYT had two glossy stories on just one <a href=\"https://www.approvedthoughts.com/https://www.nytimes.com/2025/10/12/style/diwali-ball-new-york-priyanka-chopra-nora-fatehi.html\" target=\"_blank\" rel=\"noopener\">Diwali Ball</a> in New York organized by <a href=\"https://www.approvedthoughts.com/https://www.nytimes.com/2025/10/11/nyregion/anjula-acharia-diwali-ball.html\" target=\"_blank\" rel=\"noopener\">Priyanka Chopra&#39;s manager</a>. Made me go &quot;Hmmm...&quot;. Was this about Diwali, was this about Priyanka Chopra or was this something else?</p>\n</li>\n<li><p><a href=\"https://www.approvedthoughts.com/https://www.nytimes.com/2025/10/15/world/europe/london-police-phone-theft-china-gang.html\" target=\"_blank\" rel=\"noopener\">London Became a Global Hub for Phone Theft. Now We Know Why.</a> Not a fan of clickbait headlines in NYT TBH but this story was revealing. I was under the impression that phone theft was a thing of past because of the hard to crack passcodes. Turns out not. The article didn&#39;t make it very clear how the thieves could get the phones working again. Apparently they can be sold for parts and something something China. Anyway, time to be careful out there again. </p>\n</li>\n<li><p>The pendulum has swung away from wokeness and cancel culture, as it should have. But sometimes it feels like, instead of passing through the center it <a href=\"https://www.compactmag.com/article/the-great-feminization/\" target=\"_blank\" rel=\"noopener\">went straight to the other end</a>. </p>\n</li>\n<li><p><a href=\"https://www.humaninvariant.com/blog/titles\" target=\"_blank\" rel=\"noopener\">Title Arbitrage as Status Engineering</a>: </p>\n<blockquote>\n<p>Title arbitrage is one of the most scalable levers a company can pull to increase the status of certain roles and attract talent. It costs nothing, works at scale, yet has the ability to reshape labor markets. The design space for title arbitrage remains wide open.</p>\n</blockquote>\n</li>\n<li><p>There are many ways through which the LLM subscriptions pay for themselves. For me it was physiotherapy. Here it is filing tax returns. I also wish more people would share &quot;how tos&quot; for solving different problems with LLMs. Here&#39;s a <a href=\"https://fixmydocuments.com/blog/06_tax_gpt_using_ai_for_tax_prep\" target=\"_blank\" rel=\"noopener\">manual</a> for tax returns. Full disclosure: I haven&#39;t tried it yet but the source is credible.</p>\n</li>\n</ol>\n<div class=\"tweet-container\" style=\"margin:0 auto 1rem;\">\n  <blockquote class=\"twitter-tweet\" data-width=\"350\">\n    <a href=\"https://twitter.com/patio11/status/1978549952147083649\" target=\"_blank\" rel=\"noopener\"></a>\n  </blockquote>\n</div>\n\n<ol start=\"6\">\n<li><p><a href=\"https://crookedtimber.org/2025/09/09/five-technological-achievements-that-we-wont-see-any-time-soon/\" target=\"_blank\" rel=\"noopener\">Five technological achievements! (That we won’t see any time soon.)</a>: </p>\n</li>\n<li><p><a href=\"https://www.approvedthoughts.com/https://vinaysridhar.com/ai-capital-markets-reflections.html\" target=\"_blank\" rel=\"noopener\">Observations on AI and the Capital Markets in 2025</a></p>\n<blockquote>\n<p>&quot;To provide some sense of scale, that means the equivalent of about $1,800 per person in America will be invested this year on AI&quot;. That is a bucketload of spending.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.campbellramble.ai/p/china-cant-win\" target=\"_blank\" rel=\"noopener\">China Can&#39;t Win</a>: Retweets are not endorsments, as they say. However there is a chorus of experts out there loudly claiming that China holds the upper hand in the tariff negotiations with US. I am not so sure and this looks like a worthwhile counterpoint. Added to reading list. </p>\n<blockquote>\n<p>China cannot win the decoupling because they face an impossible trilemma: protect the currency, bail out the banks, or maintain social stability. They can pick two at most. More likely, they get one. The math is unforgiving: $5-10 trillion in hidden property losses against $3 trillion in bank equity. That’s not a solvency problem—it’s a physics problem. Meanwhile, they’re bleeding $1.1 trillion annually just to hide the losses, burning their entire defense and R&amp;D budget combined on financial zombies.</p>\n</blockquote>\n</li>\n<li><p>Now that wokeness is over, is it ok to link to Louis CK clips again? Can one separate the art from the artist? I don&#39;t know but I love this one:</p>\n</li>\n</ol>\n<div class=\"video-container\">\n  <iframe\n    src=\"https://www.youtube.com/embed/kBLkX2VaQs4\"\n    allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\"\n    allowfullscreen>\n  </iframe>\n</div>",
      "summary": "1. Happy Diwali to those who celebrate! NYT had two glossy stories on just one [Diwali Ball](https://www.nytimes.com/2025/10/12/style/diwali-ball-new-...",
      "date_published": "2025-10-18T00:00:00.000Z",
      "tags": [
        "links"
      ],
      "authors": [
        {
          "name": "Apoorv Trivedi",
          "url": "https://www.approvedthoughts.com"
        }
      ]
    },
    {
      "id": "https://www.approvedthoughts.com/posts/2025/links-11-oct-2025.html",
      "url": "https://www.approvedthoughts.com/posts/2025/links-11-oct-2025.html",
      "title": "Links: Week of 11 Oct 2025",
      "content_html": "<ol>\n<li><p><a href=\"https://blog.supplysideliberal.com/post/2019/6/18/miles-kimball-on-diet-and-health-a-readers-guide\" target=\"_blank\" rel=\"noopener\">An Economists Guide to Weight Loss</a>: Pre-Ozempic. New Year Resolution?</p>\n</li>\n<li><p><a href=\"https://edition.cnn.com/2025/10/04/travel/patel-motel-story-hotel-history-cec\" target=\"_blank\" rel=\"noopener\">The Patel Motel Story</a>: I hope its well done. Must watch. </p>\n</li>\n<li><p><a href=\"https://x.com/justinskycak/status/1974452945300398434\" target=\"_blank\" rel=\"noopener\">99 Percentile vs. 99.9 Percentile</a>: Some of the responses are insightful too. This can be the problem of growing up in a small town or going to a &quot;weaker&quot; school for a certain type of person.</p>\n</li>\n</ol>\n<div class=\"tweet-container\" style=\"margin:0 auto 1rem;\">\n  <blockquote class=\"twitter-tweet\" data-width=\"350\">\n    <a href=\"https://twitter.com/justinskycak/status/1974452945300398434\" target=\"_blank\" rel=\"noopener\"></a>\n  </blockquote>\n</div>\n    \n<ol start=\"4\">\n<li><p><a href=\"https://www.thefp.com/p/ancient-wisdom-bernie-madoff-stole\" target=\"_blank\" rel=\"noopener\">Bernie Madoff Stole My Savings. Here’s How I Got My Life Back.</a>: Hats off.</p>\n<blockquote>\n<p>I think people who are facing a sudden reversal can learn from my experience. You can get through it. You have family, you have friends, you have resources that you don’t even know that you have.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://x.com/Noahpinion/status/1976164607564861936\" target=\"_blank\" rel=\"noopener\">Average?</a> I had to go down about 100 responses before someone asked, &quot;Man or woman?&quot;</p>\n</li>\n</ol>\n<div class=\"tweet-container\" style=\"margin:0 auto 1rem;\">\n  <blockquote class=\"twitter-tweet\" data-width=\"350\">\n    <a href=\"https://twitter.com/Noahpinion/status/1976164607564861936\" target=\"_blank\" rel=\"noopener\"></a>\n  </blockquote>\n</div>",
      "summary": "1. [An Economists Guide to Weight Loss](https://blog.supplysideliberal.com/post/2019/6/18/miles-kimball-on-diet-and-health-a-readers-guide): Pre-Ozemp...",
      "date_published": "2025-10-11T00:00:00.000Z",
      "tags": [
        "links"
      ],
      "authors": [
        {
          "name": "Apoorv Trivedi",
          "url": "https://www.approvedthoughts.com"
        }
      ]
    },
    {
      "id": "https://www.approvedthoughts.com/posts/2025/links-04-oct-2025.html",
      "url": "https://www.approvedthoughts.com/posts/2025/links-04-oct-2025.html",
      "title": "Links: Week of 04 Oct 2025",
      "content_html": "<ol>\n<li><p><a href=\"https://www.astralcodexten.com/p/your-review-the-russo-ukrainian-war\" target=\"_blank\" rel=\"noopener\">Your Review: The Russo-Ukrainian War - Astral Codex Ten</a>: </p>\n<blockquote>\n<p>One day as I was being lectured by a female HR representative for leaving my (cloth, non-medical) mask off for too long during lunch, I could barely hear what she was saying. All I could think of were the uncounted men across untold generations who had lived and died as warriors, with all the honor and pain that entailed. I thought of how men in Ukraine right now lived a modern version of that, while I allowed myself to be subject to the feminized safteyist ideology of everyday civilization.</p>\n\n\n\n<p>The spiritual offensiveness of this contrast hit me like a ton of bricks, more vividly than ever. At that moment I silently made my final decision. I wasn’t going to wait around to hear back from the Ukrainian Government. It was time, in the immortal words of an ISIS recruiter on Twitter to “put down the chicken wings n come to jihad, bro”.</p>\n</blockquote>\n<p> The entire <a href=\"https://www.astralcodexten.com/p/vote-in-the-2025-non-book-review\" target=\"_blank\" rel=\"noopener\">non-book review contest</a> at <a href=\"https://www.astralcodexten.com/\" target=\"_blank\" rel=\"noopener\">Astral Codex Ten</a> has been fantastic. </p>\n</li>\n<li><p><a href=\"https://scottsumner.substack.com/p/subjective-time\" target=\"_blank\" rel=\"noopener\">Subjective Time</a>: </p>\n<blockquote>\n<p>Like most people, I’ve noticed that time seems to speed up as one gets older. I moved to California in 2017, and the past 8 years seemed to pass by very quickly. I feel like time is moving twice as fast as when I was 35. Even as a 16-year old high school student I had already noticed that those “long summer vacations” seemed to pass by at twice the speed as when I was only 8 years old.</p>\n\n\n\n<p>In mathematical terms, subjective time seems roughly proportional to the inverse of one’s age. (At least since age 3 or 4, before that I recall nothing.) At age N, each lived year represents 1/nth of our life. If this is true, then this has some fairly startling implications.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://x.com/leading_nowhere/status/1973642925885325336\" target=\"_blank\" rel=\"noopener\">Jane Goodall: A life well lived, can anyone ask for more</a></p>\n</li>\n</ol>\n<div class=\"tweet-container\" style=\"margin:0 auto 1rem;\">\n  <blockquote class=\"twitter-tweet\" data-width=\"350\">\n    <a href=\"https://twitter.com/leading_nowhere/status/1973642925885325336\" target=\"_blank\" rel=\"noopener\"></a>\n  </blockquote>\n</div>\n\n<ol start=\"4\">\n<li><a href=\"https://x.com/Noahpinion/status/1649686441012895747\" target=\"_blank\" rel=\"noopener\">Democracy vs. Dictatorship</a></li>\n</ol>\n<div class=\"tweet-container\" style=\"margin:0 auto 1rem;\">\n  <blockquote class=\"twitter-tweet\" data-width=\"350\">\n    <a href=\"https://twitter.com/Noahpinion/status/1649820013522735104\" target=\"_blank\" rel=\"noopener\"></a>\n  </blockquote>\n</div>\n\n<ol start=\"5\">\n<li><p><a href=\"https://www.atvbt.com/21-facts-about-throwing-good-parties/\" target=\"_blank\" rel=\"noopener\">21 Facts About Throwing Good Parties</a>: </p>\n<blockquote>\n<p>Let me repeat that: Parties are a public service, you’re doing people a favor by throwing them. Someone might meet their new best friend or future lover at your gathering. In the short term, lovely people may feel less lonely, and that&#39;s thanks to you. In the long term, whole new children may ultimately exist in the world because you bothered to throw a party. Throwing parties is stressful for most people, but a great kindness to the community, so genuinely pat yourself on the back for doing this.</p>\n</blockquote>\n<p> Not so much facts, as very good opinions, but still. </p>\n</li>\n<li><p><a href=\"https://www.approvedthoughts.com/https://marginalrevolution.com/marginalrevolution/2025/10/new-data-on-social-media.html\" target=\"_blank\" rel=\"noopener\">New data on social media (MR)</a>: </p>\n<blockquote>\n<p>It has gone largely unnoticed that time spent on social media peaked in 2022 and has since gone into steady decline, according to an analysis of the online habits of 250,000 adults in more than 50 countries carried out for the FT by the digital audience insights company GWI. And this is not just the unwinding of a bump in screen time during pandemic lockdowns — usage has traced a smooth curve up and down over the past decade-plus.</p>\n</blockquote>\n<p> Societies, generations tend to develop immunity from toxic trends over time. </p>\n</li>\n<li><p><a href=\"https://www.approvedthoughts.com/https://marginalrevolution.com/marginalrevolution/2025/10/do-llms-favor-outputs-created-by-themselves.html\" target=\"_blank\" rel=\"noopener\">Do LLMs favor outputs created by themselves? (MR)</a></p>\n<blockquote>\n<p>It has gone largely unnoticed that time spent on social media peaked in 2022 and has since gone into steady decline, according to an analysis of the online habits of 250,000 adults in more than 50 countries carried out for the FT by the digital audience insights company GWI. And this is not just the unwinding of a bump in screen time during pandemic lockdowns — usage has traced a smooth curve up and down over the past decade-plus.</p>\n</blockquote>\n<p> Is it surprising that a system trained on human output is tribal, favoring in-group over out-group?</p>\n</li>\n<li><p><a href=\"https://blog.samaltman.com/sora-update-number-1\" target=\"_blank\" rel=\"noopener\">Sora update #1</a>: </p>\n<blockquote>\n<p>Please expect a very high rate of change from us; <strong>it reminds me of the early days of ChatGPT</strong>. We will make some good decisions and some missteps, but we will take feedback and try to fix the missteps very quickly. We plan to do our iteration on different approaches in Sora, but then apply it consistently across our products.</p>\n</blockquote>\n</li>\n</ol>",
      "summary": "1. [Your Review: The Russo-Ukrainian War - Astral Codex Ten](https://www.astralcodexten.com/p/your-review-the-russo-ukrainian-war): \n    > One day as ...",
      "date_published": "2025-10-04T00:00:00.000Z",
      "tags": [
        "links"
      ],
      "authors": [
        {
          "name": "Apoorv Trivedi",
          "url": "https://www.approvedthoughts.com"
        }
      ]
    },
    {
      "id": "https://www.approvedthoughts.com/posts/2025/links-27-sep-2025.html",
      "url": "https://www.approvedthoughts.com/posts/2025/links-27-sep-2025.html",
      "title": "Links: Week of 27 Sep 2025",
      "content_html": "<ol>\n<li><a href=\"https://x.com/sama/status/1971297661748953263\" target=\"_blank\" rel=\"noopener\">Pulse</a>: These days my morning work routine starts with trying to replicate this functionality through the use of multiple prompts and GPTs, so I am looking forward to when then feature comes to cattle class subscriptions.</li>\n</ol>\n<div class=\"tweet-container\" style=\"margin:0 auto 1rem;\">\n  <blockquote class=\"twitter-tweet\" data-width=\"350\">\n    <a href=\"https://twitter.com/sama/status/1971297661748953263\" target=\"_blank\" rel=\"noopener\"></a>\n  </blockquote>\n</div>\n\n<ol start=\"2\">\n<li><p><a href=\"https://archive.ph/2025.09.24-052808/https://www.bloomberg.com/news/features/2025-09-22/youtube-star-mrbeast-is-building-an-entertainment-empire\" target=\"_blank\" rel=\"noopener\">YouTube Star MrBeast Is Building an Entertainment Empire - Bloomberg</a>: Beast Industries sounds like a regular corporation with regular corporate problems. </p>\n<blockquote>\n<p>Right now, however, Beast Industries is hemorrhaging money. It’s had three years of losses, including more than $110 million in 2024. The viral videos account for all of it, overwhelming the profits from Feastables. Donaldson has been spending between $3 million and $4 million on every video he produces for the main YouTube channel, most of which lose money. In 2023, Beast spent $10 million to $15 million shooting videos it never released to the public because they weren’t up to its standards. He also lost tens of millions of dollars producing Beast Games, a popular show for Amazon Prime Video in which 1,000 people competed for $10 million by, among other things, moving a 10,000-pound boulder.</p>\n</blockquote>\n</li>\n<li></li>\n</ol>\n<div class=\"tweet-container\" style=\"margin:0 auto 1rem;\">\n  <blockquote class=\"twitter-tweet\" data-width=\"350\">\n    <a href=\"https://twitter.com/alex_prompter/status/1970078106427039838\" target=\"_blank\" rel=\"noopener\"></a>\n  </blockquote>\n</div>\n\n<p>Ignoring the hype up top, Google does seem to be creating some practical tools with LLMs. With base LLMs getting quite good now, I wonder if the next unlock is in creating tools with customized workflows for specific tasks. Wrappers.  </p>\n<ol start=\"4\">\n<li><a href=\"https://youtube.com/playlist?list=PL7A1F4CF36C085DE1&si=NZI8cOTfxZlRg-LB\" target=\"_blank\" rel=\"noopener\">Periodic Videos</a></li>\n</ol>",
      "summary": "...",
      "date_published": "2025-09-27T00:00:00.000Z",
      "tags": [
        "links"
      ],
      "authors": [
        {
          "name": "Apoorv Trivedi",
          "url": "https://www.approvedthoughts.com"
        }
      ]
    },
    {
      "id": "https://www.approvedthoughts.com/posts/2025/links-20-sep-2025.html",
      "url": "https://www.approvedthoughts.com/posts/2025/links-20-sep-2025.html",
      "title": "Links: Week of 20 Sep 2025",
      "content_html": "<ol>\n<li>If you’ve got a compliment, just let it out.</li>\n</ol>\n<div class=\"tweet-container\" style=\"margin:0 auto 1rem;\">\n  <blockquote class=\"twitter-tweet\" data-width=\"350\">\n    <a href=\"https://twitter.com/jayplemons/status/1964775529686688196\" target=\"_blank\" rel=\"noopener\"></a>\n  </blockquote>\n</div>\n\n\n<ol start=\"2\">\n<li><p>And the amazing thing is that <a href=\"https://x.com/ZyMazza/status/1965054215157346739\" target=\"_blank\" rel=\"noopener\">the opposite works</a> too!</p>\n<blockquote>\n<p>I think I mentioned this before but I was a national speech and debate octafinalist in high school and I was able to parlay that into a job running a debate program at an ambitious charter middle school in college. </p>\n\n\n\n<p>My approach was the exact opposite of this. Like half the kids were TERRIFIED of public speaking and were only doing it because their tiger moms insisted they had to (and the other half LOVED the attention). </p>\n\n\n\n<p>I had a lot of trouble getting the scared kids to open up and one day I asked one of the youngest ones what made her so afraid of speaking in front of the class, especially since they were all her friends. </p>\n\n\n\n<p>And she told me she was afraid she’d say something dumb or make a mistake and everyone would make fun of her. And that they’d laugh and laugh at her if she froze up. </p>\n\n\n\n<p>The next day I asked the class if anyone was scared of being made fun of and all the shy kids raised their hands. </p>\n\n\n\n<p>Now I don’t actually know if this is the same pathology in adults with fear of public speaking but I suspect it’s similar, and now I’ll get to how I addressed it which worked fabulously. </p>\n\n\n\n<p>First I told them that this was a ridiculous fear and that no one would make fun of them. But of course that doesn’t do anything lol. But then I told everyone to rip out 10 pieces of paper from their notebooks and crumple them up. </p>\n\n\n\n<p>And I told them I was going to give a speech. I told them if I said “uhh” or “um” or used any filler words they were to throw a paper ball at me and shout “shame!” 3 times pointing at me. </p>\n\n\n\n<p>And I gave a terrible speech. And they loved it! It was so much fun for them. </p>\n\n\n\n<p>But then! I had the students give speeches with the same rules, starting with the confident ones. </p>\n\n\n\n<p>After the third student the shy ones were volunteering. </p>\n\n\n\n<p>After the lesson I explained to them that we had accomplished 2 things:</p>\n\n\n\n<ol>\n<li>We had demonstrated how absurd such a reaction really is, because none of them would have ever reacted in that way if they weren’t specifically asked to, and none of them had any actual malice even when they did shout “shame” at their classmates</li>\n</ol>\n\n\n\n<ol start=\"2\">\n<li>Everyone had experienced the comically worst case scenario imaginable of public speaking and survived!</li>\n</ol>\n\n\n\n<p>So they became the rule during EVERY class and I was told by the other teachers that my shy students had started leading presentations and speaking up in class and some of them asked me how I worked with them. </p>\n\n\n\n<p>They were HORRIFIED when I told them lol. </p>\n\n\n\n<p>But it worked!</p>\n</blockquote>\n<p> This reminds me of <a href=\"https://en.wikipedia.org/wiki/Magical_creatures_in_Harry_Potter#Boggart\" target=\"_blank\" rel=\"noopener\">Boggarts in the Harry Potter books</a>.</p>\n</li>\n<li><p><a href=\"https://substack.com/inbox/post/171207709\" target=\"_blank\" rel=\"noopener\">Church Planting: When Venture Capital Finds Jesus</a>: </p>\n<blockquote>\n<p>This guy is founding an evangelical church, and I find his ecosystem fascinating. First for its stunning similarities to venture-capital-funded tech start-ups, and then for its simplicity and open-heartedness. None of the dynamics in church planting are unique or even particularly rare, but they are unobfuscated, and that makes church planting the equivalent of a large print book for the social dynamics that favor charismatic narcissists.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://wapo.st/3IjHTEy\" target=\"_blank\" rel=\"noopener\">Moon helium deal is biggest purchase of natural resources from space</a>: </p>\n<blockquote>\n<p>Finnish tech firm Bluefors, a maker of ultracold refrigerator systems critical for quantum computing, has purchased tens of thousands of liters of Helium-3 from the moon — spending “above $300 million” — through a commercial space company called Interlune. The agreement, which has not been previously reported, marks the largest purchase of a natural resource from space.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.approvedthoughts.com/https://www.nytimes.com/2025/09/16/opinion/ezra-klein-podcast-ben-shapiro.html\" target=\"_blank\" rel=\"noopener\">We Are Going to Have to Live Here With One Another (NYT)</a>: I try to avoid posting political or negative items but this was worth making an excception for. A long and insightful discussion between Ezra Klein and Ben Shapiro. Eye opening, if you read with an open mind. </p>\n</li>\n<li><p><a href=\"https://www.reuters.com/graphics/SOUTHEASTASIA-SCAMS/mypmxwdwwvr/\" target=\"_blank\" rel=\"noopener\">They traveled to Thailand. They wound up cyber scam slaves in Myanmar.</a>: Scary. I am not sure I like graphical news but an interesting experiment.</p>\n</li>\n<li><p><a href=\"https://x.com/Chris_Said/status/1968460412774490591\" target=\"_blank\" rel=\"noopener\">Teen depression has <em>declined</em> for the past 4 years, after peaking in 2021.</a>:</p>\n</li>\n</ol>\n<div class=\"tweet-container\" style=\"margin:0 auto 1rem;\">\n  <blockquote class=\"twitter-tweet\" data-width=\"350\">\n    <a href=\"https://twitter.com/Chris_Said/status/1968460412774490591\" target=\"_blank\" rel=\"noopener\"></a>\n  </blockquote>\n</div>\n\n<ol start=\"8\">\n<li><p><a href=\"https://simonwillison.net/2025/Sep/17/icpc/#atom-everything\" target=\"_blank\" rel=\"noopener\">ICPC medals for OpenAI and Gemini</a>: </p>\n<blockquote>\n<p>We received the problems in the exact same PDF form, and the reasoning system selected which answers to submit with no bespoke test-time harness whatsoever. For 11 of the 12 problems, the system’s first answer was correct. For the hardest problem, it succeeded on the 9th submission. Notably, the best human team achieved 11/12.</p>\n\n\n\n<p>We competed with an ensemble of general-purpose reasoning models; we did not train any model specifically for the ICPC. We had both GPT-5 and an experimental reasoning model generating solutions, and the experimental reasoning model selecting which solutions to submit. GPT-5 answered 11 correctly, and the last (and most difficult problem) was solved by the experimental reasoning model.</p>\n</blockquote>\n<p> and</p>\n<blockquote>\n<p>An advanced version of Gemini 2.5 Deep Think competed live in a remote online environment following ICPC rules, under the guidance of the competition organizers. It started 10 minutes after the human contestants and correctly solved 10 out of 12 problems, achieving gold-medal level performance under the same five-hour time constraint. See our solutions here.</p>\n</blockquote>\n</li>\n</ol>",
      "summary": "1. If you’ve got a compliment, just let it out.\n    ![embed](https://x.com/jayplemons/status/1964775529686688196)...",
      "date_published": "2025-09-21T00:00:00.000Z",
      "tags": [
        "links"
      ],
      "authors": [
        {
          "name": "Apoorv Trivedi",
          "url": "https://www.approvedthoughts.com"
        }
      ]
    },
    {
      "id": "https://www.approvedthoughts.com/posts/2025/links-14-sep-2025.html",
      "url": "https://www.approvedthoughts.com/posts/2025/links-14-sep-2025.html",
      "title": "Links: Week of 6 & 14 Sep 2025",
      "content_html": "<ol>\n<li><p><a href=\"https://www.approvedthoughts.com/https://www.nytimes.com/2025/08/31/sports/basketball/jeremy-lin-retires-linsanity-knicks.html\" target=\"_blank\" rel=\"noopener\">Jeremy Lin Retires After 15 Years That Included ‘Linsanity’ With the Knicks (NYT)</a>: </p>\n<blockquote>\n<p>The journeyman played for eight N.B.A. teams and won one championship. But he is best known for a brief stretch on the Knicks where he electrified fans and the nation.</p>\n</blockquote>\n<p> How to feel old #3892: Linsanity for 13 years ago and I remember it like it was yesterday!</p>\n</li>\n<li><p><a href=\"https://psyche.co/guides/how-to-resist-everyday-temptations-and-take-back-control\" target=\"_blank\" rel=\"noopener\">How to resist everyday temptations</a>: A guide we can all use, but probably won&#39;t. </p>\n</li>\n<li><p><a href=\"https://freakpalace.substack.com/p/youre-overthinking-packing\" target=\"_blank\" rel=\"noopener\">You&#39;re Overthinking Packing</a>: </p>\n<blockquote>\n<p>The amount of planning and thought that needs to go into the enterprise is surprisingly minimal. Count how many days you’re going for, then bring the same number of shirts as the number of days minus one (unless you have access to laundry, then probably less), 2-4 pairs of pants, a couple nicer dresses if that’s your thing and a change of shoes. Something to sleep in at night and a bathing suit if you’re headed somewhere warm. I always bring an extra pair of underwear and socks because sometimes I like to change throughout the day. Then experiment by trying on a bunch items to ensure everything goes together. Frankly, it’s not that different than figuring out what you’re going to wear on a day-to-day basis, which I trust you do all the time.</p>\n</blockquote>\n<p> Some thinking about packing, maybe some tools (I like using packing cubes and a travel scale is a must when flying budget) are surprisingly useful but yes, the curve drops sharply. </p>\n</li>\n<li><p><a href=\"https://builders.genagorlin.com/p/my-journey-from-adhd-skeptic-to-adderall\" target=\"_blank\" rel=\"noopener\">My journey from ADHD skeptic to Adderall enthusiast</a>:</p>\n<blockquote>\n<p>At 22, I thought ADHD was fake. An excuse for underachieving kids to get “accommodations” for procrastinating on their homework. From what vague knowledge I had of stimulants like Adderall, I regarded them with the same scorn as the accommodations.</p>\n\n\n\n<p>Seventeen years later, I credit Adderall with enabling me to build a 10x happier, healthier, more virtuous version of myself (to the chagrin of the countless Twitter trolls decrying my “meth addiction” in reply to this recent viral post). Here is my story.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.astralcodexten.com/p/what-is-man-that-thou-art-mindful\" target=\"_blank\" rel=\"noopener\">What Is Man, That Thou Art Mindful Of Him?</a>: God and Iblis debate if human intelligence is hitting a wall. Hilarious and insightful.</p>\n</li>\n<li><p><a href=\"https://substack.com/inbox/post/172555058\" target=\"_blank\" rel=\"noopener\">if you meet the singaporean on the road</a>: </p>\n<blockquote>\n<p>All this effort — fifty years of non-stop toil — turning a fallow wasteland into fertile earth, and where are all the crops we have to show for it? Where are all the local companies that we can point to and be proud of? Where are our Ericssons and Nokias?</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.houseofstrauss.com/p/llms-will-be-like-ozempic-for-golf\" target=\"_blank\" rel=\"noopener\">LLMs Will be Like Ozempic for Golf</a>: </p>\n<blockquote>\n<p>Rob was fantastic but it’s not as though I can just do a TrackMan excursion all the time. Yet I remained curious about why my swing was what it was. I had decent power, but lacked the ability to square the ball up with anything approaching consistency. Was I destined to always have this problem?</p>\n\n\n\n<p>And so I turned to LLMs, feeding the TrackMan stats into GPT. Based on 12 numbers, from one swing, GPT had me clocked. It knew my strengths and weaknesses. It fully understood the specifics of my poor technique. I’m sure Rob could have walked me through as much, but his time is limited. The machine had all the bandwidth in the world to deal with my “over the top” swing, how to fix it, and any other questions I might nag it with.</p>\n\n\n\n<p>A day later, my swing was different and self recorded video sent to Google’s Gemini confirmed the change. Swing errors that were decades in the making were corrected in the span of minutes. I’m not saying that I’ve suddenly made a leap from “Struggles to break 100” to “scratch golfer.” I’m just saying that a process that could have been expensive and arduous was instead efficient and relatively cheap. I apply the LLM’s fix, and it tells me whether I’ve actually applied it. The feedback is instant and objective.</p>\n</blockquote>\n<p> LLMs will be like Ozempic for a lot more than golf. Ability to ask unlimited questions without feeling embarrased or paying by the hour is a big deal. Imagination is the only thing limiting us. </p>\n</li>\n<li><p><a href=\"https://secondthoughts.ai/p/gpt-5-the-case-of-the-missing-agent\" target=\"_blank\" rel=\"noopener\">GPT-5: The Case of the Missing Agent</a></p>\n<blockquote>\n<p>It’s hard to say exactly why, even with all this progress, current AI models are still so hopeless at dealing with open-ended real-world situations. GPT-5’s inability to recognize that it was incapable of playing Minesweeper may indicate that its reasoning abilities do not generalize well. Its decision to spend 5 solid hours beating its head against the unimportant side goal of sharing a spreadsheet suggests a lack of training on the importance of setting priorities. The repeated factual errors in Gemini 2.5 Pro’s writeup of its merch store experience (click the link and look for “Editor’s Notes”) suggest an inability to keep track of key information over an extended project. Claude losing track of the fact that it is not a person is a reminder that in some ways these models really are just shallow imitations of human behavior (even as they demonstrate deep capability in other areas).</p>\n</blockquote>\n<p> So many benefits and so many limitations. </p>\n</li>\n<li><p><a href=\"https://arnoldkling.substack.com/p/reading-with-ai\" target=\"_blank\" rel=\"noopener\">Reading with AI</a>: </p>\n<blockquote>\n<p>Reading a non-fiction book from cover-to-cover is not efficient. I used to say that I read books “from the outside in.” I look at the book flap to find out about the author, who wrote the blurbs, and the subject matter of the book. Then I read the introduction and conclusion in order to get the main ideas. If I have read something by a different author that seems relevant, I look for that author in the index, and I head to those pages.</p>\n</blockquote>\n<p> and</p>\n<blockquote>\n<p>Once again, I believe in “Stop, Look, and Listen.” I start by asking the AI to summarize the key themes of the book. For each theme that the AI lists, I stop and try to put it into my own words. I test my understanding by feeding my words into the AI, in order get confirmation that my interpretation is correct. Another way that I ensure understanding is to suggest possible examples or ask the AI to provide examples.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.approvedthoughts.com/https://marginalrevolution.com/marginalrevolution/2025/09/how-to-think-about-ai-progress.html\" target=\"_blank\" rel=\"noopener\">How to think about AI progress</a>: Reproducing the entire post as it really is worth reading: </p>\n<blockquote>\n<p>The Zvi has <a href=\"https://thezvi.substack.com/p/reports-of-ai-not-progressing-or\" target=\"_blank\" rel=\"noopener\">a good survey post</a> on what is going on with the actual evidence.  I have a more general point to make, which I am drawing from my background in Austrian capital theory.</p>\n\n\n\n<p>There are easy projects, and there are hard projects.  You might also say short-term vs. long-term investments.</p>\n\n\n\n<p>The easier, shorter-term projects get done first.  For instance, the best LLMs now have near-perfect answers for a wide range of queries.  Those answers will not be getting much better, though they may be integrated into different services in higher productivity ways.</p>\n\n\n\n<p>Those improvements will yield an ongoing stream of benefits, but you will not see much incremental progress in the underlying models themselves.  Ten years from now, the word “strawberry” still will have three r’s, and the LLMs still will tell us that.  There are other questions, such as “what is the meaning of life?” where the AI answers also will not get much better.  I do not mean that statement as AI pessimism, rather the answers can only get so good because the question is not ideally specified in the first place.</p>\n\n\n\n<p>Then there are the very difficult concrete problems, such as in the biosciences or with math olympiad problems, and so on.  Progress in these areas seems quite steady and I would call it impressive.  But it will take quite a few years before that progress is turned into improvements in daily life.  Again, that does not have to be AI pessimism.  Just look at how we run our clinical trials, or how long the FDA approval process takes for new drugs, or how many people are reluctant to accept beneficial vaccines.  I predict that AI will not speed up those processes nearly as much as it ideally might.</p>\n\n\n\n<p>So the AI world before us is rather rapidly being bifurcated into two sectors:</p>\n\n\n\n<p>a) progress already is extreme, and is hard to improve upon, and</p>\n\n\n\n<p>b) progress is ongoing, but will take a long time to be visible to actual users and consumers</p>\n\n\n\n<p>And so people will complain that AI progress is failing us, but mostly they will be wrong.  They will be the victim of cognitive error and biases.  The reality is that progress is continuing apace, but it swallows up and renders ordinary some of its more visible successes.  What is left behind for future progress can be pretty slow.</p>\n</blockquote>\n<p>Yet another periodic reminder that <a href=\"https://marginalrevolution.com\" target=\"_blank\" rel=\"noopener\">MR</a> and <a href=\"https://thezvi.substack.com/\" target=\"_blank\" rel=\"noopener\">The Zvi</a> are both must-read for everyone.</p>\n</li>\n</ol>",
      "summary": "1. [Jeremy Lin Retires After 15 Years That Included ‘Linsanity’ With the Knicks (NYT)](https://www.nytimes.com/2025/08/31/sports/basketball/jeremy-lin...",
      "date_published": "2025-09-14T00:00:00.000Z",
      "tags": [
        "links"
      ],
      "authors": [
        {
          "name": "Apoorv Trivedi",
          "url": "https://www.approvedthoughts.com"
        }
      ]
    },
    {
      "id": "https://www.approvedthoughts.com/posts/2025/links-30-aug-2025.html",
      "url": "https://www.approvedthoughts.com/posts/2025/links-30-aug-2025.html",
      "title": "Links: Week of 30 Aug 2025",
      "content_html": "<ol>\n<li><p><a href=\"https://indianspotlighttime.substack.com/\" target=\"_blank\" rel=\"noopener\">IST: Indian Spotlight Time</a>: </p>\n<blockquote>\n<p>Exploring the India that often escapes headlines through the lived experiences of an ABCG: American Born Confused Gora. It’s a look beyond polished narratives and the obvious into the beautiful contradictions that actually power the country.</p>\n</blockquote>\n</li>\n<li></li>\n</ol>\n<div class=\"tweet-container\" style=\"margin:0 auto 1rem;\">\n  <blockquote class=\"twitter-tweet\" data-width=\"350\">\n    <a href=\"https://twitter.com/sdamico/status/1959779975978238446\" target=\"_blank\" rel=\"noopener\"></a>\n  </blockquote>\n</div>\n\n<ol start=\"3\">\n<li><p><a href=\"https://ethanding.substack.com/p/ai-subscriptions-get-short-squeezed\" target=\"_blank\" rel=\"noopener\">tokens are getting more expensive</a>: A good discussion of why the AI Labs might stuggle with profitability. </p>\n<blockquote>\n<p>while it&#39;s true each generation of frontier model didn&#39;t get more expensive per token, something else happened. something worse. the number of tokens they consumed went absolutely nuclear.</p>\n</blockquote>\n</li>\n<li><p>Patrick OShaughnessy podcast with Joe Liemandt, Principal @ Alpha School</p>\n</li>\n</ol>\n<div class=\"video-container\">\n  <iframe\n    src=\"https://www.youtube.com/embed/a06qSgfccZs\"\n    allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\"\n    allowfullscreen>\n  </iframe>\n</div> \n\n<ol start=\"5\">\n<li>Failure of imagination is the only thing holding us back!</li>\n</ol>\n<div class=\"tweet-container\" style=\"margin:0 auto 1rem;\">\n  <blockquote class=\"twitter-tweet\" data-width=\"350\">\n    <a href=\"https://twitter.com/paularambles/status/1960762742266306717\" target=\"_blank\" rel=\"noopener\"></a>\n  </blockquote>\n</div>",
      "summary": "1. [IST: Indian Spotlight Time](https://indianspotlighttime.substack.com/): \n    > Exploring the India that often escapes headlines through the lived ...",
      "date_published": "2025-08-30T00:00:00.000Z",
      "tags": [
        "links"
      ],
      "authors": [
        {
          "name": "Apoorv Trivedi",
          "url": "https://www.approvedthoughts.com"
        }
      ]
    },
    {
      "id": "https://www.approvedthoughts.com/posts/2025/links-23-aug-2025.html",
      "url": "https://www.approvedthoughts.com/posts/2025/links-23-aug-2025.html",
      "title": "Links: Week of 23 Aug 2025",
      "content_html": "<ol>\n<li><p><a href=\"https://www.nytimes.com/2025/08/12/dining/marthas-vineyard-alpha-gal-tick-bites.html?smid=nytcore-ios-share\" target=\"_blank\" rel=\"noopener\">Why Is Martha’s Vineyard Going Vegan? It’s All About Tick Bites. (NYT)</a>: </p>\n<blockquote>\n<p>On the porch of the Chilmark General Store and at sunset-watching parties on Menemsha Beach, conversations circle ineluctably to the lone star tick, which after a single bite can leave people with a life-threatening allergy to most meat and dairy.</p>\n\n\n\n<p>Known as alpha-gal syndrome, the condition is changing the way many people shop, cook and eat in a place long known as a food-lover’s retreat for its thriving independent farms and restaurants. These new habits may prove to be lasting, as some islanders who initially avoided beef and cheese temporarily, out of necessity, later give them up for good out of preference.</p>\n\n\n\n<p>“It’s sort of supersized vegetarianism,” said Rebecca Miller, a farm owner who has the syndrome herself.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.nytimes.com/2025/08/12/world/asia/india-samosas-unhealthy.html?smid=nytcore-ios-share\" target=\"_blank\" rel=\"noopener\">Are Samosas Unhealthy? Some Indians Find Official Advice Hard to Swallow.</a>: </p>\n<blockquote>\n<p>So, when a recent government advisory put samosas — along with other deep-fried Indian snacks and Western foods such as burgers and French fries — on a list of things that should be eaten in moderation because of their high oil and sugar content, there was an unsurprising outcry. Social media erupted with memes, and Indian media chimed in to say the country’s most iconic bites were under attack.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://x.com/rivatez/status/1942963545940922605\" target=\"_blank\" rel=\"noopener\">@rivatez</a>:</p>\n<blockquote>\n<p>That animals seemingly anticipate events should humble us more. Changes in groundwater chemistry, electromagnetic fields and sound waves make animals restless, distressed and even relocate</p>\n\n\n\n<p>In the West it is seen as ‘woo’ to contemplate that energy/weather humans don’t <em>consciously</em> experience can affect our psychology, and yet we forget that we are animals too.  </p>\n\n\n\n<p>Even outside extreme weather events, the lunar cycle moves oceans, huge bodies of water. We are, like all animals, primarily made of water. The word ‘lunacy’ comes from the ancient understanding that our minds can be affected by it </p>\n\n\n\n<p>An interesting experiment is to log your daily mood for a few months- ups and downs, anxiety / joy levels, big arguments with loved ones etc. Then afterwards, retroactively chart it against lunar cycles and NASA space weather data that tracks geomagnetic storms, solar flares etc. </p>\n\n\n\n<p>Be open- minded and try it. I, too, used to think this stuff was BS </p>\n\n\n\n<p>Now I think much of modern psychiatry is giving people drugs to tune down people’s individual responses to these external inputs, eg ‘bipolar’ might just indicate high sensitivity </p>\n\n\n\n<p>How many important scientific breakthroughs lie on the other side of our collective dismissal of ‘woo’?</p>\n</blockquote>\n<div class=\"image-container\"><a href=\"https://x.com/LarryBrockJr/status/1942357971565944877\" target=\"_blank\" rel=\"noopener\"><img src=\"https://www.approvedthoughts.com//posts/2025/Aug/23-Aug-2025-Link-3.png\" alt=\"cows\" loading=\"lazy\" class=\"inline-image linked-image\" id=\"img-kqakoxw6m\" /></a></div>\n</li>\n<li><p><a href=\"https://guzey.com/why-i-believe-in-agi-again/\" target=\"_blank\" rel=\"noopener\">Why I believe in AGI (again)</a>: </p>\n<blockquote>\n<p>First, I’m now convinced that ChatGPT understands what it reads. Second, reasoning models persuade me that ChatGPT is creative. Third, ChatGPT summarizes texts extremely well, which I believe to be a robust measure of intelligence.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://x.com/DKThomp/status/1956014687885074507\" target=\"_blank\" rel=\"noopener\">Derek Thompson</a>: \n <img src=\"https://www.approvedthoughts.com//posts/2025/Aug/23-Aug-2025-Link-5.png\" alt=\"Good News\"></p>\n<blockquote>\n<p>&quot;The better news is that this is happening at a time when exercise seems to be increasing for many groups, especially the young and old. The bad news is ... deep Medicaid cuts and declines in childhood vaccine uptake are not exactly optimistic predictors of American health.&quot;</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.astralcodexten.com/p/your-review-dating-men-in-the-bay?\" target=\"_blank\" rel=\"noopener\">Your Review: Dating Men In The Bay Area</a>: Not what it says on the label at all! Recommended.</p>\n</li>\n<li><p><a href=\"https://www.wsj.com/style/adult-sleepaway-camp-social-getaway-98e47886\" target=\"_blank\" rel=\"noopener\">Adults Are Going to Sleep-away Camp to Make Friends. It Seems to Actually Work.</a>: </p>\n<blockquote>\n<p>“Anyone that has worked at camp or grown up in the camp world understands there is a powerful people connection that forms at camp,” said Liam Macleod, a longtime camp professional and marketing director at Camp No Counselors. “It’s camp magic and it’s hard to replicate in the regular world.” </p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.reddit.com/r/ChatGPTPro/comments/1mt5igj/what_is_the_most_profitable_thing_you_have_done/\" target=\"_blank\" rel=\"noopener\">What is the most profitable thing you have done with ChatGPT? on Reddit</a> via <a href=\"https://simonwillison.net/2025/Aug/19/rchatgptpro/#atom-everything\" target=\"_blank\" rel=\"noopener\">Simon Willison</a>: In dollar terms, probably crafting fundraising messages for charity event organized by my Alumni Association. In real terms, physiotherapy for my back and legs. So far. Some great examples at the link. Failure of imagination remains the biggest hurdle in getting value from LLMs. </p>\n</li>\n<li><p><a href=\"https://www.wired.com/story/ai-comes-up-with-bizarre-physics-experiments-but-they-work/\" target=\"_blank\" rel=\"noopener\">AI Is Designing Bizarre New Physics Experiments That Actually Work</a>: </p>\n<blockquote>\n<p>It took months of effort to understand what the AI was doing. It turned out that the machine had used a counterintuitive trick to achieve its goals. It added an additional three-kilometer-long ring between the main interferometer and the detector to circulate the light before it exited the interferometer’s arms. Adhikari’s team realized that the AI was probably using some esoteric theoretical principles that Russian physicists had identified decades ago to reduce quantum mechanical noise. No one had ever pursued those ideas experimentally. “It takes a lot to think this far outside of the accepted solution,” Adhikari said. “We really needed the AI.”</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://cookbook.openai.com/examples/gpt-5/gpt-5_prompting_guide\" target=\"_blank\" rel=\"noopener\">GPT-5 prompting guide</a>: </p>\n<blockquote>\n<p>GPT-5, our newest flagship model, represents a substantial leap forward in agentic task performance, coding, raw intelligence, and steerability.</p>\n\n\n\n<p>While we trust it will perform excellently “out of the box” across a wide range of domains, in this guide we’ll cover prompting tips to maximize the quality of model outputs, derived from our experience training and applying the model to real-world tasks. We discuss concepts like improving agentic task performance, ensuring instruction adherence, making use of newly API features, and optimizing coding for frontend and software engineering tasks - with key insights into AI code editor Cursor’s prompt tuning work with GPT-5.</p>\n\n\n\n<p>We’ve seen significant gains from applying these best practices and adopting our canonical tools whenever possible, and we hope that this guide, along with the <a href=\"https://platform.openai.com/chat/edit?optimize=true\" target=\"_blank\" rel=\"noopener\">prompt optimizer tool</a> we’ve built, will serve as a launchpad for your use of GPT-5. But, as always, remember that prompting is not a one-size-fits-all exercise - we encourage you to run experiments and iterate on the foundation offered here to find the best solution for your problem.</p>\n</blockquote>\n<p>And a <a href=\"https://github.com/anthropics/prompt-eng-interactive-tutorial\" target=\"_blank\" rel=\"noopener\">tutorial</a> by  Anthropic. </p>\n</li>\n<li><p><a href=\"https://joincolossus.com/article/joe-liemandt-class-dismissed/\" target=\"_blank\" rel=\"noopener\">Class Dismissed</a>: Alpha School is getting a lot of coverage all of a sudden. Long piece about the people and the tech behind it.</p>\n</li>\n</ol>",
      "summary": "1. [Why Is Martha’s Vineyard Going Vegan? It’s All About Tick Bites. (NYT)](https://www.nytimes.com/2025/08/12/dining/marthas-vineyard-alpha-gal-tick-...",
      "date_published": "2025-08-23T00:00:00.000Z",
      "tags": [
        "links"
      ],
      "authors": [
        {
          "name": "Apoorv Trivedi",
          "url": "https://www.approvedthoughts.com"
        }
      ]
    },
    {
      "id": "https://www.approvedthoughts.com/posts/2025/links-16-aug-2025.html",
      "url": "https://www.approvedthoughts.com/posts/2025/links-16-aug-2025.html",
      "title": "Links: Week of 16 Aug 2025",
      "content_html": "<ol>\n<li><p><a href=\"https://www.experimental-history.com/p/face-it-youre-a-crazy-person\" target=\"_blank\" rel=\"noopener\">Face it: you&#39;re a crazy person</a>: </p>\n<blockquote>\n<p>I meet a lot of people who don’t like their jobs, and when I ask them what they’d rather do instead, about 75% say something like, “Oh, I dunno, I’d really love to run a little coffee shop.” If I’m feeling mischievous that day, I ask them one question: “Where would you get the coffee beans?”</p>\n\n\n\n<p>If that’s a stumper, here are some followups: Which kind of coffee mug is best? How much does a La Marzocco espresso machine cost? Would you bake your blueberry muffins in-house or would you buy them from a third party?</p>\n\n\n\n<p>The point of the Coffee Beans Procedure is this: if you can’t answer those questions, if you don’t even find them <em>interesting</em>, then you should not open a coffee shop, because this is how you will spend your days as a cafe owner. You will not be sitting droopy-lidded in an easy chair, sipping a latte and greeting your regulars as you page through <em>Anna Karenina</em>. You will be running a small business that sells hot bean water.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://usefulfictions.substack.com/p/50-things-i-know?r=3a7g0&triedRedirect=true\" target=\"_blank\" rel=\"noopener\">50 things I know. And wish I&#39;d known sooner</a>: </p>\n<blockquote>\n<ol start=\"41\">\n<li>It’s almost impossible to have an easy life and be interesting. Suffering is what gives people texture.</li>\n</ol>\n</blockquote>\n<p> and </p>\n<blockquote>\n<ol start=\"47\">\n<li>Heaven is a set of gradually increasing but attainable challenges.</li>\n</ol>\n</blockquote>\n<p> Listicle has become a bad word but there is a reason they are popular. A well done one is <em>*chef&#39;s kiss *</em>. </p>\n</li>\n<li><p><a href=\"https://www.persuasion.community/p/27-notes-on-growing-older\" target=\"_blank\" rel=\"noopener\">27 Notes on Growing Old(er)</a>: </p>\n<blockquote>\n<ol start=\"6\">\n<li>The physicist Michael Nielsen tells us that the Polish-American mathematician Stanislaw Ulam perceived his life as sharply divided into two halves: “In the first half, he was always the youngest person in the group. In the second half, he was always the oldest. There was no transitional period.” There was no transitional period.</li>\n</ol>\n</blockquote>\n<p> and </p>\n<blockquote>\n<ol start=\"17\">\n<li>... The human condition is that we want it all, and we’re not willing to make trades… ‘deathbed regrets’ typically have the bias of wanting the other path—the path they could have taken—without considering the cost of that path. So they say, “Hey I was really successful and I did all these things, but you know, I would give it all up today to have my family.” It’s like, well yeah, but you didn’t, because you actually chose the path that you’re on, and you weren’t willing to do that. What you are saying right now is that you want it all. Sure. So does everyone.</li>\n</ol>\n</blockquote>\n</li>\n<li><p>Mad respect for whoever decided that there was a business opportunity here and then made it happen.</p>\n</li>\n</ol>\n<div class=\"tweet-container\" style=\"margin:0 auto 1rem;\">\n  <blockquote class=\"twitter-tweet\" data-width=\"350\">\n    <a href=\"https://twitter.com/junkbondanalyst/status/1954520550362988867\" target=\"_blank\" rel=\"noopener\"></a>\n  </blockquote>\n</div>\n   \n\n<ol start=\"5\">\n<li><p><a href=\"https://www.approvedthoughts.com/https://www.nytimes.com/2025/08/11/science/meteor-georgia-older-than-earth.html\" target=\"_blank\" rel=\"noopener\">Space Rock That Punched Through Roof Almost Struck Resident (NYT)</a>: </p>\n<blockquote>\n<p>“I suspect that he heard three simultaneous things,” Mr. Harris said of the person whose home was hit. “One was the collision with his roof, one was a tiny cone of a sonic boom, and a third was it impacting the floor all in the same moment.”</p>\n</blockquote>\n<p> Looking at the photos, I think he would have died if it had struck him. Here&#39;s <a href=\"https://www.nytimes.com/2025/08/15/us/arkansas-state-park-diamond-found-engagment-ring.html?\" target=\"_blank\" rel=\"noopener\">another amazing ancient rock story</a> from the NYT. </p>\n</li>\n<li><p><a href=\"https://www.approvedthoughts.com/https://www.nytimes.com/2025/08/10/business/last-supper-joseph-awuah-darko.html\" target=\"_blank\" rel=\"noopener\">Performance Art?</a></p>\n</li>\n<li><p>The ratio of members!</p>\n</li>\n</ol>\n<div class=\"tweet-container\" style=\"margin:0 auto 1rem;\">\n  <blockquote class=\"twitter-tweet\" data-width=\"350\">\n    <a href=\"https://twitter.com/reddit_lies/status/1954926000585716067\" target=\"_blank\" rel=\"noopener\"></a>\n  </blockquote>\n</div>\n\n<ol start=\"8\">\n<li>Great thread from a master. Love how he says so much without saying anything. See the photos in the third tweet for a masterpiece (as he puts it, the 3rd and the 4th slide.).</li>\n</ol>\n<div class=\"tweet-container\" style=\"margin:0 auto 1rem;\">\n  <blockquote class=\"twitter-tweet\" data-width=\"350\">\n    <a href=\"https://twitter.com/dieworkwear/status/1955756224030630264\" target=\"_blank\" rel=\"noopener\"></a>\n  </blockquote>\n</div>\n\n    \n<div class=\"tweet-container\" style=\"margin:0 auto 1rem;\">\n  <blockquote class=\"twitter-tweet\" data-width=\"350\">\n    <a href=\"https://twitter.com/dieworkwear/status/1955756255668265094\" target=\"_blank\" rel=\"noopener\"></a>\n  </blockquote>\n</div>\n\n<ol start=\"9\">\n<li><p><a href=\"https://newsletter.humanprogress.org/p/the-infinite-well-how-innovation\" target=\"_blank\" rel=\"noopener\">The Infinite Well: How Innovation Keeps Water Flowing</a>: </p>\n<blockquote>\n<p>Solutions from experts follow a familiar pattern, claiming that the only way to avert a crisis is to adopt radical social and behavioral changes, driven by moral proselytizing, government intervention, or both, to save the water supply. Environmentalists urge people to replace old toilets with low-flow models, avoid running faucets while brushing their teeth or washing dishes, and switch to eating less water-intensive foods. Meanwhile, activists pressure elected officials to impose usage restrictions, ban certain crops in arid regions, and regulate everything from swimming pools to car washes.</p>\n\n\n\n<p>Fortunately the economics of water innovation reveals why the apparent scarcity tends to be self-correcting, without requiring us to adopt ascetic lifestyles or perform symbolic actions like picking up dropped ice cubes to water house plants or writing letters to elected officials. Rising prices, not moralizing pleas, lead people to conserve, look for substitutes, recycle resources, and innovate helping to meet demand through alternative means or improved efficiency.</p>\n</blockquote>\n<p> The same principles apply to many other things too. </p>\n</li>\n<li></li>\n</ol>\n<div class=\"tweet-container\" style=\"margin:0 auto 1rem;\">\n  <blockquote class=\"twitter-tweet\" data-width=\"350\">\n    <a href=\"https://twitter.com/therealcorpbro/status/1953558541929001060\" target=\"_blank\" rel=\"noopener\"></a>\n  </blockquote>\n</div>",
      "summary": "1. [Face it: you're a crazy person](https://www.experimental-history.com/p/face-it-youre-a-crazy-person): \n    > I meet a lot of people who don’t like...",
      "date_published": "2025-08-16T00:00:00.000Z",
      "tags": [
        "links"
      ],
      "authors": [
        {
          "name": "Apoorv Trivedi",
          "url": "https://www.approvedthoughts.com"
        }
      ]
    }
  ]
}