{"/about/":{"data":{"":"","#":"Welcome to Approved Thoughts First up, why “Approved Thoughts”? I have spent more than 20 years in East Asia and “Approv” is how my name is most commonly spelled and pronounced here.\nI remember working for FedEx in 2003. My job was to approve pricing for large contracts. Every so often I got an email from a salesperson in the Philippines or Thailand that just said “Approv, pls approve.” My frequent response? “Approved.”\nApproved Thoughts also has a vaguely sinister connotation that makes me feel cool. It’s a low bar, but let’s face it, as a middle-aged man starting yet another Substack, clearing a higher one may be beyond my abilities.\nWhat is Approved Thoughts going to be about? Let’s start by addressing the elephant (or the ant) in the room - this is a new year’s resolution so there isn’t some grand plan that I have in mind. This newsletter was inspired by this post by Simon Willison that I came across recently:\n…blogging doesn’t have to be about unique insights. The value is in writing frequently and having something to show for it over time—worthwhile even if you don’t attract much of an audience (or any audience at all).\nSo the plan, to the extent there is one, is to just write. Once a week, maybe some links I found interesting or some tip or trick I found useful or a short comment on what I am thinking about.\nGiven my reading habits and interests at the moment, I expect a lot of what I include will come either from Marginal Revolution or Don’t Worry About the Vase. These are both such high value sources that I think everyone should follow them anyway. So go ahead and do that first. Without further ado…"},"title":"About"},"/posts/a-few-thoughts-on-llms/":{"data":{"":"I need to sit down and combine some of these thoughts into a coherent piece but for now, I just want to dump it all here for reference later. I doubt any of these are original and I have certainly seen some elsewhere.\nMarket structure for LLM makers may end up being like the airline market. High fixed cost to set up, hard to create a product differentiation that users care about (other than price), lots of competitors entering, at least in part due to the “prestige” of owning one. Lots of utility for consumers but hardly any profit for producers.\nAn LLM with an infinite context window, one that can contain all my life, will be an entirely different product than an LLM with a limited context window. You can never have enough when it comes to context windows.\nNotwithstanding 1, “personality” makes a huge difference in the experience of working with an LLM and the ability to create the right one could determine whether a model can dominate a market or a niche. Claude Sonnet 3.5 absolutely had than special sauce in my experience. We need a lot more of it.\nThis.:\nI don’t see how we’re going to avoid a situation where the internet become lousy with AI-created, pseudo academic writing filled with made up facts and quotes, which will then get cemented into “knowledge” as those articles become the training fodder for future models.\nBut combine it with the fact that if we all start getting our answers from LLMs, the online content \u0026 ad based business model goes caput and then what is the incentive for people to put up good content on the web? None.\nBut anyone who has good proprietary, verified, high-quality data \u0026 content will potentially control the value for the customer even as base LLMs become a commodity. Therefore does more data and content start going behind the paywall? If it doesn’t it becomes training data and cannot be monetized."},"title":"A few thoughts on LLMs"},"/posts/links-01-mar-2025/":{"data":{"":" A.I. and Vibecoding Helped Me Create My Own Software: The limitation here is my imagination.\nHumanoid Robots are coming. Wild dogs will not stop me from paying good money for a bot that can iron and fold clothes.\nFirst world problem?: Nebraska Man Struggles to Change Daughter’s Name From ‘Unakite Thirteen Hotel’. For two years.\nMichelle Trachtenberg: I did not watch Buffy or any of her other work but it is always depressing to see so many child celebrities die early deaths. This job is hazardous. To be clear cause of death is not known and I do not want to speculate.\nWhat struck me was this bit in the report:\nIn a 2012 interview with Complex magazine, she recalled a scene in the 2006 film “Beautiful Ohio,” starring William Hurt and Rita Wilson, that featured her “naked tush.” It was, she said, “probably one of the most horrendous moments of my life.”\n“It would take an army — or Martin Scorsese — to ever get me naked again,” she added.\nAs a viewer, I almost never think about the person behind the character. Sure if a Christian Bale loses nearly 30kg for a role, its visible enough and stark enough that one is forced to think about the how of it. But for the most part, I watch the program and move on. Maybe if there is something really interesting or shocking, a comment to my SO.\nSo it is a jarring to see that the impact of a brief scene stuck with the actor for years after the fact.\nThese days there is enough nudity on screen that most of us are desensitized to seeing it and I hope the actors are too, to performing them. Even in 2006 or 2012, when maybe it was less common, I would not have imagined an actor, and especially an American1 actor, would be so traumatized by such a scene.\nMaybe it is because she grew up in a time when that was a much bigger deal that it was harder on her. Perhaps actors like her were the trailblazers and paid a price and it is easier for actors now.\nIt is, however, possible to imagine a possibility where being naked on screen is traumatizing, no matter how common and acceptable. According to Claude, the “being naked in public” dream genre is common across cultures and age groups and more common in adoloscents.\nIf that is the case I shudder to imagine the cost of all the content on Netflix and other services in a few years time.\nThe report also has a bit on another scene she was not happy about. And guess what? At the time (and thankfully no longer), the report carried a photo from that scene.\nThough, it turns out, America has a complex relationship with nudity and sexuality. Who’da thunk! ↩︎"},"title":"Links: Week of Mar 01 2025"},"/posts/links-06-apr-2025/":{"data":{"":" Myanmar Earthquake passing through Europe: I experienced the shaking in Bangkok. First, I thought I was getting dizzy before the realization struck. It was kind of disorienting walking down the stairs of the building, periodically feeling dizzy. It didn’t feel real, almost as if it was just a drill or a joke.\nAI vs. Human: Odysseus Translation: I, too, preferred the AI version. Even if you don’t agree with the ranking, it is clearly good enough.\nTough out there for kids: Hard to understand the rejection ratio. I was originally going to link to a thread by a university professor with experience in admissions, critiquing his personal essay but she has locked her account now, I assume after it went viral. If I recall correctly, she felt his essay did not show the right attitude for various reasons. Many on twitter (and I) disagreed but even if you agree with her take, the essay highlights a very impressive person (and seems factually accurate). So I struggle to understand the rejection ratio.\nIf he can fall for a phishing attack, so can you and they are only going to get more sophisticated. Be careful out there and step up your safety protocols.\nAI 2027: I have yet to fully read this but it is a lot more “optimistic” on AI progress than I am right now and at least somewhat scary."},"title":"Links: Week of 06 Apr 2025"},"/posts/links-08-mar-2025/":{"data":{"":" James Harrison: The Man Who Saved 2.4 Million Babies: Hall of Fame. Coincidentally, this week both Tyler Cowen and Karthik S shared memories of playing card games as kids. And then today my sister mentioned my younger newphew had started playing Dungeons and Dragons recently. We have played card games and board games with our boys, especially during COVID and it was fun. Clearly we should do more of this. Another entry to the hall of fame. A different hall, sure, but come one, clearly this guy is a legend. A different way of learning math? Via Zvi, who belongs in a third hall. Can’t fault him for lacking ambition but perhaps this is the rare tweet that should have been an article. A Cheeto Shaped Like the Pokemon Charizard Sells for Nearly $90,000. NYT Paywall but do you really need to read anything else? Honey on a razor blade: Something about the actual visualization struck a chord with me. "},"title":"Links: Week of Mar 08 2025"},"/posts/links-12-apr-2025/":{"data":{"":" Digital hygiene by Andrej Karpathy: I discovered this just a little late to include in the last weeks post, where it would have been the perfect companion piece along with this one on getting phished.\nI practice some of these recommendations already and wholeheartedly recommend the password manager, for example. I use Dashlane, which is about $60 a year if you want to sync across devices, but there are many free tools out there. Bitwarden offers all the essential features, including syncing across devices, for free and the paid versions are cheaper too.\nI plan to explore his solutions for credit cards (privacy.com) this weekend. Work-life separation is also great advice, which I did not follow in the past but am doing at my new(ish) job.\nFlight to unkown destinations. Would you take one? Doesn’t seem like a big deal to me. As a reply to the tweet says, unlikely they will put you in a war zone, so if it is in Schengen, how bad could it be? I am probably clueless…\nScandinavian Airlines are running “unknown” destination flights.\nYou buy a ticket and board the plane. Then you find out where you are going.\nWould you do it?\nKim Shin-jo, 82, Failed North Korean Assassin, Dies as Pastor in the South (NYT Paywall) : What a story and what a life! And this story is straight out of hollywood, but without the happy ending.\nGetting the Most from Deep Research Models:\nAfter a fair bit of experimentation, I’ve built a Claude project that handles all the repeatable high-effort prompt engineering (like source selection) for you. It asks for your preferences, clarifies what you need, and produces a well-structured prompt that you can then feed into any DR model.\nTwo high-value excerpts from John Authers Bloomberg newsletters:\nHere follows a crowd-sourced literary tip. I asked yesterday for recommendations on great detective franchises for easy reading in stressful times, and you delivered. I’ve had so many suggestions that this will need to come in installments.\nTo start, the name you’ve recommended most often, and with greatest enthusiasm, is Michael Connelly and his Harry Bosch series (the detective loves jazz and lives in the LA hills).\nOther entrants includes the Dave Robicheaux series by James Lee Burke (set in Louisiana and starting with The Neon Rain), Arnaldur Indridason’s “really good, bleak Icelandic stuff” (try Jar City first). Volker Kutscher’s Babylon Berlin series, set in Weimar Germany. Robert van Gulik’s Judge Dee stories (written some decades ago and set in Ancient China — try Willow Pattern). Also the Martin Beck books set in 1960-70s Sweden and written over 10 years by Maj Sjowall and Per Wahloo — a husband and wife team, and godparents of Scandinavian noir (Roseanna is recommended) and the Harry Hole books by Jo Nesbo, set in Norway.\nTo be clear, I didn’t mention Raymond Chandler’s Marlowe books because I’ve already read all of them. If you’ve never dipped into Chandler, you have a treat in store — perhaps start with The Big Sleep. And as more than one of you said Connelly was as good as Chandler, I definitely want to read one of his. I’ll have plenty more suggestions tomorrow. Please, if you have any more to recommend, let me know.\nHerewith another installment in our crowd-sourced tour of great detective fiction franchises. You might want to try: Abir Mukherjee’s Wyndham and Banerjee series is set in India under the British Raj; the Canadian writer Eric Wright’s John Salter series, set in Toronto; Philip Kerr’s Bernie Gunther series, set in Nazi Germany; the Whitstable Pearl mysteries by Julie Wassmer (who used to be a scriptwriter for Eastenders so there are plenty of cliffhangers); Andrea Camilleri’s Inspector Montalbano series, featuring Sicily and plenty of great food; and Death of a Red Heroine, the first of the Inspector Chen series by Qiu Xiaolong in contemporary Shanghai. This comes highly recommended by Andy Rothman of Sinology, long one of my favorite guides to all things China, and by remarkable coincidence I had picked up a copy of this book from a neighborhood bookshelf earlier this week. So that’s what I’ll read next. More detectives next week.\nDrew Breunig via Simon Willison:\nThe first generation of AI-powered products (often called “AI Wrapper” apps, because they “just” are wrapped around an LLM API) were quickly brought to market by small teams of engineers, picking off the low-hanging problems. But today, I’m seeing teams of domain experts wading into the field, hiring a programmer or two to handle the implementation, while the experts themselves provide the prompts, data labeling, and evaluations.\nFor these companies, the coding is commodified but the domain expertise is the differentiator.\nS Anand: A great website from a college senior. On campus he was know as Stud Anand."},"title":"Links: Week of 12 Apr 2025"},"/posts/links-15-mar-2025/":{"data":{"":" Australian man survives 100 days with artificial heart in world-first success via Nico McCarty:\nAn Australian man with heart failure has become the first person in the world to walk out of a hospital with a total artificial heart implant.\nThe Australian researchers and doctors behind the operation announced on Wednesday that the implant had been an “unmitigated clinical success” after the man lived with the device for more than 100 days before receiving a donor heart transplant in early March.\nThe BiVACOR total artificial heart, invented by Queensland-born Dr Daniel Timms, is the world’s first implantable rotary blood pump that can act as a complete replacement for a human heart, using magnetic levitation technology to replicate the natural blood flow of a healthy heart.\nInflation Expectations by Political Party Affiliation: Entry #3692 in “Politics makes you stupid”.\nBroccoli, the Man – and Vegetable – Behind the Bond Franchise: What a story.\nThe shift from a mindset of scarcity to one of abundance is overdue.(NYT Paywall) The article itself has a strong partisan tone. I hope the book is different.\nIn the time California has spent failing to complete its 500-mile high-speed rail system, China has built more than 23,000 miles of high-speed rail. China does not spend years debating with judges over whether it needs to move a storage facility. That power leads to abuse and imperiousness. It also leads to trains.\nI do not want America to become China. But I do want it to be able to build trains.\nSome Vegans Were Harmed in the Watching of This Movie (NYT Paywall): Even as a vegetarian, this seems over the top.\n“People might think a glass of milk is innocuous,” she said. “It’s not. It’s full of violence.”\nIn Search of a Boring Business (NYT Paywall):\nOn BizBuySell, the popular listings site where the Rizzos found the Smiths, “corporate refugees” ditching the 9-to-5 have surged to 42 percent of buyers, roughly double the 2021 figure. Meanwhile, nearly a quarter of American small businesses are owned by people 65 and older, making the Smiths part of a “silver tsunami” of sellers.\nCognitive security is now as important as basic literacy: Must read link of the week. Between this stuff and use of AI in scams, I am more than a little scared.\nIs this good or bad? Policy can be hard."},"title":"Links: Week of Mar 15 2025"},"/posts/links-22-mar-2025/":{"data":{"":" The Kids Are Not All Right via MR: Reminder that humans, often the smartest humans, can believe anything. Wonder how much of the coventional wisdom today falls in this category.\nTwo weeks after his birth, Jeffrey’s health took a turn for the worse: He developed a heart defect common in premature infants – patent ductus arteriosus, or PDA. Jeffrey was scheduled for open-heart surgery and transferred to the nearest children’s hospital.\nIn those days, surgery for PDA was invasive. Holes were cut on either side of Jeffrey’s tiny neck and chest to insert a catheter into his jugular vein. His little body was opened from breastbone to backbone, his flesh lifted aside, ribs pried apart, and a blood vessel near his heart tied off, and then all the tissues were stitched back together.\nBaby Jeffrey felt everything – every incision, every internal repair, every stitch. The medical team had not given their fragile patient any drugs, any comfort, anything to protect him from the excruciating pain of open-heart surgery – just a paralyzing agent to keep him still during the procedure.\nFive weeks later, Jeffrey passed away.\nIn the days before her child’s death, Jill Lawson learned a shocking fact: Anesthetizing babies for surgery was not common practice. After Jeffrey died, Lawson called his doctor for reassurance. Surely, she thought, her child had been given something for the pain.\n“The anesthesiologist informed me that she had not used any anesthesia or analgesia on Jeffrey,” Lawson wrote in an account of her son’s experience. The doctor told the grieving mother it hadn’t even occurred to her to do so because it had never been demonstrated that babies can feel pain.\n@peelraja via MR:\nThe paradox of India:\nPunjab is over 60% vegetarian, but Tandoori chicken and butter chicken are its most popular dishes outside the state.\nTamil Nadu is less than 1% vegetarian, but its “pure veg” idly, dosa, sambhar, pongal, etc are its most popular dishes outside the state.\nThe Seneca via Daring Fireball:\nThe Seneca is my middle finger to the aesthetic homogeneity and economic over-optimization of 21st century life.\nA keyboard for the low, low price of $3,600. Yes, a computer keyboard. Yes, US$. Although to be fair, it is not $3,600. Its “from $3,600”.\nMy Thoughts on the Future of “AI” via Simon Willison:\nI have very wide error bars on the potential future of large language models, and I think you should too.\nSpecifically, I wouldn’t be surprised if, in three to five years, language models are capable of performing most (all?) cognitive economically-useful tasks beyond the level of human experts.\nAnd I also wouldn’t be surprised if, in five years, the best models we have are better than the ones we have today, but only in “normal” ways where costs continue to decrease considerably and capabilities continue to get better but there’s no fundamental paradigm shift that upends the world order.\nThe Anatomy of Marital Happiness via MR:\nSince 1972, the General Social Survey has periodically asked whether people are happy with Yes, Maybe or No type answers. Here I use a net “happiness” measure, which is percentage Yes less percentage No with Maybe treated as zero.\nAverage happiness is around +20 on this scale for all respondents from 1972 to the last pre-pandemic survey (2018). However, there is a wide gap of around 30 points between married and unmarried respondents.\nThis “marital premium” is this paper’s subject. I describe how this premium varies across and within population groups. These include standard socio demographics (age, sex, race education, income) and more. I find little variety and thereby surface a notable regularity in US socio demography: there is a substantial marital premium for every group and subgroup I analyze, and this premium is usually close to the overall 30-point average.\nThis holds not just for standard characteristics but also for those directly related to marriage like children and sex (and sex preference). I also find a “cohabitation premium”, but it is much smaller (10 points) than the marital premium. The analysis is mainly visual, and there is inevitably some interesting variety across seventeen figures, such as a 5-point increase in recent years."},"title":"Links: Week of 22 Mar 2025"},"/posts/links-23-feb-2025/":{"data":{"":" 50 years of Travel Tips: Some great tips.\nFor the best travel experiences you need either a lot of money, or a lot of time. Of the two modes, it is far better to have more time than money. Although it tries, money cannot buy what time delivers. You have enough time to attend the rare festival, to learn some new words, to understand what the real prices are, to wait out the weather, or to get to that place that takes a week in a jeep. Time is the one resource you can give yourself, so take advantage of this if you are young without money.\n100% HIV Prevention:\n…we now have evidence that in real-world use it can do something that has never been seen before: twice-yearly injections in thousands of female trial volunteers in high-risk areas (South Africa and Uganda) showed a one hundred per cent prevention rate of HIV infection.\nStable Systems (X):\nI don’t think a lot of people appreciate how much of their overall lifestyle and relative certainty is backstopped by a steady, boring stability of systems they don’t understand or even realize exist.\nAI or No I (X):\nMe using LLMs for fun little personal projects: wow this thing is such a genius why do we even need humans anymore.\nMe trying to deploy LLMs in messy real-world environments: why is this thing so unbelievably stupid and dumb.\nThis fits with my experience. But also for doing “real” work, prompt engineering matters. Giving the right instructions in the right order does make a difference.\nSee more scepticism in this thread. Along with some of the comments I am hearing Satya Nadella made in his podcast with Dwarkesh, I wonder if we are seeing a vibe shift on AI?\nMy LLM codegen workflow atm(via):\nI have been building so many small products using LLMs. It has been fun, and useful. However, there are pitfalls that can waste so much time. A while back a friend asked me how I was using LLMs to write software. I thought “oh boy. how much time do you have!” and thus this post.\nAgain, for real work, prompt engineering matters.\nConsensus projections on AI (X):\nI think Grok 3 came in right at expectations, so I don’t think there is much to update in terms of consensus projections on AI: still accelerating development, speed is a moat, compute still matters, no obvious secret sauce to making a frontier model if you have talent \u0026 chips.\nThree Observations: Obligatory link to every Sam Altman post.\nAnyone in 2035 should be able to marshall the intellectual capacity equivalent to everyone in 2025; everyone should have access to unlimited genius to direct however they can imagine. There is a great deal of talent right now without the resources to fully express itself, and if we change that, the resulting creative output of the world will lead to tremendous benefits for us all."},"title":"Links: Week of Feb 23 2025"},"/posts/links-30-mar-2025/":{"data":{"":" Unintentionally hilarious:\nThe Danish Defense Ministry also plans to fund two more dogsled teams to protect the 375,000-square-mile Northeast Greenland National Park, the largest in the world. These would be the hardcore Sirius patrols, viewed by the Danes as the Navy SEALs of the Arctic, which began operations during World War II.\nTwo. Not one.\nHow to vibe code?: A fairly decent app and when you see his conversations with ChatGPT, its mostly just plain english. Does a programming background help. Sure, but you can go quite far without any. Here are the actual conversations:\na. Starting the app\nb. Enhancements\nc. More enhancements\nd. Deploy to iPhone\ne. The actual App\nWhy we ended up homeschooling:\nTL;DR: homeschooling makes it much easier to individualize education, which makes it more efficient and meaningful.\nTokyo vs. Rest of Japan:\nThis is called the sponge city effect in my little world of demographics. In a declining region we often see the biggest city soaking up population since jobs and health services etc cluster in a single area rather than spreading out. Japan has been shrinking for three decades while Tokyo happily grows.\nHow Much Would You Need to be Paid to Live on a Deserted Island for 1.5 Years and Do Nothing but Kill Seals?: What it says on the label.\nBest take:\npeople are rightfully upset about this atlantic story because it gets at a truly alarming issue: being added to large, ongoing group texts without consent\n😂\nTrue that!:\nYour brain will invent fake problems for you if you don’t go out and find real ones\nI don’t know if this is the right path, but its the right destination "},"title":"Links: Week of 30 Mar 2025"},"/posts/links-9-feb-2025/":{"data":{"":" Translating with LLMs: A fantastic guide from a professional translator on how he is using LLMs to do his job better.\nFor my day to day queries, I simply ask Claude, like I would ask a colleague or a friend and it just works. But for professional work, correctly prompting the LLMs improves the quality of output significantly. I hope to find (and create) more such examples.\nWisdom: Wisdom II: A lot of AI cheerleading takes this form. Yes, you can just do things. I have also thought and posted along those lines. But as Gergely points out, the hard thing in building a payment system is not the code - its fraud, AML, KYC, tax, reporting, reconcilliation…\nThat is true for most other hard things too. The hard thing in pharma is not finding the compound but getting the trials and approvals done. The hard thing in politics in not the manifesto but the consensus.\nTarriffs and Modern Supply Chains: Tarriffs are more disruptive than I thought.\nHow My Dad Reconciled His God and His Gay Son: Beautiful.\nThis is me with my dad, Bill White. For decades, he has been an evangelical pastor. Before I was born, he wrote a letter to my future wife. He didn’t know what we both do now: that I’m gay. When I came out nearly 16 years later, it shook his faith and fractured his church. But it never separated us. I wanted to understand how. So I read his journals.\nStrongly endorse:\nOne of the reasons making things is satisfying is that it’s a concrete demonstration of the notion that you can have some amount of control over your environment and circumstances. Passive media consumption is the opposite of that.\nShould you value the life of your brother more than that of a stranger?:\nBut again, this is a distraction from any real issue! Oh, you should value the life of your brother more than a stranger? You don’t say? I’m hearing this for the first time! Now let’s kill five million foreign children to fund one sixth of a broadband boondoggle.\nI am happy to “concede” that if you face a choice between saving a stranger and saving your brother, save your brother! Or your cousin, or your great-uncle, or your seven-times-great-grand-nephew-twice-removed. I’ll “concede” all of this, immediately, because it’s all fake; none of your relatives were ever in any danger. The only point of this whole style of philosophical discussion is so that you can sound wise as you say “Ah, but is not saving your brother more important than saving a complete stranger?” then sentence five million strangers to death for basically no benefit while your brother continues to be a successful real estate agent in Des Moines.\nWhen will I be able to write so well?"},"title":"Links: Week of Feb 09 2025"},"/posts/update-12-apr-2025/":{"data":{"":"After a few more iterations with Claude, the website is looking a lot better but it isn’t working that much better. The Archives link on top right throws up a poorly formatted page.1 The huge, black “Approved Thoughts” at the top of the page and the smaller blue version in the header are redundant.2 There are many other issues to be fixed.\nI also managed to get the CMS set up so that I could login and see all the posts in the CMS.3 It is useless though because the posts I create there do not show up on the site. So there is some solid debugging needed before I can get more ambitious here. Still I am quite chuffed that I have this set up and working.\nBetween the markets and a potential relocation, I have not devoted any time to this website. Hopefully that changes soon.\nI have also decided another project I want to try my hand at. More as I get started.\nThought for the day: If you ask “do I feel like doing this now”, you won’t do it. Certainly not regularly. First, figure out how to stop the question.\nThis is now fixed. ↩︎\nThis is also now fixed, although I am not sure if it is an improvement. ↩︎\nThis was almost fixed but broke again and I have given up for now. When on the road, I can add posts directly via GitHub so, I am good for now. ↩︎"},"title":"Update: 12 Apr 2025"}}