[
  {
    "id": "links-02-aug-2025",
    "title": "Links: Week of 02 Aug 2025",
    "url": "posts/2025/links-02-aug-2025.html",
    "date": "2025-08-02T00:00:00.000Z",
    "dateFormatted": "August 2, 2025",
    "excerpt": "1. [Philosopher–Builder Summer Reads](https://blog.cosmos-institute.org/p/philosopherbuilder-summer-reads-2025https://blog.cosmos-institute.org/p/phil...",
    "type": "post",
    "tags": [
      "links"
    ],
    "keywords": [
      "quot",
      "what",
      "plan",
      "tool",
      "like",
      "doge",
      "good",
      "much",
      "ocean",
      "federal",
      "000",
      "powerpoint",
      "waves",
      "trying",
      "back",
      "week",
      "can",
      "regulations",
      "roughly",
      "which",
      "plans",
      "worthy",
      "right",
      "within",
      "detail",
      "who",
      "doing",
      "means",
      "something",
      "kinda",
      "nice",
      "thought",
      "color",
      "started",
      "looked",
      "saw",
      "fucking",
      "amazing",
      "felt",
      "face",
      "found",
      "too",
      "feel",
      "more",
      "than",
      "life",
      "look",
      "now",
      "wasn",
      "really"
    ],
    "searchableText": "philosopher builder summer reads these aren 39 t generic quot tech books. quot they 39 re works that can shape how serious builders think about what they 39 re creating and why. and the original essay. doge builds ai tool to cut 50 percent of federal regulations the tool, called the doge ai deregulation decision tool, is supposed to analyze roughly 200,000 federal regulations to determine which can be eliminated because they are no longer required by law, according to a powerpoint presentation obtained by the post that is dated july 1 and outlines doge s plans. roughly 100,000 of those rules would be deemed worthy of trimming, the powerpoint estimates mostly through the automated tool with some staff feedback. the powerpoint also suggests the ai tool will save the united states trillions of dollars by reducing compliance requirements, slashing the federal budget and unlocking unspecified external investment. a worthy goal for doge and possibly the right use of ai. if done well. america 39 s ai action plan is pretty good otherwise, while this is far from a perfect plan or the plan i would choose, on the substance it is a good plan, a positive plan, with many unexpectedly good plans within it. there is a lot of attention to detail in ways those i ve asked say reflect people who actually know what they are doing, which was by no means something to be taken for granted. it is hard to imagine that a much better plan could have been approved given who was doing the approving. two long amp good pieces on india this week though i have yet to fully read both. jhanas and jhourney so i went down to the beach. quot kinda nice quot , i thought. the sky had a particularly vibrant blue color, the waves had 39 the right size 39 , their roar was pleasant. i started to walk around trying to continue meditating. i focused my awareness on an arising sensation of open heartedness and then i noticed my eyes tearing up quot huh? i thought quot . i looked again at the ocean and then i saw it. it was fucking amazing. so much color and detail waves within waves, the fractal structure of the foamy crests as they disintegrate back into the ocean. the feeling of the sun on my skin. i felt overwhelmed. as tears ran down my face and lowkey insane grin settled on my face i found myself mumbling quot it 39 s... always been like this!!!! quot quot what the fuck??! quot followed by quot this is too much!! too much!!! quot . the experience seemed to be demanding from me to feel more joy and awe than i was born to feel or something like that. in that precise moment i felt what quot painfully beautiful quot means for the first time in my life. i had to look away. i calmed a bit. i walked a few steps and looked back. the exact same thing happened. quot it 39 s reproducible, hihihihi quot , and i started laughing. then i found a log to sit on, calm down, and look back at the ocean. now it wasn 39 t overwhelming, but quot kinda nice quot was now quot fucking amazing quot . to do list. yes, adam sandler really is a pickup basketball god nyt paywall jackson was struck by the man s attire extra-baggy shorts and an extra-baggy yellow t-shirt. i m trying to figure out does he buy clothes? did he buy them and then just stop buying them? his clothes really might have been from 2008. it soon became apparent, however, that the guy could play. he was a true court general. he impressed jackson with his basketball iq. life in deep when her three-person submersible descended more than 30,000 feet into one of the pacific ocean s deepest trenches, mengran du wasn t sure what they would find. what she saw, she recalled, was unbelievable dense clusters of tubeworms with tentacles tinged bloodred, jutting up like skyscrapers. iridescent snails scaling the worms, like window washers. bristly, white creatures wriggling between them like rush-hour commuters trying to get home for dinner. 10.",
    "preview": "philosopher builder summer reads these aren 39 t generic quot tech books. quot they 39 re works that can shape how serious builders think about what they 39 re creating and why. and the original essay...",
    "content": "\nPhilosopher–Builder Summer Reads: \n\nThese aren&#39;t generic &quot;tech books.&quot; They&#39;re works that can shape how serious builders think about what they&#39;re creating and why.\n\n And the original essay.\n\nDOGE builds AI tool to cut 50 percent of federal regulations: \n\nThe tool, called the “DOGE AI Deregulation Decision Tool,” is supposed to analyze roughly 200,000 federal regulations to determine which can be eliminated because they are no longer required by law, according to a PowerPoi"
  },
  {
    "id": "links-26-jul-2025",
    "title": "Links: Week of 26 Jul 2025",
    "url": "posts/2025/links-26-jul-2025.html",
    "date": "2025-07-26T00:00:00.000Z",
    "dateFormatted": "July 26, 2025",
    "excerpt": "Some readers have commented that I am obsessed with AI. This is not correct. I wish I was. But is there anything more interesting happening in the wor...",
    "type": "post",
    "tags": [
      "links"
    ],
    "keywords": [
      "quot",
      "there",
      "brain",
      "2025",
      "don",
      "art",
      "can",
      "what",
      "volume",
      "cocktails",
      "2021",
      "more",
      "world",
      "now",
      "musician",
      "who",
      "composing",
      "new",
      "music",
      "project",
      "behind",
      "american",
      "lucier",
      "electrical",
      "grown",
      "life",
      "around",
      "listen",
      "suppliers",
      "difference",
      "charge",
      "yes",
      "models",
      "costs",
      "won",
      "economy",
      "look",
      "like",
      "hotel",
      "all",
      "every",
      "iba",
      "list",
      "official",
      "102",
      "200",
      "links",
      "week",
      "jul",
      "some"
    ],
    "searchableText": "some readers have commented that i am obsessed with ai. this is not correct. i wish i was. but is there anything more interesting happening in the world right now? i don 39 t think so. musician who died in 2021 resurrected as clump of brain matter, now composing new music art can outlast the artist but what about their artistic impulses? a new art installation project in australia, titled quot revivification, quot raises this question with a very literal interpretation of quot impulse quot using his dna, the team behind the project have performed a quasi-resurrection of the late experimental american composer alvin lucier, creating a sort of brain that continuously composes music on the fly with its errant electrical signals. at the center of the piece is an quot in-vitro brain, quot grown from blood that lucier, who passed away in 2021, donated in the final years of his life. housed in a plinth, it 39 s grown on top of an electrode mesh that connects it to twenty large brass plates placed around the room. visitors can listen as the brain fires off electrical pulses that trigger a transducer and a mallet behind each plate, striking them to produce sound. is this art? is this science? is this composing? gross ery confusion teachout s idea that suppliers make up the difference by charging smaller stores more is also economically incoherent. profit-maximizing firms already charge what the market will bear. if costco s volume justifies a discount, that doesn t mean suppliers can or should charge higher prices to other buyers. yes, there are models where costs change with volume but costs could go down with volume and, in any case, those models don t rely on the folk theory of making up the difference. ais and spontaneous order this isn t to say ai won t help improve economic policy it might, if we listen. but the future economy won t look like a centrally planned machine. it will look like an economy of von neumanns autonomous agents buying, selling, and strategizing in complex interaction. i analysed 25,000 hotel names and found four surprising truths and yes, the cat s out of the bag there are over 200 hotels bristol worldwide, and the reason goes all the way back to an 18th-century english aristocrat whose hotel preferences turned into a naming tradition. i drank every cocktail the international bartenders association, or iba, maintains a list of official cocktails, ones they deem to be the most requested recipes at bars all around the world. it s the closest thing the bartending industry has to a canonical list of cocktails, akin to the american kennel club s registry of dog breeds or a jazz musician s real book of standards. as of 2025, there are 102 iba official cocktails, and as of july 12, 2025, i ve had every one of them. legend. how the system works an essay series on the hidden mechanisms that support modern life and what happens if we don t maintain them this should be amazing. so far, agriculture, water and electricity.",
    "preview": "some readers have commented that i am obsessed with ai. this is not correct. i wish i was. but is there anything more interesting happening in the world right now? i don 39 t think so. musician who di...",
    "content": "Some readers have commented that I am obsessed with AI. This is not correct. I wish I was. But is there anything more interesting happening in the world right now? I don&#39;t think so.\n\nMusician Who Died in 2021 Resurrected as Clump of Brain Matter, Now Composing New Music:\n\nArt can outlast the artist — but what about their artistic impulses?\n\n\nA new art installation project in Australia, titled &quot;Revivification,&quot; raises this question with a very literal interpretation of &quot;impulse"
  },
  {
    "id": "links-21-jul-2025",
    "title": "Links: Week of 19 Jul 2025",
    "url": "posts/2025/links-21-jul-2025.html",
    "date": "2025-07-21T00:00:00.000Z",
    "dateFormatted": "July 21, 2025",
    "excerpt": "1. [The Diaspora Paradox](https://substack.com/inbox/post/168173740) Second in a series from [Samir Varma](https://substack.com/@samirvarma)\n    > But...",
    "type": "post",
    "tags": [
      "links"
    ],
    "keywords": [
      "kids",
      "why",
      "india",
      "sputnik",
      "who",
      "become",
      "new",
      "marriage",
      "born",
      "get",
      "three",
      "what",
      "openai",
      "french",
      "paradox",
      "second",
      "series",
      "more",
      "first",
      "scientists",
      "called",
      "science",
      "nature",
      "modern",
      "families",
      "organizing",
      "gatherings",
      "can",
      "know",
      "each",
      "other",
      "not",
      "babies",
      "using",
      "people",
      "egg",
      "moment",
      "response",
      "increased",
      "funding",
      "math",
      "foreign",
      "like",
      "deepseek",
      "reflections",
      "there",
      "lot",
      "imo",
      "fry",
      "foods"
    ],
    "searchableText": "the diaspora paradox second in a series from samir varma but here 39 s the paradox that has haunted me for decades why do so many indians who escape india 39 s constraints become more indian abroad? why does the uncle who couldn 39 t be bothered to visit temples in mumbai suddenly become a founding member of the hindu temple in new jersey? why does the software engineer who rebelled against arranged marriage in bangalore now insist their american-born daughter marry within the community? the first in 30 years scientists discover new class of antibiotics led by scientist gerry wright, the team has discovered a powerful new molecule called lariocidin. this promising candidate shows the ability to fight some of the toughest, most drug-resistant bacteria known to science. their groundbreaking findings were published in the journal nature. why we re surrounding our kids with ai we also don t plan on perpetuating modern western parents egregiously hands-off nature with regard to their kids dating and marriage prospects. we already have a going list of agentic, thoughtful, high-achieving families whose kids are close to our kids in age as our kids get older, we ll start organizing gatherings for families in this network where our kids can hang out and get to know each other trips, summer camps, discord servers, study groups, etc. . as our kids reach their late teens and early 20s, we ll begin organizing modern versions of the london season a series of events and gatherings at which our single kids ready for marriage can meet, mix, and get to know each other. did not see this coming. babies made using three people 39 s dna are born free of hereditary disease eight babies have been born in the uk using genetic material from three people to prevent devastating and often fatal conditions, doctors say. the method, pioneered by uk scientists, combines the egg and sperm from a mum and dad with a second egg from a donor woman. the sputnik vs. deep seek moment the answers i pointed out that the us response to sputnik was fierce competition. following sputnik, we increased funding for education, especially math, science and foreign languages, organizations like arpa were spun up, federal funding for r amp d was increased, immigration rules were loosened, foreign talent was attracted and tariff barriers continued to fall. in contrast, the response to what i called the deepseek moment has been nearly the opposite. why did sputnik spark investment while deepseek sparks retrenchment? i examine four explanations from the comments and argue that the rise of zero-sum thinking best fits the data. reflections on openai i left openai three weeks ago. i had joined the company back in may 2024. i wanted to share my reflections because there 39 s a lot of smoke and noise around what openai is doing, but not a lot of first-hand accounts of what the culture of working there actually feels like. chatgpt agent and gold-medal level performance in international math olympiad imo . more on the imo . psychological techniques to persuade ai . spud-tacular how india became a french fry superpower gujarat has become india 39 s capital of french fry production, home to huge factories churning out chips, including facilities belonging to canadian giant mccain foods and india 39 s biggest maker of french fries, hyfun foods. bill ackman changed tennis forever.",
    "preview": "the diaspora paradox second in a series from samir varma but here 39 s the paradox that has haunted me for decades why do so many indians who escape india 39 s constraints become more indian abroad? w...",
    "content": "\nThe Diaspora Paradox Second in a series from Samir Varma\n\nBut here&#39;s the paradox that has haunted me for decades: Why do so many Indians who escape India&#39;s constraints become more Indian abroad? Why does the uncle who couldn&#39;t be bothered to visit temples in Mumbai suddenly become a founding member of the Hindu temple in New Jersey? Why does the software engineer who rebelled against arranged marriage in Bangalore now insist their American-born daughter marry within the community?\n\n"
  },
  {
    "id": "links-12-jul-2025",
    "title": "Links: Week of 12 Jul 2025",
    "url": "posts/2025/links-12-jul-2025.html",
    "date": "2025-07-12T00:00:00.000Z",
    "dateFormatted": "July 12, 2025",
    "excerpt": "1. [Terrified Girls, Helicopters and a Harrowing Scene: A Rescuer’s Account at Camp Mystic (NYT)](https://www.nytimes.com/2025/07/06/us/texas-floods-r...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "scene",
      "girls",
      "camp",
      "ruskan",
      "more",
      "between",
      "days",
      "summer",
      "temperature",
      "165",
      "2000",
      "2020",
      "2025",
      "links",
      "week",
      "jul",
      "terrified",
      "helicopters",
      "harrowing",
      "rescuer",
      "account",
      "mystic",
      "nyt",
      "scott",
      "coast",
      "guard",
      "swimmer",
      "credited",
      "saving",
      "people",
      "all",
      "deadly",
      "floods",
      "central",
      "texas",
      "realized",
      "staying",
      "free",
      "two",
      "extra",
      "spots",
      "helicopter",
      "evacuees",
      "said",
      "told",
      "unit",
      "love",
      "stay",
      "lot",
      "good"
    ],
    "searchableText": "terrified girls, helicopters and a harrowing scene a rescuer s account at camp mystic nyt scott ruskan, a coast guard swimmer, is credited with saving 165 people at the all-girls camp from deadly floods in central texas. mr. ruskan realized that staying on scene would free up two extra spots on his helicopter for the evacuees, he said, so he told his unit, i d love to stay, i could do a lot more good on the ground. he became the main person on scene to both triage and provide emotional support to the survivors. hero. death of partying in the usa the forests are coming back 36 countries, including india and china, gained more tress than they lost, between 2000-2020. levelsio speaks to john collison for a few days this summer, your days will be just a smidge shorter wapo during the summer, the northern hemisphere is tilted toward the sun, which minimizes the difference in temperature between the equator and earth s poles. this smaller temperature variation slows down the jet stream a narrow band of strong winds around 30,000 feet above us and moves it northward.",
    "preview": "terrified girls, helicopters and a harrowing scene a rescuer s account at camp mystic nyt scott ruskan, a coast guard swimmer, is credited with saving 165 people at the all-girls camp from deadly floo...",
    "content": "\nTerrified Girls, Helicopters and a Harrowing Scene: A Rescuer’s Account at Camp Mystic (NYT):\n\nScott Ruskan, a Coast Guard swimmer, is credited with saving 165 people at the all-girls’ camp from deadly floods in Central Texas.\n\n\nMr. Ruskan realized that staying on scene would free up two extra spots on his helicopter for the evacuees, he said, so he told his unit, “I’d love to stay, I could do a lot more good on the ground.”\n\n\nHe became the main person on scene to both triage and provide emotio"
  },
  {
    "id": "links-05-jul-2025",
    "title": "Links: Week of 05 Jul 2025",
    "url": "posts/2025/links-05-jul-2025.html",
    "date": "2025-07-05T00:00:00.000Z",
    "dateFormatted": "July 5, 2025",
    "excerpt": "1. [John Oliver on AI Slop](https://youtu.be/TWpg1RmzAbc?si=lXPyhNZJoJrS9gDC): \n    ![embed](https://youtu.be/TWpg1RmzAbc?si=lXPyhNZJoJrS9gDC)\n    Joh...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "only",
      "more",
      "cps",
      "scale",
      "investigations",
      "growth",
      "interventions",
      "than",
      "medical",
      "microsoft",
      "not",
      "also",
      "john",
      "oliver",
      "people",
      "all",
      "maltreatment",
      "reports",
      "number",
      "probably",
      "cases",
      "involve",
      "neglect",
      "false",
      "both",
      "can",
      "gdp",
      "real",
      "diagnoses",
      "new",
      "medicine",
      "doctors",
      "doctor",
      "need",
      "diagnose",
      "when",
      "300",
      "400",
      "2025",
      "links",
      "week",
      "jul",
      "slop",
      "always",
      "funny",
      "often",
      "insightful",
      "defeating",
      "virus",
      "killed"
    ],
    "searchableText": "john oliver on ai slop john oliver is always funny and often insightful. defeating a virus that killed half a billion people - the plea . timely and important. trigger warning images of diseased people. operation midnight hammer what a story. helicopter money. literally. talk about going out in style. does cps investigate one third of all children in the us? yes. but... the scale of cps investigations in the us is staggering. like all things, this trend began in the late 60s and early 70s as mandatory reporter laws expanded and caused massive growth in child maltreatment reports. since the 90s, the number of reports has stayed pretty stable and the number of substantiated investigations and interventions has been falling. the cps could probably scale back it s interventions for cases of maltreatment that only involve neglect, especially those that only involve lack of supervision rather than physical neglect. other tradeoffs between false positive and false negative investigations and interventions are more difficult to have a strong opinion on given the terrible outcomes on both sides of the trolley track. there are probably some available pareto improving moves. the most straightforward in my view would be increasing staffing and state capacity in family courts so that cases can be reviewed more accurately and without requiring months or years of effort and tens of thousands of dollars on the part of the parents. tech c.e.o. pays 400,000 to conduct the toronto symphony nyt after the performance, cheung and the orchestra received a standing ovation. he said he was grateful for the opportunity. will ai drive 20 annual gdp growth? steam, electricity, computers delivered enormous benefits while their economic importance shrank through success. ai will transform society profoundly. but 20 gdp growth? history says no. medical superintelligence from microsoft? microsoft 39 s llm is not only designed for multiple-choice questions, but also for real medical diagnoses in realistic scenarios and outperforms even top models such as o3. in a large-scale study with over 300 case studies from the new england journal of medicine, the system achieved a diagnostic accuracy of over 80 . this is not only four times higher than the participating doctors, but also marks a qualitative leap the ai was not only more accurate, but also made more economical decisions with around 20 lower costs because it avoided unnecessary tests. a doctor responds microsoft claims their new ai framework diagnoses 4x better than doctors. i 39 m a medical doctor and i actually read the paper. here 39 s my perspective on why this is both impressive and misleading ... ... final thought we don 39 t need ai that can diagnose every rare disease. we need ai that knows when to diagnose and when to reassure. that 39 s the real art of medicine. gymnastics bot using lego spike prime . my weekend project.",
    "preview": "john oliver on ai slop john oliver is always funny and often insightful. defeating a virus that killed half a billion people - the plea . timely and important. trigger warning images of diseased peopl...",
    "content": "\nJohn Oliver on AI Slop:\n\n\n  \n  \n\n    John Oliver is always funny and often insightful. \n\n\nDefeating a Virus That Killed Half a Billion People - The Plea. Timely and important. Trigger warning: Images of diseased people. \n\nOperation Midnight Hammer: What a story. \n\nHelicopter Money. Literally. Talk about going out in style. \n\nDoes CPS Investigate One Third of All Children in the US? Yes. But...\n\nThe scale of CPS investigations in the US is staggering. Like all things, this trend began in the lat"
  },
  {
    "id": "links-28-jun-2025",
    "title": "Links: Week of 28 Jun 2025",
    "url": "posts/2025/links-28-jun-2025.html",
    "date": "2025-06-28T00:00:00.000Z",
    "dateFormatted": "June 28, 2025",
    "excerpt": "A jumbo edition this week after a two-week break that was really not necessary....",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "used",
      "all",
      "oil",
      "nyt",
      "how",
      "what",
      "some",
      "more",
      "than",
      "three",
      "now",
      "best",
      "quot",
      "years",
      "week",
      "two",
      "really",
      "not",
      "mathematical",
      "most",
      "far",
      "who",
      "made",
      "can",
      "just",
      "cooking",
      "when",
      "help",
      "getting",
      "guide",
      "meeting",
      "researchers",
      "may",
      "world",
      "traveled",
      "coming",
      "group",
      "problems",
      "questions",
      "hajj",
      "horseback",
      "people",
      "year",
      "way",
      "festivals",
      "surprised",
      "get",
      "family",
      "any",
      "surprise"
    ],
    "searchableText": "a jumbo edition this week after a two-week break that was really not necessary. at secret math meeting, researchers struggle to outsmart ai on a weekend in mid-may, a clandestine mathematical conclave convened. thirty of the world s most renowned mathematicians traveled to berkeley, calif., with some coming from as far away as the u.k. the group s members faced off in a showdown with a reasoning chatbot that was tasked with solving problems they had devised to test its mathematical mettle. after throwing professor-level questions at the bot for two days, the researchers were stunned to discover it was capable of answering some of the world s hardest solvable problems. i have colleagues who literally said these models are approaching mathematical genius, says ken ono, a mathematician at the university of virginia and a leader and judge at the meeting. hajj on horseback nyt more than 1.5 million people traveled to saudi arabia this year for the hajj. only three of them rode on horseback all the way from spain, recreating the pilgrimage of andalusian muslims centuries ago and sharing their travels in the most modern way with big followings on social media. festivo, all festivals, everywhere in asia, for now a calendar of all festivals. did she or didn t she? she did, and she ll tell you exactly how. nyt i am surprised it took so long to get here and not at all surprised who made it happen. smartest family? new york city s best chefs pick their favorite restaurants nyt is it any surprise he won? the pope as a bishop in peru, robert prevost was often on the lookout for used cars that he could buy cheap and fix up himself for use in parishes around his diocese. with cars that were really broken down, he 39 d watch youtube videos to learn how to fix them. i used to be a high-performing robot and maybe you re not actually trying . quot agency quot is having a moment online as seen in all the quot you can just do things quot memes. interesting. llms in kitchen? i made tofu with peanut sauce today based on a receipe created by claude. honestly, the proportions were off but it wasn 39 t half bad. are llms 10x-ing anyone else in the kitchen? i am so much more confident cooking when i can ask infinite dumb questions and brainstorm ideas, backup plans, substitutes, etc. in the last couple weeks i ve made jerk chicken with coconut rice and mango salsa, chipotle turkey tacos, honey-lime sriracha chicken amp sesame snap peas, skillet-blistered tomato and ravioli, and a fancy dessert. some of these things were just me looking in the fridge and saying uhh this is what i have, help me turn it into something good and so far they ve all been great. i m the stereotypical guy that knows how to make 3 variations on a protein bowl and maybe 2 nicer dishes for impressing girls when i was single and that s about it. it s fun feeling my agency expand and confidence quickly increase in this very practical domain. ai is great. andrej karpathy 39 s keynote at yc . self recommending as some say. kitty olympics ai video is getting better. texan guy recites his electric bill like he s a character in a william faulkner novel. hilarious. ai is transforming indian call centers. for three years, kartikeya kumar hesitated before picking up the phone, anticipating another difficult conversation with another frustrated customer. the call center agent, now 29, had tried everything to eliminate what a colleague called the indian-ism in his accent. he mimicked the dialogue from marvel movies and belted out songs by metallica and pink floyd. relief finally arrived in the form of artificial intelligence. using ai right now a quick guide by ethan mollick every few months i put together a guide on which ai system to use. since i last wrote my guide, however, there has been a subtle but important shift in how the major ai products work. increasingly, it isn 39 t about the best model, it is about the best overall system for most people. the good news is that picking an ai is easier than ever and you have three excellent choices. the challenge is that these systems are getting really complex to understand. i am going to try and help a bit with both. how cultures heal every digital platform is flooding the market with short videos, but the audience is now spending more time with longform video and by a huge margin. flying on frying oil the noodle hawkers in kuala lumpur are getting a nice little bump in profit but who is going stall to stall to check that the oil is in fact used? and what counts as used? one fry or two? clever entrepreneurs have cut out the middleman. virgin palm oil can be substituted for used cooking oil and voila! sustainable aviation fuel is contributing to deforestation in malaysia. malaysia exports far more used cooking oil than oil that it uses. no surprise. the search for mh370 has resumed. nyt . what a mystery. rick perry i m dedicating my life to fighting for a psychedelic drug. nyt yes, rick perry. marcus had lived with my wife, anita, and me at the governor s mansion after coming home from war. he was in constant pain from his injuries and dependent on opioids just to get through the day. he also drank heavily and used nicotine to cope with stress. worse, he was carrying the burdens that come with war grief, trauma and survivor s guilt. for years, we tried to find him help. and for years, nothing worked. but after undergoing ibogaine treatment at a clinic in mexico, marcus came back changed. he no longer needed opioids. he hasn t touched alcohol in years. he even quit chewing copenhagen, a longtime habit. when your father is a swimming coach alpha school i first heard about alpha in may 2024, and in the absence of randomized controlled clarity, i did what any moderately obsessive parent with three elementary-aged kids and an itch for data would do i moved the family across the country to austin for a year and ran the experiment myself unfortunately, despite trying my best we never managed to have identical twins, so i stopped short of running a proper control group. my wife was less disappointed than i was . your semi-regular reminder to subscribe to don 39 t worry about the vase .",
    "preview": "a jumbo edition this week after a two-week break that was really not necessary. at secret math meeting, researchers struggle to outsmart ai on a weekend in mid-may, a clandestine mathematical conclave...",
    "content": "A jumbo edition this week after a two-week break that was really not necessary. \n\nAt Secret Math Meeting, Researchers Struggle to Outsmart AI: \n\nOn a weekend in mid-May, a clandestine mathematical conclave convened. Thirty of the world’s most renowned mathematicians traveled to Berkeley, Calif., with some coming from as far away as the U.K. The group’s members faced off in a showdown with a “reasoning” chatbot that was tasked with solving problems they had devised to test its mathematical mettle"
  },
  {
    "id": "links-01-08-jun-2025",
    "title": "Links: Week of 01 & 08 Jun 2025",
    "url": "posts/2025/links-01-08-jun-2025.html",
    "date": "2025-06-08T00:00:00.000Z",
    "dateFormatted": "June 8, 2025",
    "excerpt": "1. [More kids are beating cancer. Improving the rest of their lives is next.\n (WaPo)](https://www.washingtonpost.com/health/2025/05/25/pediatric-cance...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "what",
      "not",
      "children",
      "when",
      "one",
      "donloe",
      "just",
      "nyt",
      "different",
      "everyone",
      "simbari",
      "because",
      "think",
      "per",
      "mile",
      "2025",
      "more",
      "cancer",
      "all",
      "high",
      "health",
      "years",
      "later",
      "often",
      "talked",
      "less",
      "working",
      "put",
      "paper",
      "writing",
      "time",
      "mcquarrie",
      "made",
      "fact",
      "said",
      "going",
      "why",
      "such",
      "love",
      "heard",
      "way",
      "right",
      "whether",
      "toilet",
      "aired",
      "looks",
      "get",
      "zarna",
      "garg",
      "video"
    ],
    "searchableText": "more kids are beating cancer. improving the rest of their lives is next. wapo when oncologists gave my 5-year-old daughter the all-clear from high-risk neuroblastoma in 2010, i breathed a sigh of relief. but her health needs were just beginning. fifteen years later, the intense and often toxic treatments that saved emily s life have left her with a host of lifelong health challenges hearing loss, stunted height, endocrine and kidney dysfunction, and permanent hair-thinning issues no one talked about during her 18 months of cancer treatment. a good problem to have from one perspective but no less hard to deal with. questions about ai 2025 my working hypothesis is that human cognition improves markedly once pen is put to paper, and in some cases can continue to improve with extended writing but note many prominent failures . this is correct and yet i do this less than i should. time to commit to writing non-link posts weekly? exact instructions challenge youtube fun. a mission impossible fan favorite returns 3 decades later. even he s surprised. nyt but according to the final reckoning director christopher mcquarrie, donloe made a big impact. in fact, he said in an interview, fans frequently asked him when he was going to bring the character back. for a long time, he didn t understand why donloe engendered such love, until he heard the question framed in a different way when is the team going to do right by what they did to donloe? and i realized why william donloe resonated, mcquarrie said. there was a perceived injustice, whether anybody could put their finger on it or not. the rise of the japanese toilet nyt in 1982, a peculiar commercial aired on televisions across japan. an actress in a pink floral dress and an updo drops paint on her hand and futilely attempts to wipe it off with toilet paper. she looks into the camera and asks everyone, if your hands get dirty, you wash them, right? it s the same for your bottom, she continues. bottoms deserve to be washed, too. civilization on the march. zarna garg went from stay-at-home mom to stand-up comedian nyt after 16 years focusing on her husband, shalabh, and her three children zoya, brij and veer ms. garg re-entered the work force in 2019, but not to return to her erstwhile career as a personal injury lawyer. instead, encouraged by her children, she started working the new york open-mic circuit and performing at westside comedy club before headlining at caroline s on broadway by 2020. in 2023, she talked her way into opening for tina fey and amy poehler on their restless leg tour, and prime video aired her special one in a billion. this spring, she made her film debut in the critically acclaimed rom-com a nice indian boy. her second special, practical people win, will air on hulu in july, and she is developing a sitcom called zarna with mindy kaling and kevin hart. the lightcone podcast on prompting video podcast i am hungry for more such reources. chattel childhood trigger warning - fairly explicit start and parts. i don t approve of the simbari childrearing, not because i think the pain and disgust of what the children are forced to do is inherently bad, but because they are forced. to love someone skillfully is to pour fuel on their soul. it s to see the world through their desire, to delight in it, and go i desire you to get what you want. it is the amplification of their will. the simbari people are destroying the will of their children. my parents destroyed my will. and i think, quite seriously, that our current culture is likewise destroying the will of its children en masse. that s what you do to property. worth thinking about although largely i don 39 t agree with this. her will seems to be doing just fine. i think humans are are social animals and whether something traumatizes us or not is often but not always a function of the social context surrounding the event. what happens to the simbari children if it in fact, does happen. i have not verified or heard of this before doesn 39 t traumatize them because everyone around them considers it perfectly normal. in my mental model, the trauma happens, when you feel something shameful or otherwise different has happened to you and everyone looks at you different. artichokes for the photos. high cost of building in us zuckerburg 39 s worth is 226 billion. the ny subway builds tunnels at 4 bil. per mile. sf 39 s bart builds subways at 2 bil. per mile. it 39 s crazy that all of zuckerberg 39 s wealth would build just 8 of the current nyc subway network. meanwhile in paris cost 250 mil. per mile. ufo? the object was precognitive in behavior. the radar data from the spy-1b system showed that the tic tac descended from 28,000 feet to sea level in 0.78 seconds, a feat requiring acceleration up to 5,880 gs. but here 39 s what no one focuses on that data was correlated by both radar and infrared, meaning this was not a sensor glitch or hallucination...it was a multi-spectrum-confirmed, real-world event. and what s worse? the object decelerated to a dead stop mid-air. bonkers!",
    "preview": "more kids are beating cancer. improving the rest of their lives is next. wapo when oncologists gave my 5-year-old daughter the all-clear from high-risk neuroblastoma in 2010, i breathed a sigh of reli...",
    "content": "\nMore kids are beating cancer. Improving the rest of their lives is next.\n (WaPo) \n\nWhen oncologists gave my 5-year-old daughter the all-clear from high-risk neuroblastoma in 2010, I breathed a sigh of relief.\n\n\nBut her health needs were just beginning.\n\n\nFifteen years later, the intense and often toxic treatments that saved Emily’s life have left her with a host of lifelong health challenges — hearing loss, stunted height, endocrine and kidney dysfunction, and permanent hair-thinning — issues n"
  },
  {
    "id": "links-25-may-2025",
    "title": "Links: Week of 25 May 2025",
    "url": "posts/2025/links-25-may-2025.html",
    "date": "2025-05-25T00:00:00.000Z",
    "dateFormatted": "May 25, 2025",
    "excerpt": "A long list today because this week two of my top sources were on fire - [MR](https://marginalrevolution.com) and [NYT](https://nytimes.com)....",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "quot",
      "nyt",
      "new",
      "drivers",
      "than",
      "not",
      "make",
      "content",
      "current",
      "long",
      "because",
      "still",
      "using",
      "time",
      "which",
      "how",
      "critical",
      "thinking",
      "what",
      "skills",
      "more",
      "web",
      "effects",
      "paper",
      "pricing",
      "uber",
      "surplus",
      "profits",
      "two",
      "parents",
      "know",
      "find",
      "one",
      "found",
      "information",
      "who",
      "doesn",
      "open",
      "cognitive",
      "burger",
      "good",
      "sense",
      "surge",
      "welfare",
      "rider",
      "gross",
      "revenue",
      "week",
      "may",
      "sources"
    ],
    "searchableText": "a long list today because this week two of my top sources were on fire - mr and nyt . my parents expected to be retired. instead, they are raising my sister s kids. nyt beautiful, heartbreaking and uplifting. still booting after all these years the people stuck using ancient windows computers none of the above. well... maybe heartbreaking. no need to click the link though, the title says it all. measles cases in europe, the americas skyrocket this is infuriating for two reasons. the second reason is that you wouldn 39 t know it from reading most news that europe has 10x the cases of usa. nyt i can understand, but i had to scroll down 3 pages on bbc website, after searching for quot measles quot to find a story about something other than rfk jr. and texas moms. your fingers wrinkle in the same pattern every time after long exposure to water heh. also apparently they wrinkle to improve underwater grip, not because the skin expands by absorbing water, which would have been hypothesis. how miami schools are leading 100,000 students into the a.i. future nyt 5 weeks ago, someone buried a 22 lb chest with 10,000 of prizes half in gold , somewhere in san francisco. no one has found it yet. this is the only clue. it was found within a day of this post, so clearly the only thing holding back the search was the number of eyes looking. how many other problems is this true for? quot one of main goals in life has been to make my parents proud quot . 92 in iraq, 78 in india. i remember realizing sometime in my early 30s that my parents didn 39 t know the hierarchy of success in my field. as far as they were concerned i was already successful after college and any quot actual quot success wouldn 39 t register with them. i felt the void in my movtivation for quite some time. having your own kids helps with the transition. ai amp critical thinking an interviewer just asked me what skills ai will make more important. my response? critical thinking skills. this is because in the past there was value in creating large quantities of information. that is now costless. the new currency is how to generate, assimilate, interpret, and make that large amount of information actionable. the next question then becomes how do we teach, and improve our own, critical thinking skills? i discuss that in a recent study where i create a critical thinking skills hierarchy. the agentic web and original sin i have been wondering about this problem for a while - who puts up the content for the llms to train on if everyone gets their answers from the chatbots and doesn 39 t visit websites anymore. the problem, as both i and patel noted, is that this ecosystem depends on humans seeing those webpages, not impersonal agents impervious to advertising, which destroys the economics of ad-supported content sites, which, in the long run, dries up the supply of new content for ai. a potential solution first, the protocol layer should have a mechanism for payments via digital currency, i.e. stablecoins. second, ai providers like chatgpt should build an auction mechanism that pays out content sources based on the frequency with which they are cited in ai answers. the result would be a new universe of creators who will be incentivized to produce high quality content that is more likely to be useful to ai, competing in a marketplace a la the open web indeed, this would be the new open web, but one that operates at even greater scale than the current web given the fact that human attention is a scarce resource, while the number of potential agents is infinite. cargo ship crashed into man s yard after crewman fell asleep, police say nyt the 22 best pizza places in new york right now nyt new studies dismiss signs of life on distant planet nyt dang. seo for ai a look at generative engine optimization the best bookstore in nyc, and then some they re 15. wait until you read their newspaper. nyt we still haven t done hot dogs, teddy said. billy agreed hot dogs should be an editorial priority. and we were still very young we had no idea what we were doing, said billy, a junior varsity quarterback whose hair was tousled into a cruciferous mop. know hope! use of digital technologies was associated with reduced risk of cognitive impairment or 0.42, 95 ci 0.35 0.52 and reduced time-dependent rates of cognitive decline hr 0.74, 95 ci 0.66 0.84 . effects remained significant when accounting for demographic, socioeconomic, health and cognitive reserve proxies. paper here. putting claude 4 opus in an open playground to chat with itself led to it diving into philosophical explorations of consciousness, self-awareness, and by 30 turns it eventually started using sanskrit can 39 t wait till nationalist politicians from my home state get their hands on this. sanskrit! toronto burger shop called good fortune burger renamed its menu items to sound like office supplies, helping remote workers potentially expense meals through work accounts. the quot basic steel stapler quot and quot braided hdmi cord are popular. as a reply points out this doesn 39 t make sense because the order is still from a place called good fortune burger. who benefits from surge pricing? what are the welfare effects of surge pricing? using uber data, i develop an empirical model of spatial equilibrium composed of demand, supply, and matching. i find that surge pricing raises total welfare, benefitting riders but hurting drivers. welfare effects differ substantially across sides of the market rider surplus increases by 3.57 of gross revenue, whereas driver surplus and the platform s current profits decrease by 0.98 and 0.50 of gross revenue, respectively. this doesn 39 t make sense. if it hurts the platform or the drivers, why would they do it? after dropping the pearl of wisdom above, i decided to actually read the paper . in the first two pages i found this uber s current profits decrease by 0.50 of gross revenue. this probably does not mean that uber is hurt, but rather that it is willing to forgo current profits to increase rider surplus the right choice if it believes that long-run shareholder value is more closely tied to rider surplus and customer retention than to current profits. makes sense. after this my eyes glazed over and i dropped the paper in claude and asked it why drivers would participate in this. here 39 s what it says the paper acknowledges this is the more problematic finding. quot my findings suggest that drivers might have good reason to complain. their hourly earnings are not much higher than the minimum wage, so even the small effects i find might be a concern. quot however, drivers may not have full information about the counterfactual uniform pricing , and many drivers are part-time workers using uber for supplemental income rather than as their primary employment.",
    "preview": "a long list today because this week two of my top sources were on fire - mr and nyt . my parents expected to be retired. instead, they are raising my sister s kids. nyt beautiful, heartbreaking and up...",
    "content": "A long list today because this week two of my top sources were on fire - MR and NYT. \n\nMy Parents  Expected to Be Retired. Instead, They Are Raising My Sister’s Kids. (NYT): Beautiful, heartbreaking and uplifting. \n\nStill booting after all these years: The people stuck using ancient Windows computers: None of the above. Well... maybe heartbreaking. No need to click the link though, the title says it all. \n\nMeasles cases in Europe, the Americas skyrocket: This is infuriating for two reasons. The "
  },
  {
    "id": "links-18-may-2025",
    "title": "Links: Week of 18 May 2025",
    "url": "posts/2025/links-18-may-2025.html",
    "date": "2025-05-18T00:00:00.000Z",
    "dateFormatted": "May 18, 2025",
    "excerpt": "1. [How to make money betting on the new Pope](https://x.com/domahhhh/status/1920612517631479984): Great discussion of the betting process. Still plen...",
    "type": "links",
    "tags": [
      "links",
      "alpha"
    ],
    "keywords": [
      "like",
      "season",
      "draft",
      "professor",
      "172",
      "week",
      "alpha",
      "late",
      "get",
      "think",
      "loss",
      "not",
      "because",
      "harvard",
      "links",
      "betting",
      "pope",
      "still",
      "plenty",
      "there",
      "quot",
      "minutes",
      "nba",
      "when",
      "points",
      "game",
      "worth",
      "popular",
      "unpopular",
      "policies",
      "magna",
      "carta",
      "original",
      "carpenter",
      "law",
      "school",
      "said",
      "vincent",
      "saying",
      "what",
      "200",
      "1946",
      "1965",
      "2025",
      "may",
      "how",
      "make",
      "money",
      "new",
      "great"
    ],
    "searchableText": "how to make money betting on the new pope great discussion of the betting process. still plenty of luck involved but a reminder that there is plenty of quot alpha quot out there if you look in the right place. maybe i should create a hashtag for these stories. alpha a few minutes later, my jaw dropped as prevost -- the guy i had just amasssed shares in at 200-1 like 20 minutes earlier-- walked out onto the balcony as pope. on the nba and economic theory solving the problem of late season tanking to get a shot at the draft lottery in the nba. quite simple when you think about it. optimal mechanism get points for each loss. in game 1, a loss is worth 1 draft point. as season continues, loss is worth less, becoming negative late. draft position based on draft points. everyone wants to win late in season. early season used to handicap truly bad teams. populism is not popular. success is popular. and singapore is well run precisely because it adopts unpopular technocratic policies like zero tariffs, forced saving, and congestion pricing. and the pap keeps getting re-elected, not despite, but because of those unpopular policies. playing the long game, succesfully, since 1965. harvard paid 27 for a copy of magna carta. surprise! it s an original. to be fair it was 27 in 1946 dollars, but still. alpha professor carpenter was at home in blackheath, south east london, plowing his way through harvard law school s digital images as research for a book when he opened a file named hls ms 172 the catalog name for harvard law school manuscript 172. i get down to 172 and it s a single parchment sheet of magna carta, he said. and i think oh my god, this looks to me for all the world because i read it like an original. professor carpenter emailed professor vincent, who was, at the time, at work in a library in brussels. david sent it with a message saying, what do you think that is? said professor vincent. i wrote back within seconds, saying, you and i both know what that is! i would not have answered like that. a light week on links as it was a heavy week in life.",
    "preview": "how to make money betting on the new pope great discussion of the betting process. still plenty of luck involved but a reminder that there is plenty of quot alpha quot out there if you look in the rig...",
    "content": "\nHow to make money betting on the new Pope: Great discussion of the betting process. Still plenty of luck involved but a reminder that there is plenty of &quot;alpha&quot; out there if you look in the right place. Maybe I should create a hashtag for these stories. #alpha\n\nA few minutes later, my jaw dropped as Prevost -- the guy I had just amasssed shares in at 200-1 like 20 minutes earlier-- walked out onto the balcony as Pope.\n\n\nOn the NBA and economic theory: Solving the problem of late seaso"
  },
  {
    "id": "links-10-may-2025",
    "title": "Links: Week of 10 May 2025",
    "url": "posts/2025/links-10-may-2025.html",
    "date": "2025-05-10T00:00:00.000Z",
    "dateFormatted": "May 10, 2025",
    "excerpt": "1. [You Sent the Message. But Did You Write It?](https://davidduncan.substack.com/p/you-sent-the-message-but-did-you?triedRedirect=true): Hilarious....",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "said",
      "when",
      "points",
      "new",
      "india",
      "mexican",
      "indian",
      "lollipops",
      "lafavers",
      "week",
      "prompt",
      "how",
      "ukraine",
      "video",
      "more",
      "used",
      "soldiers",
      "russian",
      "troops",
      "equipment",
      "called",
      "drones",
      "soon",
      "online",
      "units",
      "really",
      "need",
      "nyt",
      "made",
      "american",
      "outside",
      "men",
      "near",
      "women",
      "lego",
      "drivers",
      "parade",
      "fun",
      "some",
      "one",
      "here",
      "track",
      "bit",
      "unparalleled",
      "misalignments",
      "words",
      "geoguessr",
      "another",
      "boxes",
      "600"
    ],
    "searchableText": "you sent the message. but did you write it? hilarious. chatcident when someone slips and pastes the prompt into the chat or email instead of the polished ai output exposing the wizard behind the curtain. points for kills how ukraine is using video game incentives to slay more russians ukraine 39 s military is turning to incentive schemes used in video games to spur its soldiers to kill more russian troops and destroy their equipment. the program called army of drones bonus rewards soldiers with points if they upload videos proving their drones have hit russian targets. it will soon be integrated with a new online marketplace called brave 1 market, which will allow troops to convert those points into new equipment for their units. how far are you from india, measured in units of india? i really need to update the site to show tweets inline or at least display images. hope claude is up to the task. this is the moment for mexican indian food to flourish nyt a marriage made in heaven. literally. a small, close-knit mexican indian american community formed outside sacramento when a generation of punjabi sikh and muslim men immigrated from india to find work as farmers and loggers beginning in the late 1800s. after the immigration act of 1917 made it near impossible for indian women to immigrate, hundreds of these men married mexican women. new kinds of cooking emerged from their idiosyncratic home kitchens and a handful of restaurants the families went on to run. lego built full-size f1 cars for the miami gp drivers parade. that was the most fun drivers parade we ve ever had, ferrari s lewis hamilton said. some dirty driving from this one here gasly ! that was great fun. they ll have to sweep the track, there s quite a bit of lego debris on the track, max verstappen said. a bit different, that s for sure! tim urban on ai. in 2015. really need to add the tweet feature. unparalleled misalignments i think i have shared this before but some things are worth sharing twice. this is a list of unparalleled misalignments, pairs of non-synonymous phrases where the words in one phrase are each synonyms of the words in the other. butt dial booty call father figure dad bod local girl near miss globalization did not hollow out the american middle class pro-prompting a master in action. prompt used for geoguessr by kelsey tuoc, in the last week 39 s link on ai playing geoguessr. boy accidentally orders 70,000 lollipops on amazon. panic ensues. nyt on sunday morning, as holly lafavers was preparing to go to church, a delivery worker dropped off a 25-pound box of lollipops in front of her apartment building in lexington, ky. and another. and then another. soon, 22 boxes of 50,600 lollipops were stacked five boxes high in two walls of dum-dums. that was when ms. lafavers heard what no parent wants to hear her child had unwittingly placed a massive online order. mom, my suckers are here! said her son, liam, who had gone outside to ride his scooter. i panicked, ms. lafavers, 46, said. i was hysterical.",
    "preview": "you sent the message. but did you write it? hilarious. chatcident when someone slips and pastes the prompt into the chat or email instead of the polished ai output exposing the wizard behind the curta...",
    "content": "\nYou Sent the Message. But Did You Write It?: Hilarious.\n\n Chatcident: When someone slips and pastes the prompt into the chat or email instead of the polished AI output – exposing the wizard behind the curtain.\n\n\nPoints for kills: How Ukraine is using video game incentives to slay more Russians: \n\nUkraine&#39;s military is turning to incentive schemes used in video games to spur its soldiers to kill more Russian troops and destroy their equipment.\n\n\nThe program — called Army of Drones bonus — re"
  },
  {
    "id": "links-04-may-2025",
    "title": "Links: Week of 04 May 2025",
    "url": "posts/2025/links-04-may-2025.html",
    "date": "2025-05-04T00:00:00.000Z",
    "dateFormatted": "May 4, 2025",
    "excerpt": "1. [How to make hard choices (YouTube)](https://youtu.be/8GQZuzIdeQQ?si=ERdOHec3NsK6sdvP): A great video and especially personally relevant right now....",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "how",
      "video",
      "very",
      "man",
      "bite",
      "arm",
      "200",
      "may",
      "great",
      "right",
      "now",
      "just",
      "good",
      "close",
      "also",
      "can",
      "identify",
      "any",
      "photo",
      "snakes",
      "times",
      "two",
      "long",
      "venom",
      "left",
      "found",
      "macro",
      "most",
      "650",
      "2025",
      "links",
      "week",
      "make",
      "hard",
      "choices",
      "youtube",
      "especially",
      "personally",
      "relevant",
      "playing",
      "geoguessr",
      "apparently",
      "still",
      "makes",
      "errors",
      "course",
      "amazed",
      "got",
      "limited",
      "clues"
    ],
    "searchableText": "how to make hard choices youtube a great video and especially personally relevant right now. just how good is o3 at playing geoguessr apparently very good. it still makes errors of course, but i was amazed at how close it got with very limited clues. worth repeating this bit from last weeks link it s also deeply dystopian. technology can identify locations from photographs now. it s vitally important that people understand how easy this is if you have any reason at all to be concerned about your safety, you need to know that any photo you share even a photo as bland as my example above could be used to identify your location. universal antivenom may grow out of man who let snakes bite him 200 times nyt the video is just under two and a half minutes long. a slim man with close-cropped hair walks into a room, pulls a long black mamba whose venom can kill within an hour from a crate and allows it to bite his left arm. immediately after, he lets a taipan from papua new guinea bite his right arm. thanks for watching, he calmly tells the camera, his left arm bleeding, and then exits. over nearly 18 years, the man, tim friede, 57, injected himself with more than 650 carefully calibrated, escalating doses of venom to build his immunity to 16 deadly snake species. he also allowed the snakes mostly one at a time, but sometimes two, as in the video to sink their sharp fangs into him about 200 times. ken rogoff on conversations with tyler great discussion on so many different topics - china, pakistan, us, chess. i found it very insightful. macro utopia economics heavy list today but i have found scott sumner to have the most useful and probably most accurate predictions about macro.",
    "preview": "how to make hard choices youtube a great video and especially personally relevant right now. just how good is o3 at playing geoguessr apparently very good. it still makes errors of course, but i was a...",
    "content": "\nHow to make hard choices (YouTube): A great video and especially personally relevant right now. \n\nJust how good is O3 at  playing GeoGuessr: Apparently very good. It still makes errors of course, but I was amazed at how close it got with very limited clues. Worth repeating this bit from last weeks link:\n\nIt’s also deeply dystopian. Technology can identify locations from photographs now. It’s vitally important that people understand how easy this is—if you have any reason at all to be concerned "
  },
  {
    "id": "links-26-apr-2025",
    "title": "Links: Week of 26 Apr 2025",
    "url": "posts/2025/links-26-apr-2025.html",
    "date": "2025-04-26T00:00:00.000Z",
    "dateFormatted": "April 26, 2025",
    "excerpt": "A lot of NYT links today. For all its flaws, of which there might be many, the NYT is incomparable. \n1. Good advice from [Ross Douthat](https://www.ny...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "can",
      "people",
      "even",
      "don",
      "new",
      "game",
      "also",
      "what",
      "photo",
      "all",
      "york",
      "board",
      "like",
      "year",
      "media",
      "know",
      "long",
      "most",
      "male",
      "important",
      "because",
      "used",
      "radio",
      "station",
      "any",
      "links",
      "nyt",
      "there",
      "child",
      "learn",
      "drive",
      "just",
      "read",
      "expensive",
      "aren",
      "night",
      "food",
      "big",
      "one",
      "who",
      "where",
      "shared",
      "another",
      "egg",
      "life",
      "click",
      "not",
      "eggs",
      "company",
      "really"
    ],
    "searchableText": "a lot of nyt links today. for all its flaws, of which there might be many, the nyt is incomparable. good advice from ross douthat have the child. practice the religion. found the school. support the local theater, the museum, the opera or concert hall, even if you can see it all on youtube. pick up the paintbrush, the ball, the instrument. learn the language even if there s an app for it. learn to drive, even if you think soon waymo or tesla will drive for you. put up headstones, don t just burn your dead. sit with the child, open the book, and read. or play a boardgame? new york can be expensive, overwhelming and intimidating, and sometimes it is hard for people to connect. a martini can cost 25 in a bar that s too noisy for conversation, and raucous nightclubs aren t for everyone. so a free, monthly b.y.o.b. bring your own board game night in an office building food court has become a big hit. in addition to werewolf, people were playing classics, like chess and mahjong, but also relatively newer games, including catan, splendor, hues and cues, saboteur, nertz, wavelength, blokus and camel up. board game events and clubs have grown in popularity in recent years in new york and across the country. this one is organized by richard ye, a 24-year-old who works in finance. he bills the event as new york city s largest board game meet-up, and a video of mr. ye celebrating his march gathering where 500 people were in attendance was widely shared on social media. file another one under youcanjustdothings. what i didn t know about the egg industry horrified me as a life-long vegetarian who can 39 t even imagine turning vegan, i try to avoid evangelizing about what people should eat. despite the click-baity headline and not the most objective tone, the scientific brekthrough here is worth cheering. called in ovo sexing, it determines the sex of the chick embryo long before it hatches, allowing the producers to get rid of the male eggs and hatch only the females. this is important because i had no idea that while the ladies enjoyed shelter and sunshine, fresh bugs and freedom, their newborn brothers faced a gruesome fate shared by 6.5 billion male chicks around the world each year. these male birds can t lay eggs but also aren t raised for meat. because they come from egg-laying breeds, they don t grow big or fast enough to be used for food. so they are ground up alive or gassed to death. questions about the future of ai by dwarkesh patel i haven 39 t read most of this but what i have is great. another important question about ai by radek sienkiewicz why do ai company logos look like buttholes? click the link. they really do. in a year will this still make news? australian radio network arn , the media company behind kiis, as well as gold and iheart, used an ai-generated female asian host to broadcast 4 hours of midweek radio, without disclosing it. this probably still will it seems very odd that cada hired a new ethnically-diverse woman to their youth station and then just forgot to tell anyone. it s notable because arn is the whitest thing in media since the night king and his throng of walkers on game of thrones. the network is also home of australia s most expensive, complained about and censured radio show, kyle and jackie o. penn station s not-so-secret other life the people s dance studio penn station is first and foremost a transportation hub, said aaron donovan, the deputy communications director for the metropolitan transportation authority. but you know, as long as folks abide by the rules and regulations that govern the use of the space and don t block platforms or interfere with passenger flows, we generally don t have any problem with what s going on. watching o3 guess a photo s location is surreal, dystopian and wildly entertaining by simon willison first, this is really fun. watching the model s thought process as it churns through the photo, pans and zooms and discusses different theories about where it could be is wildly entertaining. it s like living in an episode of csi. it s also deeply dystopian. technology can identify locations from photographs now. it s vitally important that people understand how easy this is if you have any reason at all to be concerned about your safety, you need to know that any photo you share even a photo as bland as my example above could be used to identify your location.",
    "preview": "a lot of nyt links today. for all its flaws, of which there might be many, the nyt is incomparable. good advice from ross douthat have the child. practice the religion. found the school. support the l...",
    "content": "A lot of NYT links today. For all its flaws, of which there might be many, the NYT is incomparable. \n\nGood advice from Ross Douthat: \n\nHave the child. Practice the religion. Found the school. Support the local theater, the museum, the opera or concert hall, even if you can see it all on YouTube. Pick up the paintbrush, the ball, the instrument. Learn the language — even if there’s an app for it. Learn to drive, even if you think soon Waymo or Tesla will drive for you. Put up headstones, don’t ju"
  },
  {
    "id": "links-19-apr-2025",
    "title": "Links: Week of 19 Apr 2025",
    "url": "posts/2025/links-19-apr-2025.html",
    "date": "2025-04-19T00:00:00.000Z",
    "dateFormatted": "April 19, 2025",
    "excerpt": "1. [How \"The Joker\" Took Down The Texas Lottery (WSJ Paywall)](https://www.wsj.com/us-news/texas-lottery-gamblers-jackpot-win-40e3d6fb): What a story....",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "lottery",
      "there",
      "tickets",
      "texas",
      "numbers",
      "day",
      "via",
      "how",
      "many",
      "team",
      "such",
      "all",
      "commission",
      "moon",
      "any",
      "can",
      "just",
      "stevens",
      "quot",
      "paywall",
      "also",
      "people",
      "play",
      "choose",
      "ticket",
      "allowed",
      "set",
      "print",
      "marantelli",
      "one",
      "com",
      "printing",
      "like",
      "terminals",
      "winner",
      "drawing",
      "pot",
      "saturday",
      "operation",
      "crew",
      "game",
      "called",
      "picking",
      "some",
      "other",
      "computer",
      "build",
      "including",
      "power",
      "human"
    ],
    "searchableText": "how quot the joker quot took down the texas lottery wsj paywall what a story. there is plenty of alpha out there, if you know where and how to look. also, brute force is underrated. sadly behind a paywall and there 39 s lot more to it than the gist below in texas, as in many states, most people who play the lottery go to a store with a machine, choose numbers, then walk away with a ticket. back in 2023, texas also allowed online lottery-ticket vendors to set up shops to print tickets for their customers. marantelli s team recruited one such seller, struggling startup lottery.com, to help with the logistics of buying and printing the millions of tickets. like all lotto retailers, it would collect a 5 sales commission. the texas lottery commission allowed dozens of the terminals that print tickets to be delivered to the four workshops set up by the team. that april 19, the commission announced that there had been no winner in that day s drawing. the next drawing, with an even larger pot, would be three days later, on a saturday. the group sprang into action. the printing operation ran day and night. the team had converted each number combination into a qr code. crew members scanned the codes into the terminals using their phones, then scrambled to organize all the tickets in boxes such that they could easily locate the winning numbers. the game called for picking six numbers from 1 to 54. for a pro gambler, some sets of numbers such as 1,2,3,4,5,6 aren t worth picking because so many other players choose them, which would split the pot. marantelli s operation bought 99.3 of the possibilities. money moved to lottery.com from ranogajec s accounts held under the name john wilson in the isle of man, a tax haven off the u.k. coast, taking a circuitous route via an escrow account at a detroit law firm, according to people familiar with the transfers and bank statements reviewed by the journal. the crew hit the jackpot that saturday. one of their tickets was the sole winner. the moon should be a computer love the ambition. so much fun to read. there are other reasons to build a moon computer, including to avoid the regulatory hurdles to build the energy centers needed to power centralized ai clusters and as a sovereignty play in the increasingly fraught geopolitical game on the road to developing artificial general intelligence agi a system with the ability to solve virtually any cognitive task a human can. we of, course, don t have to mine the moon just to replicate a single human mind, but we might have to do so to power superintelligence, same in kind but vastly superior to our own. how bad are these regulations exactly? stevens a hackable ai assistant via simon willison so many cool projects, so little time. the assistant is called stevens, named after the butler in the great ishiguro novel remains of the day. every morning it sends a brief to me and my wife via telegram, including our calendar schedules for the day, a preview of the weather forecast, any postal mail or packages we re expected to receive, and any reminders we ve asked it to keep track of. all written up nice and formally, just like you d expect from a proper butler. beyond the daily brief, we can communicate with stevens on-demand we can forward an email with some important info, or just leave a reminder or ask a question via telegram chat. every a great site focused on ai related stories. obvious travel advice despite being only 0.3 of the world s population, australians seem to make up 10 of overseas visitors everywhere on the planet. do not be disturbed by this well-known optical illusion.",
    "preview": "how quot the joker quot took down the texas lottery wsj paywall what a story. there is plenty of alpha out there, if you know where and how to look. also, brute force is underrated. sadly behind a pay...",
    "content": "\nHow &quot;The Joker&quot; Took Down The Texas Lottery (WSJ Paywall): What a story. There is plenty of alpha out there, if you know where and how to look. Also, brute force is underrated. Sadly behind a paywall and there&#39;s lot more to it than the gist below:\n\nIn Texas, as in many states, most people who play the lottery go to a store with a machine, choose numbers, then walk away with a ticket. Back in 2023, Texas also allowed online lottery-ticket vendors to set up shops to print tickets fo"
  },
  {
    "id": "update-12-apr-2025",
    "title": "Update: 12 Apr 2025",
    "url": "posts/2025/update-12-apr-2025.html",
    "date": "2025-04-12T00:00:00.000Z",
    "dateFormatted": "April 12, 2025",
    "excerpt": "After a few more iterations with Claude, the website is looking a lot better but it isn't working that much better. The Archives link on top right thr...",
    "type": "notes",
    "tags": [
      "post"
    ],
    "keywords": [
      "now",
      "quot",
      "fixed",
      "not",
      "more",
      "there",
      "also",
      "get",
      "posts",
      "website",
      "better",
      "working",
      "top",
      "page",
      "cms",
      "set",
      "can",
      "2025",
      "update",
      "apr",
      "few",
      "iterations",
      "claude",
      "looking",
      "lot",
      "isn",
      "much",
      "archives",
      "link",
      "right",
      "throws",
      "poorly",
      "formatted",
      "huge",
      "black",
      "approved",
      "thoughts",
      "smaller",
      "blue",
      "version",
      "header",
      "redundant",
      "many",
      "other",
      "issues",
      "managed",
      "login",
      "see",
      "all",
      "useless"
    ],
    "searchableText": "after a few more iterations with claude, the website is looking a lot better but it isn 39 t working that much better. the archives link on top right throws up a poorly formatted page. 1 the huge, black quot approved thoughts quot at the top of the page and the smaller blue version in the header are redundant. 2 there are many other issues to be fixed. i also managed to get the cms set up so that i could login and see all the posts in the cms. 3 it is useless though because the posts i create there do not show up on the site. so there is some solid debugging needed before i can get more ambitious here. still i am quite chuffed that i have this set up and working. between the markets and a potential relocation, i have not devoted any time to this website. hopefully that changes soon. i have also decided another project i want to try my hand at. more as i get started. thought for the day if you ask quot do i feel like doing this now quot , you won 39 t do it. certainly not regularly. first, figure out how to stop the question. footnotes this is now fixed. this is also now fixed, although i am not sure if it is an improvement. this was almost fixed but broke again and i have given up for now. when on the road, i can add posts directly via github so, i am good for now.",
    "preview": "after a few more iterations with claude, the website is looking a lot better but it isn 39 t working that much better. the archives link on top right throws up a poorly formatted page. 1 the huge, bla...",
    "content": "After a few more iterations with Claude, the website is looking a lot better but it isn&#39;t working that much better. The Archives link on top right throws up a poorly formatted page.1 The huge, black  &quot;Approved Thoughts&quot; at the top of the page and the smaller blue version in the header are redundant.2 There are many other issues to be fixed. \nI also managed to get the CMS set up so that I could login and see all the posts in the CMS.3 It is useless though because the posts I create "
  },
  {
    "id": "links-12-apr-2025",
    "title": "Links: Week of 12 Apr 2025",
    "url": "posts/2025/links-12-apr-2025.html",
    "date": "2025-04-12T00:00:00.000Z",
    "dateFormatted": "April 12, 2025",
    "excerpt": "1. [Digital hygiene](https://karpathy.bearblog.dev/digital-hygiene/) by [Andrej Karpathy](https://karpathy.ai/): I discovered this just a little late ...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "series",
      "set",
      "one",
      "great",
      "all",
      "what",
      "more",
      "week",
      "want",
      "there",
      "detective",
      "recommended",
      "try",
      "first",
      "books",
      "chandler",
      "read",
      "plenty",
      "just",
      "where",
      "getting",
      "some",
      "recommendations",
      "already",
      "recommend",
      "which",
      "across",
      "devices",
      "many",
      "free",
      "life",
      "also",
      "like",
      "big",
      "scandinavian",
      "story",
      "most",
      "high",
      "prompt",
      "need",
      "any",
      "two",
      "john",
      "crowd",
      "sourced",
      "franchises",
      "suggestions",
      "start",
      "often",
      "connelly"
    ],
    "searchableText": "digital hygiene by andrej karpathy i discovered this just a little late to include in the last weeks post, where it would have been the perfect companion piece along with this one on getting phished. i practice some of these recommendations already and wholeheartedly recommend the password manager, for example. i use dashlane , which is about 60 a year if you want to sync across devices, but there are many free tools out there. bitwarden offers all the essential features, including syncing across devices, for free and the paid versions are cheaper too. i plan to explore his solutions for credit cards privacy.com this weekend. work-life separation is also great advice, which i did not follow in the past but am doing at my new ish job. flight to unkown destinations . would you take one? doesn 39 t seem like a big deal to me. as a reply to the tweet says, unlikely they will put you in a war zone, so if it is in schengen, how bad could it be? i am probably clueless... scandinavian airlines are running unknown destination flights. you buy a ticket and board the plane. then you find out where you are going. would you do it? kim shin-jo, 82, failed north korean assassin, dies as pastor in the south nyt paywall what a story and what a life! and this story is straight out of hollywood, but without the happy ending. getting the most from deep research models after a fair bit of experimentation, i 39 ve built a claude project that handles all the repeatable high-effort prompt engineering like source selection for you. it asks for your preferences, clarifies what you need, and produces a well-structured prompt that you can then feed into any dr model. two high-value excerpts from john authers bloomberg newsletters here follows a crowd-sourced literary tip. i asked yesterday for recommendations on great detective franchises for easy reading in stressful times, and you delivered. i ve had so many suggestions that this will need to come in installments. to start, the name you ve recommended most often, and with greatest enthusiasm, is michael connelly and his harry bosch series the detective loves jazz and lives in the la hills . other entrants includes the dave robicheaux series by james lee burke set in louisiana and starting with the neon rain , arnaldur indridason s really good, bleak icelandic stuff try jar city first . volker kutscher s babylon berlin series, set in weimar germany. robert van gulik s judge dee stories written some decades ago and set in ancient china try willow pattern . also the martin beck books set in 1960-70s sweden and written over 10 years by maj sjowall and per wahloo a husband and wife team, and godparents of scandinavian noir roseanna is recommended and the harry hole books by jo nesbo , set in norway. to be clear, i didn t mention raymond chandler s marlowe books because i ve already read all of them. if you ve never dipped into chandler, you have a treat in store perhaps start with the big sleep. and as more than one of you said connelly was as good as chandler, i definitely want to read one of his. i ll have plenty more suggestions tomorrow. please, if you have any more to recommend, let me know. herewith another installment in our crowd-sourced tour of great detective fiction franchises. you might want to try abir mukherjee s wyndham and banerjee series is set in india under the british raj the canadian writer eric wright s john salter series, set in toronto philip kerr s bernie gunther series, set in nazi germany the whitstable pearl mysteries by julie wassmer who used to be a scriptwriter for eastenders so there are plenty of cliffhangers andrea camilleri s inspector montalbano series, featuring sicily and plenty of great food and death of a red heroine, the first of the inspector chen series by qiu xiaolong in contemporary shanghai. this comes highly recommended by andy rothman of sinology, long one of my favorite guides to all things china, and by remarkable coincidence i had picked up a copy of this book from a neighborhood bookshelf earlier this week. so that s what i ll read next. more detectives next week. drew breunig via simon willison the first generation of ai-powered products often called ai wrapper apps, because they just are wrapped around an llm api were quickly brought to market by small teams of engineers, picking off the low-hanging problems. but today, i m seeing teams of domain experts wading into the field, hiring a programmer or two to handle the implementation, while the experts themselves provide the prompts, data labeling, and evaluations. for these companies, the coding is commodified but the domain expertise is the differentiator. s anand a great website from a college senior. on campus he was know as stud anand.",
    "preview": "digital hygiene by andrej karpathy i discovered this just a little late to include in the last weeks post, where it would have been the perfect companion piece along with this one on getting phished. ...",
    "content": "\nDigital hygiene by Andrej Karpathy: I discovered this just a little late to include in the last weeks post, where it would have been the perfect companion piece along with this one on getting phished. \n I practice some of these recommendations already and wholeheartedly recommend the password manager, for example. I use Dashlane, which is about $60 a year if you want to sync across devices, but there are many free tools out there. Bitwarden offers all the essential features, including syncing a"
  },
  {
    "id": "links-06-apr-2025",
    "title": "Links: Week of 06 Apr 2025",
    "url": "posts/2025/links-06-apr-2025.html",
    "date": "2025-04-06T00:00:00.000Z",
    "dateFormatted": "April 6, 2025",
    "excerpt": "1. [Myanmar Earthquake passing through Europe](https://x.com/zaibatsu/status/1905813574930382865?s=48): I experienced the shaking in Bangkok. First, I...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "essay",
      "dizzy",
      "even",
      "agree",
      "there",
      "understand",
      "rejection",
      "ratio",
      "going",
      "now",
      "right",
      "can",
      "more",
      "quot",
      "2025",
      "2027",
      "links",
      "week",
      "apr",
      "myanmar",
      "earthquake",
      "passing",
      "europe",
      "experienced",
      "shaking",
      "bangkok",
      "first",
      "thought",
      "getting",
      "realization",
      "struck",
      "kind",
      "disorienting",
      "walking",
      "stairs",
      "building",
      "periodically",
      "feeling",
      "didn",
      "feel",
      "real",
      "almost",
      "just",
      "drill",
      "joke",
      "human",
      "odysseus",
      "translation",
      "too",
      "preferred"
    ],
    "searchableText": "myanmar earthquake passing through europe i experienced the shaking in bangkok. first, i thought i was getting dizzy before the realization struck. it was kind of disorienting walking down the stairs of the building, periodically feeling dizzy. it didn 39 t feel real, almost as if it was just a drill or a joke. ai vs. human odysseus translation i, too, preferred the ai version. even if you don 39 t agree with the ranking, it is clearly good enough. tough out there for kids hard to understand the rejection ratio. i was originally going to link to a thread by a university professor with experience in admissions, critiquing his personal essay but she has locked her account now, i assume after it went viral. if i recall correctly, she felt his essay did not show the right attitude for various reasons. many on twitter and i disagreed but even if you agree with her take, the essay highlights a very impressive person and seems factually accurate . so i struggle to understand the rejection ratio. if he can fall for a phishing attack, so can you and they are only going to get more sophisticated. be careful out there and step up your safety protocols. ai 2027 i have yet to fully read this but it is a lot more quot optimistic quot on ai progress than i am right now and at least somewhat scary.",
    "preview": "myanmar earthquake passing through europe i experienced the shaking in bangkok. first, i thought i was getting dizzy before the realization struck. it was kind of disorienting walking down the stairs ...",
    "content": "\nMyanmar Earthquake passing through Europe: I experienced the shaking in Bangkok. First, I thought I was getting dizzy before the realization struck. It was kind of disorienting walking down the stairs of the building, periodically feeling dizzy. It didn&#39;t feel real, almost as if it was just a drill or a joke. \n\nAI vs. Human: Odysseus Translation: I, too, preferred the AI version. Even if you don&#39;t agree with the ranking, it is clearly good enough. \n\nTough out there for kids: Hard to und"
  },
  {
    "id": "links-30-mar-2025",
    "title": "Links: Week of 30 Mar 2025",
    "url": "posts/2025/links-30-mar-2025.html",
    "date": "2025-03-30T00:00:00.000Z",
    "dateFormatted": "March 30, 2025",
    "excerpt": "1. [Unintentionally hilarious](https://www.washingtonpost.com/world/interactive/2025/greenland-trump-defense-russia-china/):...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "more",
      "world",
      "app",
      "two",
      "seals",
      "which",
      "how",
      "see",
      "conversations",
      "without",
      "actual",
      "enhancements",
      "homeschooling",
      "makes",
      "much",
      "tokyo",
      "japan",
      "city",
      "don",
      "right",
      "375",
      "2025",
      "links",
      "week",
      "mar",
      "unintentionally",
      "hilarious",
      "danish",
      "defense",
      "ministry",
      "also",
      "plans",
      "fund",
      "dogsled",
      "teams",
      "protect",
      "000",
      "square",
      "mile",
      "northeast",
      "greenland",
      "national",
      "park",
      "largest",
      "hardcore",
      "sirius",
      "patrols",
      "viewed",
      "danes",
      "navy"
    ],
    "searchableText": "unintentionally hilarious the danish defense ministry also plans to fund two more dogsled teams to protect the 375,000-square-mile northeast greenland national park, the largest in the world. these would be the hardcore sirius patrols, viewed by the danes as the navy seals of the arctic, which began operations during world war ii. two. not one. how to vibe code? a fairly decent app and when you see his conversations with chatgpt, its mostly just plain english. does a programming background help. sure, but you can go quite far without any. here are the actual conversations a. starting the app b. enhancements c. more enhancements d. deploy to iphone e. the actual app why we ended up homeschooling tl dr homeschooling makes it much easier to individualize education, which makes it more efficient and meaningful. tokyo vs. rest of japan this is called the sponge city effect in my little world of demographics. in a declining region we often see the biggest city soaking up population since jobs and health services etc cluster in a single area rather than spreading out. japan has been shrinking for three decades while tokyo happily grows. how much would you need to be paid to live on a deserted island for 1.5 years and do nothing but kill seals? what it says on the label. best take people are rightfully upset about this atlantic story because it gets at a truly alarming issue being added to large, ongoing group texts without consent true that! your brain will invent fake problems for you if you don 39 t go out and find real ones i don 39 t know if this is the right path, but its the right destination",
    "preview": "unintentionally hilarious the danish defense ministry also plans to fund two more dogsled teams to protect the 375,000-square-mile northeast greenland national park, the largest in the world. these wo...",
    "content": "\nUnintentionally hilarious: \n\nThe Danish Defense Ministry also plans to fund two more dogsled teams to protect the 375,000-square-mile Northeast Greenland National Park, the largest in the world. These would be the hardcore Sirius patrols, viewed by the Danes as the Navy SEALs of the Arctic, which began operations during World War II.\n\nTwo. Not one.\n\nHow to vibe code?: A fairly decent app and when you see his conversations with ChatGPT, its mostly just plain english. Does a programming backgroun"
  },
  {
    "id": "links-22-mar-2025",
    "title": "Links: Week of 22 Mar 2025",
    "url": "posts/2025/links-22-mar-2025.html",
    "date": "2025-03-22T00:00:00.000Z",
    "dateFormatted": "March 22, 2025",
    "excerpt": "1. [The Kids Are Not All Right](https://magazine.ucsf.edu/kids-not-all-right) via [MR](https://marginalrevolution.com/marginalrevolution/2025/03/what-...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "jeffrey",
      "not",
      "quot",
      "premium",
      "via",
      "all",
      "heart",
      "surgery",
      "every",
      "yes",
      "there",
      "marital",
      "600",
      "any",
      "pain",
      "five",
      "lawson",
      "most",
      "than",
      "models",
      "years",
      "also",
      "happiness",
      "sex",
      "1972",
      "humans",
      "can",
      "anything",
      "how",
      "much",
      "today",
      "weeks",
      "common",
      "pda",
      "open",
      "children",
      "days",
      "little",
      "given",
      "just",
      "child",
      "babies",
      "doctor",
      "vegetarian",
      "chicken",
      "popular",
      "dishes",
      "outside",
      "state",
      "less"
    ],
    "searchableText": "the kids are not all right via mr reminder that humans, often the smartest humans, can believe anything. wonder how much of the coventional wisdom today falls in this category. two weeks after his birth, jeffrey s health took a turn for the worse he developed a heart defect common in premature infants patent ductus arteriosus, or pda. jeffrey was scheduled for open-heart surgery and transferred to the nearest children s hospital. in those days, surgery for pda was invasive. holes were cut on either side of jeffrey s tiny neck and chest to insert a catheter into his jugular vein. his little body was opened from breastbone to backbone, his flesh lifted aside, ribs pried apart, and a blood vessel near his heart tied off, and then all the tissues were stitched back together. baby jeffrey felt everything every incision, every internal repair, every stitch. the medical team had not given their fragile patient any drugs, any comfort, anything to protect him from the excruciating pain of open-heart surgery just a paralyzing agent to keep him still during the procedure. five weeks later, jeffrey passed away. in the days before her child s death, jill lawson learned a shocking fact anesthetizing babies for surgery was not common practice. after jeffrey died, lawson called his doctor for reassurance. surely, she thought, her child had been given something for the pain. the anesthesiologist informed me that she had not used any anesthesia or analgesia on jeffrey, lawson wrote in an account of her son s experience. the doctor told the grieving mother it hadn t even occurred to her to do so because it had never been demonstrated that babies can feel pain. peelraja via mr the paradox of india punjab is over 60 vegetarian, but tandoori chicken and butter chicken are its most popular dishes outside the state. tamil nadu is less than 1 vegetarian, but its quot pure veg quot idly, dosa, sambhar, pongal, etc are its most popular dishes outside the state. the seneca via daring fireball the seneca is my middle finger to the aesthetic homogeneity and economic over-optimization of 21st century life. a keyboard for the low, low price of 3,600. yes, a computer keyboard. yes, us . although to be fair, it is not 3,600. its quot from 3,600 quot . my thoughts on the future of quot ai quot via simon willison i have very wide error bars on the potential future of large language models, and i think you should too. specifically, i wouldn 39 t be surprised if, in three to five years, language models are capable of performing most all? cognitive economically-useful tasks beyond the level of human experts. and i also wouldn 39 t be surprised if, in five years, the best models we have are better than the ones we have today, but only in normal ways where costs continue to decrease considerably and capabilities continue to get better but there 39 s no fundamental paradigm shift that upends the world order. the anatomy of marital happiness via mr since 1972, the general social survey has periodically asked whether people are happy with yes, maybe or no type answers. here i use a net happiness measure, which is percentage yes less percentage no with maybe treated as zero. average happiness is around 20 on this scale for all respondents from 1972 to the last pre-pandemic survey 2018 . however, there is a wide gap of around 30 points between married and unmarried respondents. this marital premium is this paper s subject. i describe how this premium varies across and within population groups. these include standard socio demographics age, sex, race education, income and more. i find little variety and thereby surface a notable regularity in us socio demography there is a substantial marital premium for every group and subgroup i analyze, and this premium is usually close to the overall 30-point average. this holds not just for standard characteristics but also for those directly related to marriage like children and sex and sex preference . i also find a cohabitation premium , but it is much smaller 10 points than the marital premium. the analysis is mainly visual, and there is inevitably some interesting variety across seventeen figures, such as a 5-point increase in recent years.",
    "preview": "the kids are not all right via mr reminder that humans, often the smartest humans, can believe anything. wonder how much of the coventional wisdom today falls in this category. two weeks after his bir...",
    "content": "\nThe Kids Are Not All Right via MR:   Reminder that humans, often the smartest humans, can believe anything. Wonder how much of the coventional wisdom today falls in this category. \n\nTwo weeks after his birth, Jeffrey’s health took a turn for the worse: He developed a heart defect common in premature infants – patent ductus arteriosus, or PDA. Jeffrey was scheduled for open-heart surgery and transferred to the nearest children’s hospital.\n\n\nIn those days, surgery for PDA was invasive. Holes were"
  },
  {
    "id": "links-15-mar-2025",
    "title": "Links: Week of Mar 15 2025",
    "url": "posts/2025/links-15-mar-2025.html",
    "date": "2025-03-15T00:00:00.000Z",
    "dateFormatted": "March 15, 2025",
    "excerpt": "1. [Australian man survives 100 days with artificial heart in world-first success](https://www.theguardian.com/australia-news/2025/mar/12/australian-m...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "heart",
      "man",
      "australian",
      "artificial",
      "world",
      "first",
      "more",
      "than",
      "nyt",
      "paywall",
      "china",
      "not",
      "100",
      "week",
      "days",
      "success",
      "become",
      "total",
      "implant",
      "behind",
      "blood",
      "can",
      "complete",
      "quot",
      "high",
      "speed",
      "rail",
      "leads",
      "trains",
      "want",
      "people",
      "smiths",
      "500",
      "2021",
      "2025",
      "3692",
      "links",
      "mar",
      "survives",
      "via",
      "nico",
      "mccarty",
      "failure",
      "person",
      "walk",
      "hospital",
      "researchers",
      "doctors",
      "operation",
      "announced"
    ],
    "searchableText": "australian man survives 100 days with artificial heart in world-first success via nico mccarty an australian man with heart failure has become the first person in the world to walk out of a hospital with a total artificial heart implant. the australian researchers and doctors behind the operation announced on wednesday that the implant had been an unmitigated clinical success after the man lived with the device for more than 100 days before receiving a donor heart transplant in early march. the bivacor total artificial heart, invented by queensland-born dr daniel timms, is the world s first implantable rotary blood pump that can act as a complete replacement for a human heart, using magnetic levitation technology to replicate the natural blood flow of a healthy heart. inflation expectations by political party affiliation entry 3692 in quot politics makes you stupid quot . broccoli, the man and vegetable behind the bond franchise what a story . the shift from a mindset of scarcity to one of abundance is overdue. nyt paywall the article itself has a strong partisan tone. i hope the book is different. in the time california has spent failing to complete its 500-mile high-speed rail system, china has built more than 23,000 miles of high-speed rail. china does not spend years debating with judges over whether it needs to move a storage facility. that power leads to abuse and imperiousness. it also leads to trains. i do not want america to become china. but i do want it to be able to build trains. some vegans were harmed in the watching of this movie nyt paywall even as a vegetarian, this seems over the top. people might think a glass of milk is innocuous, she said. it s not. it s full of violence. in search of a boring business nyt paywall on bizbuysell, the popular listings site where the rizzos found the smiths, corporate refugees ditching the 9-to-5 have surged to 42 percent of buyers, roughly double the 2021 figure. meanwhile, nearly a quarter of american small businesses are owned by people 65 and older, making the smiths part of a silver tsunami of sellers. cognitive security is now as important as basic literacy must read link of the week. between this stuff and use of ai in scams, i am more than a little scared. is this good or bad? policy can be hard.",
    "preview": "australian man survives 100 days with artificial heart in world-first success via nico mccarty an australian man with heart failure has become the first person in the world to walk out of a hospital w...",
    "content": "\nAustralian man survives 100 days with artificial heart in world-first success via Nico McCarty: \n\nAn Australian man with heart failure has become the first person in the world to walk out of a hospital with a total artificial heart implant.\n\n\nThe Australian researchers and doctors behind the operation announced on Wednesday that the implant had been an “unmitigated clinical success” after the man lived with the device for more than 100 days before receiving a donor heart transplant in early Mar"
  },
  {
    "id": "links-08-mar-2025",
    "title": "Links: Week of Mar 08 2025",
    "url": "posts/2025/links-08-mar-2025.html",
    "date": "2025-03-08T00:00:00.000Z",
    "dateFormatted": "March 8, 2025",
    "excerpt": "1. [James Harrison: The Man Who Saved 2.4 Million Babies](https://www.bbc.com/news/articles/c5y4xqe60gyo): Hall of Fame. \n2. Coincidentally, this week...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "hall",
      "games",
      "week",
      "who",
      "fame",
      "playing",
      "card",
      "clearly",
      "different",
      "2025",
      "links",
      "mar",
      "james",
      "harrison",
      "man",
      "saved",
      "million",
      "babies",
      "coincidentally",
      "both",
      "tyler",
      "cowen",
      "karthik",
      "shared",
      "memories",
      "kids",
      "today",
      "sister",
      "mentioned",
      "younger",
      "newphew",
      "started",
      "dungeons",
      "dragons",
      "recently",
      "played",
      "board",
      "boys",
      "especially",
      "covid",
      "fun",
      "more",
      "another",
      "entry",
      "sure",
      "come",
      "one",
      "guy",
      "legend",
      "way"
    ],
    "searchableText": "james harrison the man who saved 2.4 million babies hall of fame. coincidentally, this week both tyler cowen and karthik s shared memories of playing card games as kids. and then today my sister mentioned my younger newphew had started playing dungeons and dragons recently. we have played card games and board games with our boys, especially during covid and it was fun. clearly we should do more of this. another entry to the hall of fame. a different hall, sure, but come one, clearly this guy is a legend. a different way of learning math? via zvi , who belongs in a third hall. can 39 t fault him for lacking ambition but perhaps this is the rare tweet that should have been an article. a cheeto shaped like the pokemon charizard sells for nearly 90,000 . nyt paywall but do you really need to read anything else? honey on a razor blade something about the actual visualization struck a chord with me.",
    "preview": "james harrison the man who saved 2.4 million babies hall of fame. coincidentally, this week both tyler cowen and karthik s shared memories of playing card games as kids. and then today my sister menti...",
    "content": "\nJames Harrison: The Man Who Saved 2.4 Million Babies: Hall of Fame. \nCoincidentally, this week both Tyler Cowen and Karthik S shared memories of playing card games as kids. And then today my sister mentioned my younger newphew had started playing Dungeons and Dragons recently. We have played card games and board games with our boys, especially during COVID and it was fun. Clearly we should do more of this.  \nAnother entry to the hall of fame. A different hall, sure, but come one, clearly this g"
  },
  {
    "id": "links-01-mar-2025",
    "title": "Links: Week of Mar 01 2025",
    "url": "posts/2025/links-01-mar-2025.html",
    "date": "2025-03-01T00:00:00.000Z",
    "dateFormatted": "March 1, 2025",
    "excerpt": "1. [A.I. and Vibecoding Helped Me Create My Own Software](https://www.nytimes.com/2025/02/27/technology/personaltech/vibecoding-ai-software-programmin...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "not",
      "scene",
      "naked",
      "common",
      "years",
      "report",
      "most",
      "enough",
      "maybe",
      "actor",
      "actors",
      "time",
      "2006",
      "2012",
      "watch",
      "other",
      "see",
      "what",
      "bit",
      "complex",
      "one",
      "think",
      "how",
      "there",
      "nudity",
      "screen",
      "when",
      "imagine",
      "being",
      "quot",
      "2025",
      "links",
      "week",
      "mar",
      "vibecoding",
      "helped",
      "create",
      "own",
      "software",
      "limitation",
      "here",
      "imagination",
      "humanoid",
      "robots",
      "coming",
      "wild",
      "dogs",
      "stop",
      "paying",
      "good"
    ],
    "searchableText": "a.i. and vibecoding helped me create my own software the limitation here is my imagination. humanoid robots are coming. wild dogs will not stop me from paying good money for a bot that can iron and fold clothes. first world problem? nebraska man struggles to change daughter s name from unakite thirteen hotel . for two years. michelle trachtenberg i did not watch buffy or any of her other work but it is always depressing to see so many child celebrities die early deaths. this job is hazardous. to be clear cause of death is not known and i do not want to speculate. what struck me was this bit in the report in a 2012 interview with complex magazine, she recalled a scene in the 2006 film beautiful ohio, starring william hurt and rita wilson, that featured her naked tush. it was, she said, probably one of the most horrendous moments of my life. it would take an army or martin scorsese to ever get me naked again, she added. as a viewer, i almost never think about the person behind the character. sure if a christian bale loses nearly 30kg for a role, its visible enough and stark enough that one is forced to think about the how of it. but for the most part, i watch the program and move on. maybe if there is something really interesting or shocking, a comment to my so. so it is a jarring to see that the impact of a brief scene stuck with the actor for years after the fact. these days there is enough nudity on screen that most of us are desensitized to seeing it and i hope the actors are too, to performing them. even in 2006 or 2012, when maybe it was less common, i would not have imagined an actor, and especially an american 1 actor, would be so traumatized by such a scene. maybe it is because she grew up in a time when that was a much bigger deal that it was harder on her. perhaps actors like her were the trailblazers and paid a price and it is easier for actors now. it is, however, possible to imagine a possibility where being naked on screen is traumatizing, no matter how common and acceptable. according to claude, the quot being naked in public quot dream genre is common across cultures and age groups and more common in adoloscents. if that is the case i shudder to imagine the cost of all the content on netflix and other services in a few years time. the report also has a bit on another scene she was not happy about. and guess what? at the time and thankfully no longer , the report carried a photo from that scene. footnotes though, it turns out, america has a complex relationship with nudity and sexuality. who 39 da thunk!",
    "preview": "a.i. and vibecoding helped me create my own software the limitation here is my imagination. humanoid robots are coming. wild dogs will not stop me from paying good money for a bot that can iron and fo...",
    "content": "\nA.I. and Vibecoding Helped Me Create My Own Software: The limitation here is my imagination. \n\nHumanoid Robots are coming. Wild dogs will not stop me from paying good money for a bot that can iron and fold clothes. \n\nFirst world problem?: Nebraska Man Struggles to Change Daughter’s Name From ‘Unakite Thirteen Hotel’. For two years. \n\nMichelle Trachtenberg: I did not watch Buffy or any of her other work but it is always depressing to see so many child celebrities die early deaths. This job is ha"
  },
  {
    "id": "a-few-thoughts-on-llms",
    "title": "A few thoughts on LLMs",
    "url": "posts/2025/a-few-thoughts-on-llms.html",
    "date": "2025-03-01T00:00:00.000Z",
    "dateFormatted": "March 1, 2025",
    "excerpt": "I need to sit down and combine some of these thoughts into a coherent piece but for now, I just want to dump  it all here for reference later. I doubt...",
    "type": "notes",
    "tags": [
      "post",
      "LLM"
    ],
    "keywords": [
      "llm",
      "quot",
      "content",
      "llms",
      "all",
      "market",
      "than",
      "one",
      "context",
      "can",
      "become",
      "data",
      "thoughts",
      "need",
      "combine",
      "some",
      "any",
      "high",
      "create",
      "product",
      "lots",
      "window",
      "experience",
      "model",
      "more",
      "going",
      "training",
      "start",
      "amp",
      "good",
      "few",
      "sit",
      "coherent",
      "piece",
      "now",
      "just",
      "want",
      "dump",
      "here",
      "reference",
      "later",
      "doubt",
      "original",
      "certainly",
      "seen",
      "elsewhere",
      "structure",
      "makers",
      "may",
      "end"
    ],
    "searchableText": "i need to sit down and combine some of these thoughts into a coherent piece but for now, i just want to dump it all here for reference later. i doubt any of these are original and i have certainly seen some elsewhere. market structure for llm makers may end up being like the airline market. high fixed cost to set up, hard to create a product differentiation that users care about other than price , lots of competitors entering, at least in part due to the quot prestige quot of owning one. lots of utility for consumers but hardly any profit for producers. an llm with an infinite context window, one that can contain all my life, will be an entirely different product than an llm with a limited context window. you can never have enough when it comes to context windows. notwithstanding 1, quot personality quot makes a huge difference in the experience of working with an llm and the ability to create the right one could determine whether a model can dominate a market or a niche. claude sonnet 3.5 absolutely had than special sauce in my experience. we need a lot more of it. this. i don t see how we re going to avoid a situation where the internet become lousy with ai-created, pseudo academic writing filled with made up facts and quotes, which will then get cemented into knowledge as those articles become the training fodder for future models. but combine it with the fact that if we all start getting our answers from llms, the online content amp ad based business model goes caput and then what is the incentive for people to put up good content on the web? none. but anyone who has good proprietary, verified, high-quality data amp content will potentially control the value for the customer even as base llms become a commodity. therefore does more data and content start going behind the paywall? if it doesn 39 t it becomes training data and cannot be monetized.",
    "preview": "i need to sit down and combine some of these thoughts into a coherent piece but for now, i just want to dump it all here for reference later. i doubt any of these are original and i have certainly see...",
    "content": "I need to sit down and combine some of these thoughts into a coherent piece but for now, I just want to dump  it all here for reference later. I doubt any of these are original and I have certainly seen some elsewhere. \n\nMarket structure for LLM makers may end up being like the airline market. High fixed cost to set up, hard to create a product differentiation that users care about (other than price), lots of competitors entering, at least in part due to the &quot;prestige&quot; of owning one. L"
  },
  {
    "id": "links-23-feb-2025",
    "title": "Links: Week of Feb 23 2025",
    "url": "posts/2025/links-23-feb-2025.html",
    "date": "2025-02-23T00:00:00.000Z",
    "dateFormatted": "February 23, 2025",
    "excerpt": "1. [50 years of Travel Tips](https://kk.org/thetechnium/50-years-of-travel-tips/): Some great tips. \n    >For the best travel experiences you need eit...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "time",
      "real",
      "money",
      "can",
      "much",
      "llms",
      "right",
      "some",
      "lot",
      "world",
      "don",
      "think",
      "how",
      "using",
      "matters",
      "there",
      "2025",
      "week",
      "travel",
      "tips",
      "great",
      "need",
      "more",
      "what",
      "understand",
      "one",
      "without",
      "hiv",
      "prevention",
      "now",
      "systems",
      "even",
      "fun",
      "thing",
      "genius",
      "why",
      "quot",
      "work",
      "prompt",
      "engineering",
      "however",
      "post",
      "consensus",
      "projections",
      "still",
      "talent",
      "everyone",
      "100",
      "2035",
      "links"
    ],
    "searchableText": "50 years of travel tips some great tips. for the best travel experiences you need either a lot of money, or a lot of time. of the two modes, it is far better to have more time than money. although it tries, money cannot buy what time delivers. you have enough time to attend the rare festival, to learn some new words, to understand what the real prices are, to wait out the weather, or to get to that place that takes a week in a jeep. time is the one resource you can give yourself, so take advantage of this if you are young without money. 100 hiv prevention ...we now have evidence that in real-world use it can do something that has never been seen before twice-yearly injections in thousands of female trial volunteers in high-risk areas south africa and uganda showed a one hundred per cent prevention rate of hiv infection. stable systems x i don t think a lot of people appreciate how much of their overall lifestyle and relative certainty is backstopped by a steady, boring stability of systems they don t understand or even realize exist. ai or no i x me using llms for fun little personal projects wow this thing is such a genius why do we even need humans anymore. me trying to deploy llms in messy real-world environments why is this thing so unbelievably stupid and dumb. this fits with my experience. but also for doing quot real quot work, prompt engineering matters. giving the right instructions in the right order does make a difference. see more scepticism in this thread . along with some of the comments i am hearing satya nadella made in his podcast with dwarkesh , i wonder if we are seeing a vibe shift on ai? my llm codegen workflow atm via i have been building so many small products using llms. it has been fun, and useful. however, there are pitfalls that can waste so much time. a while back a friend asked me how i was using llms to write software. i thought oh boy. how much time do you have! and thus this post. again, for real work, prompt engineering matters. consensus projections on ai x i think grok 3 came in right at expectations, so i don 39 t think there is much to update in terms of consensus projections on ai still accelerating development, speed is a moat, compute still matters, no obvious secret sauce to making a frontier model if you have talent amp chips. three observations obligatory link to every sam altman post. anyone in 2035 should be able to marshall the intellectual capacity equivalent to everyone in 2025 everyone should have access to unlimited genius to direct however they can imagine. there is a great deal of talent right now without the resources to fully express itself, and if we change that, the resulting creative output of the world will lead to tremendous benefits for us all.",
    "preview": "50 years of travel tips some great tips. for the best travel experiences you need either a lot of money, or a lot of time. of the two modes, it is far better to have more time than money. although it ...",
    "content": "\n50 years of Travel Tips: Some great tips. \n\nFor the best travel experiences you need either a lot of money, or a lot of time. Of the two modes, it is far better to have more time than money. Although it tries, money cannot buy what time delivers. You have enough time to attend the rare festival, to learn some new words, to understand what the real prices are, to wait out the weather, or to get to that place that takes a week in a jeep. Time is the one resource you can give yourself, so take adv"
  },
  {
    "id": "links-9-feb-2025",
    "title": "Links: Week of Feb 09 2025",
    "url": "posts/2025/links-9-feb-2025.html",
    "date": "2025-02-09T00:00:00.000Z",
    "dateFormatted": "February 9, 2025",
    "excerpt": "1. [Translating with LLMs](https://news.ycombinator.com/item?id=42897856): A fantastic guide from a professional translator on how he is using LLMs to...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "brother",
      "more",
      "can",
      "hard",
      "not",
      "than",
      "stranger",
      "saving",
      "llms",
      "how",
      "never",
      "things",
      "thing",
      "professional",
      "day",
      "ask",
      "just",
      "wisdom",
      "computer",
      "https",
      "com",
      "thought",
      "tarriffs",
      "dad",
      "gay",
      "now",
      "when",
      "one",
      "value",
      "life",
      "any",
      "real",
      "say",
      "five",
      "million",
      "concede",
      "great",
      "all",
      "2025",
      "links",
      "week",
      "feb",
      "translating",
      "fantastic",
      "guide",
      "translator",
      "using",
      "job",
      "better",
      "queries"
    ],
    "searchableText": "translating with llms a fantastic guide from a professional translator on how he is using llms to do his job better. for my day to day queries, i simply ask claude, like i would ask a colleague or a friend and it just works. but for professional work, correctly prompting the llms improves the quality of output significantly. i hope to find and create more such examples. wisdom a computer can never be held accountable. therefore a computer must never make a management decision 3. wisdom ii https x.com gergelyorosz status 1887813676972851577 a lot of ai cheerleading takes this form https ghuntley.com dothings . yes, you can just do things. i have also thought and posted along those lines. but as gergely points out, the hard thing in building a payment system is not the code - its fraud, aml, kyc, tax, reporting, reconcilliation... that is true for most other hard things too. the hard thing in pharma is not finding the compound but getting the trials and approvals done. the hard thing in politics in not the manifesto but the consensus. tarriffs and modern supply chains tarriffs are more disruptive than i thought. how my dad reconciled his god and his gay son beautiful. this is me with my dad, bill white. for decades, he has been an evangelical pastor. before i was born, he wrote a letter to my future wife. he didn t know what we both do now that i m gay. when i came out nearly 16 years later, it shook his faith and fractured his church. but it never separated us. i wanted to understand how. so i read his journals. strongly endorse one of the reasons making things is satisfying is that it 39 s a concrete demonstration of the notion that you can have some amount of control over your environment and circumstances. passive media consumption is the opposite of that. should you value the life of your brother more than that of a stranger? but again, this is a distraction from any real issue! oh, you should value the life of your brother more than a stranger? you don t say? i m hearing this for the first time! now let s kill five million foreign children to fund one sixth of a broadband boondoggle. i am happy to concede that if you face a choice between saving a stranger and saving your brother, save your brother! or your cousin, or your great-uncle, or your seven-times-great-grand-nephew-twice-removed. i ll concede all of this, immediately, because it s all fake none of your relatives were ever in any danger. the only point of this whole style of philosophical discussion is so that you can sound wise as you say ah, but is not saving your brother more important than saving a complete stranger? then sentence five million strangers to death for basically no benefit while your brother continues to be a successful real estate agent in des moines. when will i be able to write so well?",
    "preview": "translating with llms a fantastic guide from a professional translator on how he is using llms to do his job better. for my day to day queries, i simply ask claude, like i would ask a colleague or a f...",
    "content": "\nTranslating with LLMs: A fantastic guide from a professional translator on how he is using LLMs to do his job better. \n For my day to day queries, I simply ask Claude, like I would ask a colleague or a friend and it just works. But for professional work, correctly prompting the LLMs improves the quality of output significantly. I hope to find (and create) more such examples. \n\nWisdom:\n\n\n\n    \n    A computer can never be held accountable. Therefore a computer must never make a management decisio"
  }
]