[
  {
    "id": "links-10-jan-2026",
    "title": "Links: Weeks of 10 Jan 2026 - The Vibe Shift",
    "url": "posts/2026/links-10-jan-2026.html",
    "date": "2026-01-03T00:00:00.000Z",
    "dateFormatted": "January 3, 2026",
    "excerpt": "For the last 2-3 weeks I had been noticing a \"vibe-shift\" about a jump in the abilities of the leading LLMs. This week that conversation took center s...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "everything",
      "code",
      "now",
      "can",
      "claude",
      "what",
      "not",
      "why",
      "weeks",
      "all",
      "oscar",
      "young",
      "more",
      "one",
      "just",
      "must",
      "use",
      "coming",
      "robotics",
      "data",
      "2015",
      "links",
      "vibe",
      "shift",
      "last",
      "quot",
      "abilities",
      "conversation",
      "using",
      "two",
      "break",
      "curse",
      "nyt",
      "unfair",
      "voters",
      "best",
      "men",
      "almost",
      "always",
      "see",
      "reagan",
      "washington",
      "national",
      "personal",
      "panopticon",
      "kept",
      "working",
      "first",
      "time",
      "how"
    ],
    "searchableText": "for the last 2-3 weeks i had been noticing a quot vibe-shift quot about a jump in the abilities of the leading llms. this week that conversation took center stage as many blog posts and tweets raving about the enhanced abilities of claud code, especially when using the command line interfact went viral. i have not had the chance to test it out myself, as i am pre-occupied with the family 39 s upcoming relocation. however, after that, this is top of the list for me now and all links but two below are on this topic. i recommend everyone go down this rabbit hole. can timoth e chalamet break this oscar curse? nyt woke comes full-circle with nyt worrying about unfair treatment of young, white, male actors? for nearly a century, oscar voters have been reluctant to hand the best-actor prize to young men, almost always opting to reward more seasoned performers. though oscar voters have no qualms about rewarding young actresses, they traditionally want to see more mileage on their men. the tyranny of the complainers in 2015, for example, 6,852 of the 8,760 complaints submitted to ronald reagan washington national airport originated from one residence in the affluent foxhall neighborhood of northwest washington, dc. the residents of that particular house called reagan national to express irritation about aircraft noise an average of almost 19 times per day during 2015. a personal panopticon via mr a great summary. a few months ago, i started running my life out of claude code. not out of intention to do so, it was just the place where everything met. and it just kept working. empires are won by conquest. what keeps them standing is something much quieter. before a king can tax, he must count. before he can conscript, he must locate. before he can rule, he must see. legibility is the precondition for governance the first thing claude solved was product blindness. nox now runs on a cron job pulling amplitude, cross-referencing github, and pointing me to what needs building. it handles a b testing, generates winning copy, and has turned customer support into a fully autonomous department. once i saw this was possible, i chased it everywhere. email, hitting inbox zero for the first time ever, with auto-drafted replies for everything inbound. workouts, accommodating horrendously erratic travel schedules. sleep, built a projector wired to my whoop after exactly six hours that wakes me with my favorite phrases. subscriptions, found and returned 2000 i didn t know i was paying. the dozen sfmta citations i d ignored, the action items i d procrastinated into oblivion. people are using it to, i discovered, run vending machines, home automation systems, and keep plants alive. the feeling is hard to name. it is the violent gap between how blind you were and how obvious everything feels now with an observer that reads all the feeds, catches what you ve unconsciously dropped, notices patterns across domains you d kept stubbornly separate, and crucially tells you what to do about it. my personal finances are now managed in the terminal. overnight it picks the locks of brokerages that refuse to talk to each other, pulls congressional and hedge fund disclosures, polymarket odds, x sentiment, headlines and 10-ks from my watchlist. every morning, a brief gets added in . last month it flagged rep. fields buying nflx shares. three weeks later, the warner bros deal. i don t always trade, sometimes i argue with the thesis. but i m never tracking fifteen tabs at 6am anymore. it feels borderline unfair seeing around corners, being in ten places at once, surveilling yourself with the attention span of a thousand clones. a panopticon still, but the tower belongs to you. claude codes the definitive guide to the developments and the conversation, including some useful guides. claude code with opus 4.5 is so hot right now. the cool kids use it for everything. they definitely use it for coding, often letting it write all of their code. they also increasingly use it for everything else one can do with a computer. toby lutke, founder amp ceo, spotify do endorsments come any stronger than this? claude code tutorials not tried. saving here for later. among the agents examples and implications. andrej karpathy don 39 t worry if you feel you are behind. so does andrej and he 39 s among the best out there. self-driving cars the robots are coming too. what a time. the final offshoring more on robots. thus, why should the future be any different? why should one expect a sudden, dramatic wave of robotics working not just in the coming decade, but the coming handful of years? why should the curse of moravec s paradox suddenly break? the standard answer a savvy technologist would give is that increasingly capable ai video and world models will serve as a base, providing real-world understanding, while deployments, whether through teleoperation, data gloves, or egocentric capture, will generate an additional data flywheel. this has already led to interesting emergent behaviors absorbing egocentric data, tactile sensing, and generalization across environments. and we re about to scale everything up by 100x. long robotics. things will be big soon. i think this is mostly correct, but let me add some nuance around both why to be bullish and two of the challenges that robotics faces today.",
    "preview": "for the last 2-3 weeks i had been noticing a quot vibe-shift quot about a jump in the abilities of the leading llms. this week that conversation took center stage as many blog posts and tweets raving ...",
    "content": "For the last 2-3 weeks I had been noticing a &quot;vibe-shift&quot; about a jump in the abilities of the leading LLMs. This week that conversation took center stage as many blog posts and tweets raving about the enhanced abilities of Claud Code, especially when using the command line interfact went viral. I have not had the chance to test it out myself, as I am pre-occupied with the family&#39;s upcoming relocation. However, after that, this is top of the list for me now and all links but two be"
  },
  {
    "id": "links-03-jan-2026",
    "title": "Links: Weeks of 03 Jan 2026",
    "url": "posts/2026/links-03-jan-2026.html",
    "date": "2026-01-03T00:00:00.000Z",
    "dateFormatted": "January 3, 2026",
    "excerpt": "1. [‘I Was Just So Naïve’: Inside Marjorie Taylor Greene’s Break With Trump](https://www.nytimes.com/2025/12/29/magazine/marjorie-taylor-greene-trump-...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "quot",
      "like",
      "just",
      "new",
      "year",
      "people",
      "started",
      "more",
      "career",
      "japan",
      "guide",
      "great",
      "surnamed",
      "well",
      "day",
      "timeline",
      "making",
      "never",
      "what",
      "social",
      "media",
      "life",
      "1986",
      "1999",
      "2000",
      "2026",
      "links",
      "weeks",
      "jan",
      "inside",
      "marjorie",
      "taylor",
      "greene",
      "break",
      "trump",
      "starting",
      "revelation",
      "can",
      "surprise",
      "charlie",
      "died",
      "realized",
      "part",
      "toxic",
      "culture",
      "really",
      "looking",
      "faith",
      "wanted",
      "christ"
    ],
    "searchableText": "i was just so na ve inside marjorie taylor greene s break with trump starting the new year with a revelation - people can surprise you. quot after charlie died, i realized that i m part of this toxic culture. i really started looking at my faith. i wanted to be more like christ. kazuyoshi miura, 58, signs with new club to extend record-breaking soccer career - the athletic he s known as king kazu in japan and has played 40 professional seasons dating back to the mid-1980s. he started in brazil s serie a, the country s top division, with santos in 1986. he has had brief, varying spells abroad over the course of his career, in australia, italy, and croatia, all before 2000, when he returned to japan for good, firstly with kyoto purple sanga in 1999. beginner s guide to the mahabharata and ramayana do you desire to know the stories of india s two great epics, but are intimidated by the massive tomes with hundreds of characters and thousands of pages full of sentences like this ugrasrava, the son of lomaharshana, surnamed sauti, well-versed in the puranas, bending with humility, one day approached the great sages of rigid vows, sitting at their ease, who had attended the twelve years sacrifice of saunaka, surnamed kulapati, in the forest of naimisha. well if so, i ve got just the guide for you! the prison of financial mediocrity i saw this a fair bit on my timeline. the response in the tweet below makes a lot more sense to me though. a 25-year-old making 70k is constantly fed content from people their age making 2mn, living in bali, quot working quot four hours a day. the baseline for quot enough quot keeps moving. you never catch up. no matter what you achieve, social media will show you what you 39 re missing. the spread between your life and the life you quot should quot have is maintained algorithmically, forever uncollapsible. so you have ai shrinking your timeline and social media ensuring you never feel like you 39 ve arrived. the pressure to escape, now, fast, before it 39 s too late, compounds daily. 5. 6. 7.",
    "preview": "i was just so na ve inside marjorie taylor greene s break with trump starting the new year with a revelation - people can surprise you. quot after charlie died, i realized that i m part of this toxic ...",
    "content": "\n‘I Was Just So Naïve’: Inside Marjorie Taylor Greene’s Break With Trump: Starting the new year with a revelation - people can surprise you. \n\n&quot;“After Charlie died, I realized that I’m part of this toxic culture. I really started looking at my faith. I wanted to be more like Christ.”\n\n\nKazuyoshi Miura, 58, signs with new club to extend record-breaking soccer career - The Athletic: \n\nHe’s known as “King Kazu” in Japan and has played 40 professional seasons dating back to the mid-1980s. He st"
  },
  {
    "id": "links-20-28-dec",
    "title": "Links: Weeks of 20 & 27 Dec 2025",
    "url": "posts/2025/links-20-28-dec.html",
    "date": "2025-12-27T00:00:00.000Z",
    "dateFormatted": "December 27, 2025",
    "excerpt": "A long one to mark a year of link posts. Starting with feel-good stories for the festive season....",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "year",
      "how",
      "new",
      "who",
      "people",
      "one",
      "read",
      "london",
      "every",
      "resolution",
      "women",
      "can",
      "instead",
      "teach",
      "still",
      "old",
      "than",
      "reading",
      "not",
      "library",
      "across",
      "think",
      "didn",
      "jobs",
      "most",
      "what",
      "long",
      "link",
      "good",
      "best",
      "much",
      "space",
      "another",
      "couple",
      "get",
      "india",
      "where",
      "experience",
      "main",
      "branch",
      "more",
      "books",
      "claude",
      "guide",
      "man",
      "gift",
      "smiles",
      "life",
      "time",
      "work"
    ],
    "searchableText": "a long one to mark a year of link posts. starting with feel-good stories for the festive season. the best story you ll read this christmas. truly. your social muscles are wasting away. here is how to retrain them. everything old is new again and the search for connection is timeless. i m a married 41-year-old woman who lives with housemates by choice. rather than trying to acquire as much space and privacy as we could as quickly as we could, my husband and i decided to do the opposite. parenting in our mid-30s, bursting out of our small london flat, we rented and then bought a london home with another couple. sisters in sweat a couple years ago i played soccer every saturday morning, for about a year. great memories. i get this. new year resolution. sis has become a lifeline for thousands of women like almeida in india, helping build a rare space where sport turns into an experience of liberation and camaraderie. how i read i have stopped reading long form for a while, so i am a sucker for these guides. not a new year resolution though. one of the many joys of living in new york city is the library system. the performing arts library and stavros niarchos foundation library on fifth ave across from the main branch are both delightful places to spend a few hours in manhattan, and in brooklyn i spent more than my fair share of afternoons at the grand army plaza main branch. i pick a section and walk the shelves until i get hungry, thirsty, or under-caffeinated. i count ai summarized books as read possibly a new year resolution. i upload books to claude and ask it to comprehensively and engagingly summarize and fact-check, writing in malcolm gladwell s style, the book . i can read it in an hour instead of twelve. four bullet points instead of forty. with this surprised me roughly the same number of insights i actually do something with. ruby 39 s ultimate guide to thoughtful gifts new year resolution?? who am i kidding? give a man a gift and he smiles for a day. teach a man to gift and he ll cause smiles for the rest of his life. the lost generation tough reading. at the time, i blamed those women. of course i did. they ve since ascended the tv ladder and work as co-executive producers on major shows. on some level, even today i can t help but think that could have been me. that should have been me. but those women didn t take our jobs any more than the 50-year-old hollywood lifers had. the lifers were still there. they re still there. and i m not angry at the women and people of color who made it instead of me people have the right, in most cases the responsibility, to take the opportunities that are offered them or even at the older white guys who ensured that i didn t. paranoia a beginner 39 s guide worth reading just for the first line. people sometimes make mistakes. citation needed chemical hygiene a good follow up to the previous link? how did the c.i.a. lose a nuclear device? where else but in india? a plutonium-packed generator disappeared on one of the world s highest mountains in a hush-hush mission the u.s. still won t talk about. castration increases lifespan across vertebrates or at least, it feels longer. pedagogy recommendations i think the single most thing important i can say is this every time you are inclined to use the word teach , replace it with learn . that is, instead of saying, i teach , say they learn . it s very easy to determine what you teach you can just fill slides with text and claim to have taught. shift your focus to determining how you know whether they learned what you claim to have taught or indeed anything at all! . that is much harder, but that is also the real objective of any educator. how google maps quietly allocates survival across london s restaurants it 39 s amazing the rabbit holes people will go down. i needed a restaurant recommendation, so i did what every normal person would do i scraped every single restaurant in greater london and built a machine-learning model. i didn 39 t think the current llms could solve quot out-of-sample quot problems, ones that are not in their training set. but i was wrong . and another one . these are hard problems from the looks of it. automate your life with claude code copywriters reveal how ai has decimated their industry it is coming for the white-collar jobs. ai is really dehumanizing, and i am still working through issues of self-worth as a result of this experience. when you go from knowing you are valuable and valued, with all the hope in the world of a full career and the ability to provide other people with jobs... to being relegated to someone who edits ai drafts of copy at a steep discount because most of the work is already done ... a curated list of the best finance blogs, tools, and webpages.",
    "preview": "a long one to mark a year of link posts. starting with feel-good stories for the festive season. the best story you ll read this christmas. truly. your social muscles are wasting away. here is how to ...",
    "content": "A long one to mark a year of link posts. Starting with feel-good stories for the festive season. \n\nThe best story you’ll read this Christmas. Truly.\n\n\n  \n    \n  \n\n\n\nYour Social Muscles Are Wasting Away. Here Is How to Retrain Them.: Everything old is new again and the search for connection is timeless. \n\nI’m a married 41-year-old woman who lives with housemates by choice. Rather than trying to acquire as much space and privacy as we could as quickly as we could, my husband and I decided to do th"
  },
  {
    "id": "links-13-dec-2025",
    "title": "Links: Week of 13 Dec 2025",
    "url": "posts/2025/links-13-dec-2025.html",
    "date": "2025-12-13T00:00:00.000Z",
    "dateFormatted": "December 13, 2025",
    "excerpt": "1. [The Reverse-Centaur’s Guide to Criticizing AI](https://pluralistic.net/2025/12/05/pop-that-bubble/): \n    > Over the summer I wrote a book about w...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "wrote",
      "book",
      "what",
      "which",
      "article",
      "rebuttals",
      "reverse",
      "centaur",
      "guide",
      "think",
      "criticism",
      "more",
      "how",
      "critic",
      "quot",
      "most",
      "going",
      "philosophy",
      "lectures",
      "youtube",
      "home",
      "can",
      "free",
      "one",
      "poverty",
      "many",
      "people",
      "both",
      "2025",
      "2026",
      "links",
      "week",
      "dec",
      "criticizing",
      "summer",
      "really",
      "specifically",
      "good",
      "mean",
      "whose",
      "inflicts",
      "maximum",
      "damage",
      "parts",
      "doing",
      "harm",
      "titled",
      "life",
      "farrar",
      "straus"
    ],
    "searchableText": "the reverse-centaur s guide to criticizing ai over the summer i wrote a book about what i think about ai, which is really about what i think about ai criticism, and more specifically, how to be a good ai critic. by which i mean quot how to be a critic whose criticism inflicts maximum damage on the parts of ai that are doing the most harm. quot i titled the book the reverse centaur 39 s guide to life after ai, and farrar, straus and giroux will publish it in june, 2026. but you don 39 t have to wait until then because i am going to break down the entire book 39 s thesis for you tonight, over the next 40 minutes. i am going to talk fast. the best philosophy lectures on youtube platforms like youtube are the home of most slop, but they are also home to some fantastic educational content. i ve compiled a list of philosophy lectures which you can enjoy, free of charge, to further your philosophical education. everyone is gambling and no one is happy a few weeks ago, michael green wrote an article stating that 140k is the new poverty line, that no one can afford to participate in society. it took over the internet in a fiery storm. there have been many rebuttals, from tyler cowen to jeremy horpedahl. but the reaction to the piece was very interesting, as john burn murdoch wrote about. people overwhelmingly agreed with the article many of the rebuttals to the rebuttals were who cares if the math is wrong, the vibe is correct! . both more perfect union and the free press republished it. people on both sides of the aisle, read the article and said well, yes, that is why things feel so bad. this is poverty. my economic pain is justified by the data now. what a relief. tangled parachute leaves skydiver hanging from plane nyt video at the link.",
    "preview": "the reverse-centaur s guide to criticizing ai over the summer i wrote a book about what i think about ai, which is really about what i think about ai criticism, and more specifically, how to be a good...",
    "content": "\nThe Reverse-Centaur’s Guide to Criticizing AI: \n\nOver the summer I wrote a book about what I think about AI, which is really about what I think about AI criticism, and more specifically, how to be a good AI critic. By which I mean: &quot;How to be a critic whose criticism inflicts maximum damage on the parts of AI that are doing the most harm.&quot; I titled the book The Reverse Centaur&#39;s Guide to Life After AI, and Farrar, Straus and Giroux will publish it in June, 2026.\n\n\n\nBut you don&#39"
  },
  {
    "id": "links-06-dec-2025",
    "title": "Links: Week of 06 Dec 2025",
    "url": "posts/2025/links-06-dec-2025.html",
    "date": "2025-12-07T00:00:00.000Z",
    "dateFormatted": "December 7, 2025",
    "excerpt": "1. [Humans killed millions of vultures. Now people are paying the price. (WaPo)](https://wapo.st/3Kwgm3S): So many unexpected links and unintended con...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "who",
      "human",
      "students",
      "time",
      "funny",
      "vultures",
      "animals",
      "because",
      "accommodation",
      "more",
      "accommodations",
      "some",
      "same",
      "extra",
      "can",
      "organ",
      "rabies",
      "nyt",
      "not",
      "bubl",
      "there",
      "kit",
      "kat",
      "2025",
      "links",
      "humans",
      "killed",
      "people",
      "many",
      "other",
      "year",
      "percent",
      "disabled",
      "course",
      "emotional",
      "one",
      "student",
      "told",
      "class",
      "most",
      "what",
      "suicide",
      "since",
      "like",
      "recipients",
      "said",
      "treatment",
      "perlman",
      "love",
      "how"
    ],
    "searchableText": "humans killed millions of vultures. now people are paying the price. wapo so many unexpected links and unintended consequences. although other animals scavenge dead cattle, none do so as effectively as vultures. the birds will pick ovedthoughts clean a bull carcass in 30 to 40 minutes. a paper published a year ago in the american economic review concluded that in certain districts, the functional extinction of vultures efficient scavengers who removed carcasses from the environment increased human mortality by over 4 because of a large negative shock to sanitation. accommodation nation at brown and harvard, more than 20 percent of undergraduates are registered as disabled. at amherst, that figure is 34 percent. the types of accommodations vary widely. some are uncontroversial, such as universities outfitting buildings with ramps and providing course materials in braille. these allow disabled students to access the same opportunities as their classmates. some students get approved for housing accommodations, including single rooms and emotional-support animals. other accommodations risk putting the needs of one student over the experience of their peers. one administrator told me that a student at a public college in california had permission to bring their mother to class. this became a problem, because the mom turned out to be an enthusiastic class participant. professors told me that the most common and most contentious accommodation is the granting of extra time on exams. for students with learning disabilities, the extra time may be necessary to complete the test. but unlike a wheelchair ramp, this kind of accommodation can be exploited. research confirms what intuition suggests extra time can confer an advantage to students who don t have a disability. 52 things i learned in 2025 global suicide rates have declined by 29 since 2000, due to measures like pesticide bans, more responsible media reporting of suicide, mental health education in schools and improved healthcare responses. kidney recipient dies after transplant from organ donor who had rabies nyt when its your time... since 1978, four organ donors have passed rabies to 13 organ recipients, the report said. of the 13 recipients, six who received treatment for rabies survived. the seven others, who did not receive treatment, died. bubl for a day, but he can t sing and there s little resemblance nyt any outcome is funny, perlman, 36, said in an interview. if they hate me, it s funny. if they re confused, it s funny. if they love me, it s funny. and my ego is not wrapped up in the idea of being the best michael bubl impersonator, so there s some freedom in that. after the performance, perlman was astonished as people approached him for autographs and photos. he riffed about his christmas special, his children and his love of canada, and assured a handful of skeptics that, yes, he was the real bubl . how kit kat was killed video shows what a robot taxi couldn t see nyt both the points below are correct but do they belong in the same paragraph? of course, ms. brigman is right that kit kat might still be alive if there was a human driver behind the wheel of that car, but how many more cats and humans will die and be injured because the emotional response to incidents like these delays the adoption of self-driving cars? the response to this accident will make every waymo better . the same is not true of accidents with human drivers. those who defend waymo taxis have pointed out that human drivers kill hundreds of animals each year in san francisco. but ms. brigman believes that kit kat might still be alive if a human had been behind the wheel that october night.",
    "preview": "humans killed millions of vultures. now people are paying the price. wapo so many unexpected links and unintended consequences. although other animals scavenge dead cattle, none do so as effectively a...",
    "content": "\nHumans killed millions of vultures. Now people are paying the price. (WaPo): So many unexpected links and unintended consequences. \n\nAlthough other animals scavenge dead cattle, none do so as effectively as vultures. The birds will pick ovedthoughts\n clean a bull carcass in 30 to 40 minutes.\n\n\n\nA paper published a year ago in the American Economic Review concluded that in certain districts, “the functional extinction of vultures — efficient scavengers who removed carcasses from the environment "
  },
  {
    "id": "links-29-nov-2025",
    "title": "Links: Week of 29 Nov 2025",
    "url": "posts/2025/links-29-nov-2025.html",
    "date": "2025-11-29T00:00:00.000Z",
    "dateFormatted": "November 29, 2025",
    "excerpt": "1. [How to Fix a Typewriter and Your Life](https://www.nytimes.com/interactive/2025/11/20/us/typewriter-repair-seattle-bremerton.html?rsrc=flt&unlocke...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "gas",
      "story",
      "exercise",
      "life",
      "what",
      "montgomery",
      "read",
      "how",
      "one",
      "seattle",
      "found",
      "typewriters",
      "much",
      "not",
      "told",
      "munger",
      "years",
      "end",
      "election",
      "group",
      "researchers",
      "fart",
      "walk",
      "experimental",
      "even",
      "mild",
      "around",
      "scientists",
      "infused",
      "rest",
      "amount",
      "than",
      "2014",
      "2025",
      "links",
      "week",
      "nov",
      "fix",
      "typewriter",
      "sunday",
      "morning",
      "opened",
      "times",
      "feature",
      "bob",
      "age",
      "known",
      "friends",
      "customers",
      "locals"
    ],
    "searchableText": "how to fix a typewriter and your life what a story. one sunday morning in 2014, he opened the seattle times and found a feature story about bob montgomery, age 92, known to friends, customers and locals simply as mr. montgomery. the article read like an obituary for a vanishing trade fixing typewriters suggesting that when mr. montgomery went, seven decades of expertise would vanish into the digital ether. lundy read it once, then a second time. he had never given old typewriters much thought, but something stirred in him that he could not quite name. he showed the story to his wife, lisa. i think this might be it, he told her. the next weekend, he drove to bremerton, a weary naval town an hour s ferry ride away and a world apart from gleaming, digitized seattle. the untold story of charlie munger s final years what a life. near the end of life, munger leaned on humor for strength. he told family members that diet coke was responsible for his longevity, lightening the mood. and he shared a wish with a visitor. oh, to be 86 again, he said. cryptographers held an election. they can t decrypt the results. a global group of researchers was unable to read the vote tally, after an official lost one of three secret code keys needed to unlock a hyper-secure election system. ai in education? try a fart walk to ease the pressure after that big thanksgiving meal nominate for the ignobel prize. walking to relieve bloating and gas had long been advocated by doctors, but for years, we had no real experimental proof that it works. so in the mid-2000s, researchers from barcelona decided to end the speculation and test whether even mild exercise could propel gas forward and outward. the group first looked at healthy volunteers who pedaled on an adapted bicycle going at the equivalent of around 7 mph. the scientists infused gas into the people s small intestines mimicking what happens with meals and then measured how much gas was expelled both during exercise and at rest. at rest, the result was a net gain in gas. not fun. but after exercise? things got juicy. after short bursts of mild physical activity, the scientists found that the amount of gas evacuated was greater than the amount infused. exercise forced the removal of the added experimental gas and then some meaning, it also pushed out gas hanging around even at baseline. so after a fart walk, you ll be better off than you started.",
    "preview": "how to fix a typewriter and your life what a story. one sunday morning in 2014, he opened the seattle times and found a feature story about bob montgomery, age 92, known to friends, customers and loca...",
    "content": "\nHow to Fix a Typewriter and Your Life: What a story. \n\nOne Sunday morning in 2014, he opened The Seattle Times and found a feature story about Bob Montgomery, age 92, known to friends, customers and locals simply as Mr. Montgomery. The article read like an obituary for a vanishing trade — fixing typewriters — suggesting that when Mr. Montgomery went, seven decades of expertise would vanish into the digital ether.\n\n\n\nLundy read it once, then a second time. He had never given old typewriters much"
  },
  {
    "id": "links-15-22-nov-2025",
    "title": "Links: Weeks of 15 & 22 Nov 2025",
    "url": "posts/2025/links-15-22-nov-2025.html",
    "date": "2025-11-22T00:00:00.000Z",
    "dateFormatted": "November 22, 2025",
    "excerpt": "1. [The Algorithmic Turn: The Emerging Evidence On AI Tutoring That's Hard to Ignore](https://carlhendrick.substack.com/p/the-algorithmic-turn-the-eme...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "can",
      "video",
      "skills",
      "time",
      "effect",
      "watching",
      "children",
      "what",
      "when",
      "students",
      "most",
      "growth",
      "jpmorgan",
      "javice",
      "tutoring",
      "impact",
      "not",
      "yet",
      "today",
      "across",
      "all",
      "find",
      "effects",
      "who",
      "job",
      "resume",
      "right",
      "people",
      "image",
      "percent",
      "norway",
      "wealth",
      "tax",
      "bank",
      "175",
      "2023",
      "2025",
      "evidence",
      "using",
      "paper",
      "technology",
      "produce",
      "sizes",
      "standard",
      "deviations",
      "real",
      "just",
      "there",
      "very",
      "same"
    ],
    "searchableText": "the algorithmic turn the emerging evidence on ai tutoring that 39 s hard to ignore an excellent and balanced piece on impact of ai on education. the harvard study was conducted using gpt-4 in autumn 2023 by the time the paper was published in 2025, the underlying technology had already advanced. if ai tutoring can produce effect sizes of 0.73 to 1.3 standard deviations now, whilst still requiring pre-written solutions and careful scaffolding to prevent errors, what happens when the models can reason through physics problems independently? when they can diagnose misconceptions in real time? when they can adapt not just to individual students but to culturally specific contexts? and yet there is a troubling paradox at the heart of ai tutoring. the very same technology that can produce effect sizes above 0.7 standard deviations can also make students demonstrably worse at learning. and i would argue that the harmful version is the one most students are currently using today. if a bot passes your exam, what are you teaching? my tools in data science course has a remote online exam. it was so difficult that, in 2023, it sparked threads titled what is the purpose of an impossible roe? today, despite making the test harder, students solve it easily with claude, chatgpt, etc. the effect of video watching on children s skills this paper documents video consumption among school-aged children in the u.s. and explores its impact on human capital development. video watching is common across all segments of society, yet surprisingly little is known about its developmental consequences. with a bunching identification strategy, we find that an additional hour of daily video consumption has a negative impact on children s noncognitive skills, with harmful effects on both internalizing behaviors e.g., depression and externalizing behaviors e.g., social difficulties . we find a positive effect on math skills, though the effect on an aggregate measure of cognitive skills is smaller and not statistically significant. these findings are robust and largely stable across most demographics and different ways of measuring skills and video watching. we find evidence that for hispanic children, video watching has positive effects on both cognitive and noncognitive skills potentially reflecting its role in supporting cultural assimilation. interestingly, the marginal effects of video watching remain relatively stable regardless of how much time children spend on the activity, with similar incremental impacts observed among those who watch very little and those who watch for many hours. friction was the feature there was a time when applying for a job meant choosing a handful of roles, tailoring a resume, and writing a real cover letter. the effort was a nuisance, but it quietly enforced focus. if you were going to burn a saturday on an application, you probably cared about the job. today, a candidate armed with an llm can parse dozens of job postings, lift phrasing from each, and generate a set of keyword-optimized cover letters in no time. they can auto-tailor their resume to each posting. they can submit 30 applications in one sitting. this is better, right? not for anyone, actually. applications soar recruiters drown. so we bolt on more automation applicant tracking systems, resume parsers, ai interview schedulers. we convince ourselves we ve built a better machine, but we haven t redesigned the only machine that matters the system matching the right people to the right work. nano banana pro aka gemini-3-pro-image-preview is the best available image generation model read the whole thing and never believe an image again. that s a pretty extraordinary result for such a simple prompt. the text is all spelled correctly and rendered without glitches. the content is solid too it even included logos for the most popular publish platforms, and a tiny thumbnail of the datasette ui which is close-enough for an infographic. optimize your linkedin the constitution of innovation however around 1980, this unprecedented growth period ended. while the united states maintained a remarkably constant 2 percent growth rate in average income, the european core economies decelerated, slowly and then sharply. since 1995, europe s average annual growth has been just 1.1 percent since 2004, it has been a mere 0.7 percent all while the united states has continued on its steady track. by 2022 the relative gap in output per head has returned to where it was in 1970. decades of convergence were surprisingly wiped out.4 norway 39 s wealth tax unchains a capital exodus perhaps norway needs to click the previous link. norway 39 s wealth tax increase, expected to raise 146m, led to a 448m net loss as 54b in wealth left the country, reducing tax revenue by 594m. are they going to eat me alive? trail runners become prey in newest form of hunting would you like to be chased by a pack of hounds? it s a question often put to highlight the cruelty of hunting, because the answer would seem to be no. or so you would think. yet increasing numbers of people are volunteering to be chased across the countryside by baying bloodhounds in what could soon be the only legal way to hunt with dogs in england and wales, rather than pursuing animals or their scents. she took jpmorgan for 175 million. that doesn t include her restaurant bills. in september, ms. javice, 33, was sentenced to more than seven years in prison for fraud. in 2021, jpmorgan chase acquired her start-up, frank, for 175 million. ms. javice had claimed her company helped millions of people fill out their federal financial aid forms. after the acquisition, however, the bank discovered that she had lied about most of frank s customers. jpmorgan sued, and then prosecutors put ms. javice on trial. a jury convicted her this year. along the way, ms. javice won a ruling that required the bank to pay her legal fees. jpmorgan has objected to the size of the fees in the past, and after her sentencing it decided to try to cut her off. the bank is trying the same maneuver with her former chief growth and acquisition officer, olivier amar, who was also convicted of fraud. dog accidentally shoots and injures a pennsylvania man, the police say no comment. the man had been cleaning a shotgun and placed it on the bed shortly before it was fired. he received treatment at an area hospital.",
    "preview": "the algorithmic turn the emerging evidence on ai tutoring that 39 s hard to ignore an excellent and balanced piece on impact of ai on education. the harvard study was conducted using gpt-4 in autumn 2...",
    "content": "\nThe Algorithmic Turn: The Emerging Evidence On AI Tutoring That&#39;s Hard to Ignore: An excellent and balanced piece on impact of AI on education. \n\nThe Harvard study was conducted using GPT-4 in autumn 2023; by the time the paper was published in 2025, the underlying technology had already advanced. If AI tutoring can produce effect sizes of 0.73 to 1.3 standard deviations now, whilst still requiring pre-written solutions and careful scaffolding to prevent errors, what happens when the models"
  },
  {
    "id": "links-08-nov-2025",
    "title": "Links: Week of 08 Nov 2025",
    "url": "posts/2025/links-08-nov-2025.html",
    "date": "2025-11-08T00:00:00.000Z",
    "dateFormatted": "November 8, 2025",
    "excerpt": "1. [Brenda](https://www.tiktok.com/@belligerentbarbies/video/7568380008633257271): \n    > I'm worried that they put co-pilot in Excel because Excel is...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "brenda",
      "there",
      "one",
      "like",
      "some",
      "excel",
      "because",
      "gonna",
      "not",
      "more",
      "know",
      "who",
      "report",
      "need",
      "change",
      "longer",
      "optimism",
      "can",
      "important",
      "life",
      "climate",
      "end",
      "easy",
      "beast",
      "mid",
      "every",
      "department",
      "across",
      "what",
      "financial",
      "make",
      "than",
      "won",
      "understand",
      "feet",
      "long",
      "head",
      "optimists",
      "money",
      "good",
      "things",
      "studies",
      "suggest",
      "span",
      "beyond",
      "health",
      "use",
      "early",
      "even",
      "extremely"
    ],
    "searchableText": "brenda i 39 m worried that they put co-pilot in excel because excel is the beast that drives our entire economy and do you know who has tamed that beast? brenda. who is brenda? she is a mid-level employee in every finance department, in every business across this stupid nation and the excel goddess herself descended from the heavens, kissed brenda on her forehead and the sweat from brenda 39 s brow is what allows us to do capitalism. ... she 39 s gonna birth that formula for a financial report and then she 39 s gonna send that financial report to a higher up and he 39 s gonna need to make a change to the report and normally he would have sent it back to brenda but he 39 s like oh i have ai and ai is probably like smarter than brenda and then the ai is gonna fuck it up real bad and he won 39 t be able to recognize it because he doesn 39 t understand excel because ai hallucinates. you know who 39 s not hallucinating? brenda. lovely bakes, no wig jasmine mitchell, the winner of the 16th season of the great british baking show, stood out in the competition mainly for her creations including a cake that was nearly four feet long but also for her statement earrings, brightly colored outfits and her shiny, hairless head. optimists in stock market there 39 s a saying pessimists sounds smart, optimists make money. turns out they live longer too. optimism is a psychological attribute characterized as the general expectation that good things will happen, or the belief that the future will be favorable because one can control important outcomes. previous studies reported that more optimistic individuals are less likely to suffer from chronic diseases and die prematurely. our results further suggest that optimism is specifically related to 11 to 15 longer life span, on average, and to greater odds of achieving exceptional longevity, that is, living to the age of 85 or beyond. these relations were independent of socioeconomic status, health conditions, depression, social integration, and health behaviors e.g., smoking, diet, and alcohol use . overall, findings suggest optimism may be an important psychosocial resource for extending life span in older adults. why i stopped being a climate catastrophist climate change seems quite visible. this year it rained in indore through early november. in 90 39 s and even early 39 00s anything beyond mid-september was extremely unusual. but is it catastrophic? will it become so? maybe not. depending on how much weight one gives to individual studies and models, versus broader literature reviews and scientific assessments, you can find some evidence for some intensification of some features of tropical cyclone behavior and frequency in some places. but what you won t find, norris reference to a single unpublished and unpeer-reviewed study notwithstanding, is good evidence that climate change has affected those things very much. he s been charged with dozens of crimes. nobody knows his name. investigators confirmed that the caller was actually carl avinger and that the defendant was not. nor was he carl e. avinger, john stamp, bobby jackson, craig taylor, graig t aylor, anthony s. williams, kevin c. windley, kevin windleg, corey blake duncan, marco ferrari, marco ferrare, elvis taylor or elvis teller names he had used to commit dozens of crimes across the city, on long island and as far away as oklahoma over the last three decades, according to court, jail and prison records, and internal police department documents obtained by the new york times. in the months that followed, melinda katz, the queens district attorney, and her prosecutors from the housing bureau unearthed more information about the man whose roughly half-century life had been defined by deceit. but there was one fact they had yet to discover his name. uatx is ending tuition forever interesting but will it matter? see 7. uatx will never charge tuition. and we will never take government money. university education as we know it is over tl dr ai now solves university assignments perfectly in minutes. students often use llms as a crutch rather than as a tutor, getting answers without understanding. to address these problems, i propose a barbell strategy pure fundamentals no ai on one end, full-on ai projects on the other, with no mushy middle. universities should focus on fundamentals. you should write an agent some concepts are easy to grasp in the abstract. boiling water apply heat and wait. others you really need to try. you only think you understand how a bicycle works, until you learn to ride one. there are big ideas in computing that are easy to get your head around. the aws s3 api. it s the most important storage technology of the last 20 years, and it s like boiling water. other technologies, you need to get your feet on the pedals first. llm agents are like that. people have wildly varying opinions about llms and agents. but whether or not they re snake oil, they re a big idea. you don t have to like them, but you should want to be right about them. to be the best hater or stan you can be. so that s one reason you should write an agent. but there s another reason that s even more persuasive, and that s it s incredibly easy game design is simple, actually so, let s just walk through the whole thing, end to end. here s a twelve-step program for understanding game design. one thing i have noticing recently is that there are a ton of interesting blogs out there. of course, there is substack, but there is a lot more and of extremely high quality except that my discovery model has broken down. twitter google are no longer the best discovery option. i would like a better solution to this problem.",
    "preview": "brenda i 39 m worried that they put co-pilot in excel because excel is the beast that drives our entire economy and do you know who has tamed that beast? brenda. who is brenda? she is a mid-level empl...",
    "content": "\nBrenda: \n\nI&#39;m worried that they put co-pilot in Excel because Excel is the beast that drives our entire economy and do you know who has tamed that beast?\n\n\n\nBrenda.\n\n\n\nWho is Brenda?\n\n\n\nShe is a mid-level employee in every finance department, in every business across this stupid nation and the Excel goddess herself descended from the heavens, kissed Brenda on her forehead and the sweat from Brenda&#39;s brow is what allows us to do capitalism. [...]\n\n\n\nShe&#39;s gonna birth that formula for"
  },
  {
    "id": "links-01-nov-2025",
    "title": "Links: Week of 01 Nov 2025",
    "url": "posts/2025/links-01-nov-2025.html",
    "date": "2025-11-01T00:00:00.000Z",
    "dateFormatted": "November 1, 2025",
    "excerpt": "1. [5'11\"?](https://x.com/statisticurban/status/1982995821655405017):\n    ![embed](https://x.com/statisticurban/status/1982995821655405017)...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "any",
      "not",
      "when",
      "can",
      "work",
      "question",
      "longer",
      "like",
      "going",
      "questions",
      "asics",
      "100",
      "quot",
      "most",
      "today",
      "which",
      "what",
      "who",
      "day",
      "even",
      "just",
      "kellenberger",
      "years",
      "talk",
      "don",
      "real",
      "ask",
      "time",
      "very",
      "important",
      "than",
      "machines",
      "obsolete",
      "douthat",
      "popular",
      "takes",
      "minutes",
      "biggest",
      "one",
      "ono",
      "secret",
      "try",
      "believe",
      "entire",
      "appalachian",
      "trail",
      "few",
      "without",
      "all",
      "said"
    ],
    "searchableText": "5 39 11 quot ? pumpkin stylists are making a killing this fall her most popular package today is her smallest, which costs 325, comes with about 20 pumpkins and takes her six minutes to assemble into a display. the second-most popular is the biggest, at 1,350 that one takes her about 30 minutes. she can do the installations in the dark, wearing a headlamp. japan s sushi legend jiro ono turns 100 and is not ready for retirement what s the secret of his health? to work, ono replied to the question by tokyo gov. yuriko koike, who congratulated him. i can no longer come to the restaurant every day ... but even at 100, i try to work if possible. i believe the best medicine is to work. she hiked the entire appalachian trail at 80, unaware she d just made history the day betty kellenberger hit a patch of freezing rain on mount madison, quitting crossed her mind. she was hungry, cold and sore. you re 80 years old, she told herself in a pep talk atop a mountain in new hampshire. you can do it. a few months later, kellenberger stood at the massachusetts-vermont border, having just finished hiking the entire 2,197-mile appalachian trail. she became, without realizing it, the oldest woman ever to do it. we put all kinds of limitations on ourselves, said kellenberger, who lives in carson city, michigan. sometimes the biggest one is we don t get up and try it. i tried the first humanoid home robot. it got weird. i look forward to the day something like this becomes real and it may be quot real soon now quot , but i think this take from daring fireball is exactly right the argument from ceo bernt b rnich is that they re using the videos from the current state of neo, where its actions are entirely remote-controlled by employees of 1x technologies, to train its autonomy. i call bullshit. this looks to me like nothing but a scam. it s not autonomous at all, i don t believe this company is going to achieve any practical degree of autonomy with this product, and even while it s remote-controlled by human operators, it s slow and clumsy. 5 tips when consulting dr. chatgpt as someone who has saved hundreds, if not thousands, of dollars in physiotherapy bill using chatgpt and is seemingly at the verge of fixing a long-standing chronic back pain, i am a fan. used sensibly this is a powerful tool. sensibly being the key word. for me, the ability to ask unlimited questions and provide unlimited context was a huge unlock relative to visiting a physio. also the time saved going to and from the clinic meant i could be much more regular. i fully agree that sharing detailed context and inviting clarifying questions are very important. in general, a.i. chatbots are far better at offering answers than asking questions, so they tend to skip the important follow-ups a physician would ask, dr. turken said like whether you have any underlying conditions or are taking any medications. this is especially problematic when you re asking about potential diagnoses or medical advice. to compensate, dr. turken recommended prompting the chatbot with a line like ask me any additional questions you need to reason safely. when will quantum computing work? huge investments are flowing into qc companies today. ionq has a 19b market cap, rigetti has a 10b cap, and psiquantum recently raised 1b.3d-wave is not relevant, despite high qubit counts. their machines are annealers, rather than gate based, and have less computational power than the qcs that ionq, rigetti, psiquantum, etc. are working on. this is a lot of money for an industry generating no real revenue, and without an apparent path to revenue over the next 5 years. qubit counts have not been doubling each year, but even if they did, we 39 d have 32 kq machines in 2030.4if qubits double each year, 1,000 qubits today grows to 32 kq in 5 years 39 time. there are few - if any - commercial applications for machines of that size. will these companies keep raising larger rounds until they achieve 100 kq? or have they got some secret sauce we don 39 t know about that investors are betting on? depreciation a skeptical take. he assumes that the asics are obsolete when they can no longer keep up with the hash rate so are no longer mining any bitcoin. that is wrong. asics are obsolete when the bitcoin they mine no longer pay for the electricity they use. the newer asics aren 39 t just faster, they also use much less energy per hash. look again at the depreciation graph, which suggests current asics go obsolete after 16 quarters. but alex de vries and christian stoll 39 s estimate of 5 quarters to obsolescence is based on comparing the asic 39 s production with the cost of their power consumption, which is the correct approach. the curves in the graph are correct out to the 40 line, but then should drop to zero. what palantir sees douthat so we re going to talk about a lot of things. we re going to talk about your biography and background, how you came to be an officer in the u.s. military, the future of technology and warfare. but we have to start with a very, very simple question what is it that palantir does? sankar great question. douthat thank you. sankar obviously the most important question, yeah. douthat i spent a long time crafting it, i have to say.",
    "preview": "5 39 11 quot ? pumpkin stylists are making a killing this fall her most popular package today is her smallest, which costs 325, comes with about 20 pumpkins and takes her six minutes to assemble into ...",
    "content": "\n5&#39;11&quot;?:\n\n\n  \n    \n  \n\n\n\nPumpkin Stylists Are Making a Killing This Fall: \n\nHer most popular package today is her smallest, which costs $325, comes with about 20 pumpkins and takes her six minutes to assemble into a display. The second-most popular is the biggest, at $1,350; that one takes her about 30 minutes. She can do the installations in the dark, wearing a headlamp. \n\n\nJapan’s sushi legend Jiro Ono turns 100 and is not ready for retirement: \n\nWhat’s the secret of his health? “To w"
  },
  {
    "id": "links-25-oct-2025",
    "title": "Links: Week of 25 Oct 2025",
    "url": "posts/2025/links-25-oct-2025.html",
    "date": "2025-10-25T00:00:00.000Z",
    "dateFormatted": "October 25, 2025",
    "excerpt": "1. [Landon Donovan’s new hair, and the side effect he wasn’t expecting (NYT)](https://www.nytimes.com/athletic/6721868/2025/10/21/landon-donovan-hairp...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "book",
      "elites",
      "all",
      "against",
      "not",
      "people",
      "cognitive",
      "hair",
      "like",
      "when",
      "even",
      "day",
      "man",
      "world",
      "old",
      "one",
      "get",
      "more",
      "requires",
      "self",
      "young",
      "information",
      "remains",
      "very",
      "any",
      "donovan",
      "effect",
      "wasn",
      "age",
      "having",
      "rest",
      "started",
      "rogaine",
      "why",
      "left",
      "much",
      "developed",
      "rebellion",
      "modern",
      "society",
      "which",
      "inhibition",
      "control",
      "burdens",
      "demanding",
      "every",
      "while",
      "word",
      "recently",
      "now"
    ],
    "searchableText": "landon donovan s new hair, and the side effect he wasn t expecting nyt as a man of a certain age, this hit a little too close to home. but, hats off heheh! to the man for having the courage to participate in a story like this. making the world a hair safer for the rest of us. donovan s journey to a hair system started two decades ago when, as a 20-year-old, he noticed his hair was receding. he remembers one moment when he was warming up for a game against fc dallas in frisco and fans started chanting at him rogaine! rogaine! populism fast and slow working through the consequences of this, it is not difficult to see why the left has been unable to get much traction out of these changes, especially in developed countries. people are not rebelling against economic elites, but rather against cognitive elites. narrowly construed, it is a rebellion against executive function. more generally, it is a rebellion against modern society, which requires the ceaseless exercise of cognitive inhibition and control, in order to evade exploitation, marginalization, addiction, and stigma. elites have basically rigged all of society so that, increasingly, one must deploy the cognitive skills possessed by elites to successfully navigate the social world. try opening a bank account, renting an apartment, or obtaining a tax refund, without engaging in analytical processing. the left, to the extent that it favours progress, is essentially committed to intensifying the features of the modern world that impose the greatest burdens of self-inhibition on individuals. seeing things in this way makes it easier to understand why people get so worked up over seemingly minor issues, like language policing. the problem with demanding political correctness in speech, and punishing or ostracizing those who fail, is that it turns every conversation into a stroop test, allowing elites the opportunity to exhibit conspicuous self-control. it requires the typical person, while speaking, to actively suppress the familiar word that is primed e.g. homeless , and to substitute through explicit cognition the recently-minted word that is now favoured e.g. unhoused . elites are not just insensitive, but positively dismissive of the burdens that this imposes on many people. as a result, by performing the cognitive operation with such fluidity, they are not only demonstrating their superiority, they are rubbing other people s faces in it. from this perspective, it is not surprising that the demand for they them pronouns upset some people even more, because the introduction of a plural pronoun forces a verb change, which requires an even more demanding cognitive performance. age inversion everyone under 30 is prematurely old worried about savings, career, fire . everyone over 50 is desperately young burning man, psychedelics . my theory information abundance aged the young by showing them all future problems all at once. information abundance also made the old young by showing them all missed experiences all at once. so now gen z talks like retirement planners and boomers act like teenagers. it 39 s so over. the remains of the day and the movie i recently read the remains of the day by kazuo ishiguro, after coming across a positive review and remembering that there was an oscar nominated movie based on the book in the 39 90s, when watching the oscars used to be in thing in india. after the first couple of chapters, thinking that this was perhaps an artsy book, i also opened up a chat with chatgpt to improve my understanding of the book. this was useful but note to self in future explicitly tell chatgpt to avoid spoilers or otherwise reveal information or conclusions from the later chapters. to be fair, i did ask for themes to notice in rest of the book so its mostly on me. this isn 39 t a thriller so in one sense the damage was limited. it is, however, a very subtle book that gradually unveils its layers and getting a bunch of bullet points upfront, spelling out every complexity and nuance wasn 39 t ideal. the book is a masterpiece. very few books have ever had this effect on me where, for days afterwards, i suddenly get a flash of feeling, a pang that forces me to stop for a breath. the closest analogy that came spontaneously to my mind was of eating great japanese food yes, even as a vegetarian - the flavours are extremely subdued - very much the opposite of, say, indian food. but they are unmistakable, sharp even, if you stop and notice, and you know it took a lot of effort and craftsmanship to pull it off just right. when reading fiction, i have a tendency to really flip pages towards the end, a tendency developed from years of reading mostly thriller novels. because of this i found the book depressing, having barely spent any thought on the final pages. it is only while writing this post that i revisited the ending and the title and had to reconsider my understanding. i had identified so deeply with the sense of loss in the middle of the book that i completely missed the gentle ray of hope that ishiguro leaves us with at the end as humans, on any given day and at any given time, all we can do is to make the best of whatever remains of the day. highly recommended.",
    "preview": "landon donovan s new hair, and the side effect he wasn t expecting nyt as a man of a certain age, this hit a little too close to home. but, hats off heheh! to the man for having the courage to partici...",
    "content": "\nLandon Donovan’s new hair, and the side effect he wasn’t expecting (NYT): As a man of a certain age, this hit a little too close to home. But, hats off (heheh!) to the man for having the courage to participate in a story like this. Making the world a hair safer for the rest of us.\n\nDonovan’s journey to a hair system started two decades ago when, as a 20-year-old, he noticed his hair was receding. He remembers one moment when he was warming up for a game against FC Dallas in Frisco and fans star"
  },
  {
    "id": "links-18-oct-2025",
    "title": "Links: Week of 18 Oct 2025",
    "url": "posts/2025/links-18-oct-2025.html",
    "date": "2025-10-18T00:00:00.000Z",
    "dateFormatted": "October 18, 2025",
    "excerpt": "1. Happy Diwali to those who celebrate! NYT had two glossy stories on just one [Diwali Ball](https://www.nytimes.com/2025/10/12/style/diwali-ball-new-...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "quot",
      "one",
      "not",
      "can",
      "china",
      "there",
      "diwali",
      "something",
      "title",
      "arbitrage",
      "trillion",
      "2025",
      "nyt",
      "two",
      "just",
      "priyanka",
      "chopra",
      "phone",
      "theft",
      "now",
      "know",
      "because",
      "how",
      "get",
      "time",
      "wokeness",
      "like",
      "status",
      "most",
      "scale",
      "yet",
      "markets",
      "here",
      "tax",
      "returns",
      "more",
      "win",
      "losses",
      "problem",
      "800",
      "links",
      "week",
      "oct",
      "happy",
      "who",
      "celebrate",
      "glossy",
      "stories",
      "ball",
      "new"
    ],
    "searchableText": "happy diwali to those who celebrate! nyt had two glossy stories on just one diwali ball in new york organized by priyanka chopra 39 s manager . made me go quot hmmm... quot . was this about diwali, was this about priyanka chopra or was this something else? london became a global hub for phone theft. now we know why. not a fan of clickbait headlines in nyt tbh but this story was revealing. i was under the impression that phone theft was a thing of past because of the hard to crack passcodes. turns out not. the article didn 39 t make it very clear how the thieves could get the phones working again. apparently they can be sold for parts and something something china. anyway, time to be careful out there again. the pendulum has swung away from wokeness and cancel culture, as it should have. but sometimes it feels like, instead of passing through the center it went straight to the other end . title arbitrage as status engineering title arbitrage is one of the most scalable levers a company can pull to increase the status of certain roles and attract talent. it costs nothing, works at scale, yet has the ability to reshape labor markets. the design space for title arbitrage remains wide open. there are many ways through which the llm subscriptions pay for themselves. for me it was physiotherapy. here it is filing tax returns. i also wish more people would share quot how tos quot for solving different problems with llms. here 39 s a manual for tax returns. full disclosure i haven 39 t tried it yet but the source is credible. five technological achievements! that we won t see any time soon. observations on ai and the capital markets in 2025 quot to provide some sense of scale, that means the equivalent of about 1,800 per person in america will be invested this year on ai quot . that is a bucketload of spending. china can 39 t win retweets are not endorsments, as they say. however there is a chorus of experts out there loudly claiming that china holds the upper hand in the tariff negotiations with us. i am not so sure and this looks like a worthwhile counterpoint. added to reading list. china cannot win the decoupling because they face an impossible trilemma protect the currency, bail out the banks, or maintain social stability. they can pick two at most. more likely, they get one. the math is unforgiving 5-10 trillion in hidden property losses against 3 trillion in bank equity. that s not a solvency problem it s a physics problem. meanwhile, they re bleeding 1.1 trillion annually just to hide the losses, burning their entire defense and r amp d budget combined on financial zombies. now that wokeness is over, is it ok to link to louis ck clips again? can one separate the art from the artist? i don 39 t know but i love this one",
    "preview": "happy diwali to those who celebrate! nyt had two glossy stories on just one diwali ball in new york organized by priyanka chopra 39 s manager . made me go quot hmmm... quot . was this about diwali, wa...",
    "content": "\nHappy Diwali to those who celebrate! NYT had two glossy stories on just one Diwali Ball in New York organized by Priyanka Chopra&#39;s manager. Made me go &quot;Hmmm...&quot;. Was this about Diwali, was this about Priyanka Chopra or was this something else?\n\nLondon Became a Global Hub for Phone Theft. Now We Know Why. Not a fan of clickbait headlines in NYT TBH but this story was revealing. I was under the impression that phone theft was a thing of past because of the hard to crack passcodes. T"
  },
  {
    "id": "links-11-oct-2025",
    "title": "Links: Week of 11 Oct 2025",
    "url": "posts/2025/links-11-oct-2025.html",
    "date": "2025-10-11T00:00:00.000Z",
    "dateFormatted": "October 11, 2025",
    "excerpt": "1. [An Economists Guide to Weight Loss](https://blog.supplysideliberal.com/post/2019/6/18/miles-kimball-on-diet-and-health-a-readers-guide): Pre-Ozemp...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "quot",
      "can",
      "percentile",
      "responses",
      "100",
      "2025",
      "links",
      "week",
      "oct",
      "economists",
      "guide",
      "weight",
      "loss",
      "pre",
      "ozempic",
      "new",
      "year",
      "resolution",
      "patel",
      "motel",
      "story",
      "hope",
      "well",
      "done",
      "must",
      "watch",
      "some",
      "insightful",
      "too",
      "problem",
      "growing",
      "small",
      "town",
      "going",
      "weaker",
      "school",
      "certain",
      "type",
      "person",
      "bernie",
      "madoff",
      "stole",
      "savings",
      "here",
      "how",
      "got",
      "life",
      "back",
      "hats",
      "think"
    ],
    "searchableText": "an economists guide to weight loss pre-ozempic. new year resolution? the patel motel story i hope its well done. must watch. 99 percentile vs. 99.9 percentile some of the responses are insightful too. this can be the problem of growing up in a small town or going to a quot weaker quot school for a certain type of person. bernie madoff stole my savings. here s how i got my life back. hats off. i think people who are facing a sudden reversal can learn from my experience. you can get through it. you have family, you have friends, you have resources that you don t even know that you have. average? i had to go down about 100 responses before someone asked, quot man or woman? quot",
    "preview": "an economists guide to weight loss pre-ozempic. new year resolution? the patel motel story i hope its well done. must watch. 99 percentile vs. 99.9 percentile some of the responses are insightful too....",
    "content": "\nAn Economists Guide to Weight Loss: Pre-Ozempic. New Year Resolution?\n\nThe Patel Motel Story: I hope its well done. Must watch. \n\n99 Percentile vs. 99.9 Percentile: Some of the responses are insightful too. This can be the problem of growing up in a small town or going to a &quot;weaker&quot; school for a certain type of person.\n\n\n\n  \n    \n  \n\n    \n\nBernie Madoff Stole My Savings. Here’s How I Got My Life Back.: Hats off.\n\nI think people who are facing a sudden reversal can learn from my experi"
  },
  {
    "id": "links-04-oct-2025",
    "title": "Links: Week of 04 Oct 2025",
    "url": "posts/2025/links-04-oct-2025.html",
    "date": "2025-10-04T00:00:00.000Z",
    "dateFormatted": "October 4, 2025",
    "excerpt": "1. [Your Review: The Russo-Ukrainian War - Astral Codex Ten](https://www.astralcodexten.com/p/your-review-the-russo-ukrainian-war): \n    > One day as ...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "time",
      "lived",
      "more",
      "people",
      "very",
      "gone",
      "one",
      "long",
      "like",
      "than",
      "past",
      "age",
      "since",
      "some",
      "throwing",
      "good",
      "parties",
      "new",
      "not",
      "social",
      "media",
      "250",
      "2022",
      "review",
      "ukrainian",
      "astral",
      "codex",
      "ten",
      "non",
      "hear",
      "all",
      "men",
      "across",
      "generations",
      "back",
      "subjective",
      "most",
      "noticed",
      "seems",
      "speed",
      "years",
      "seemed",
      "pass",
      "quickly",
      "feel",
      "twice",
      "when",
      "year",
      "old",
      "high"
    ],
    "searchableText": "your review the russo-ukrainian war - astral codex ten one day as i was being lectured by a female hr representative for leaving my cloth, non-medical mask off for too long during lunch, i could barely hear what she was saying. all i could think of were the uncounted men across untold generations who had lived and died as warriors, with all the honor and pain that entailed. i thought of how men in ukraine right now lived a modern version of that, while i allowed myself to be subject to the feminized safteyist ideology of everyday civilization. the spiritual offensiveness of this contrast hit me like a ton of bricks, more vividly than ever. at that moment i silently made my final decision. i wasn t going to wait around to hear back from the ukrainian government. it was time, in the immortal words of an isis recruiter on twitter to put down the chicken wings n come to jihad, bro . the entire non-book review contest at astral codex ten has been fantastic. subjective time like most people, i ve noticed that time seems to speed up as one gets older. i moved to california in 2017, and the past 8 years seemed to pass by very quickly. i feel like time is moving twice as fast as when i was 35. even as a 16-year old high school student i had already noticed that those long summer vacations seemed to pass by at twice the speed as when i was only 8 years old. in mathematical terms, subjective time seems roughly proportional to the inverse of one s age. at least since age 3 or 4, before that i recall nothing. at age n, each lived year represents 1 nth of our life. if this is true, then this has some fairly startling implications. jane goodall a life well lived, can anyone ask for more democracy vs. dictatorship 21 facts about throwing good parties let me repeat that parties are a public service, you re doing people a favor by throwing them. someone might meet their new best friend or future lover at your gathering. in the short term, lovely people may feel less lonely, and that 39 s thanks to you. in the long term, whole new children may ultimately exist in the world because you bothered to throw a party. throwing parties is stressful for most people, but a great kindness to the community, so genuinely pat yourself on the back for doing this. not so much facts, as very good opinions, but still. new data on social media mr it has gone largely unnoticed that time spent on social media peaked in 2022 and has since gone into steady decline, according to an analysis of the online habits of 250,000 adults in more than 50 countries carried out for the ft by the digital audience insights company gwi. and this is not just the unwinding of a bump in screen time during pandemic lockdowns usage has traced a smooth curve up and down over the past decade-plus. societies, generations tend to develop immunity from toxic trends over time. do llms favor outputs created by themselves? mr it has gone largely unnoticed that time spent on social media peaked in 2022 and has since gone into steady decline, according to an analysis of the online habits of 250,000 adults in more than 50 countries carried out for the ft by the digital audience insights company gwi. and this is not just the unwinding of a bump in screen time during pandemic lockdowns usage has traced a smooth curve up and down over the past decade-plus. is it surprising that a system trained on human output is tribal, favoring in-group over out-group? sora update 1 please expect a very high rate of change from us it reminds me of the early days of chatgpt . we will make some good decisions and some missteps, but we will take feedback and try to fix the missteps very quickly. we plan to do our iteration on different approaches in sora, but then apply it consistently across our products.",
    "preview": "your review the russo-ukrainian war - astral codex ten one day as i was being lectured by a female hr representative for leaving my cloth, non-medical mask off for too long during lunch, i could barel...",
    "content": "\nYour Review: The Russo-Ukrainian War - Astral Codex Ten: \n\nOne day as I was being lectured by a female HR representative for leaving my (cloth, non-medical) mask off for too long during lunch, I could barely hear what she was saying. All I could think of were the uncounted men across untold generations who had lived and died as warriors, with all the honor and pain that entailed. I thought of how men in Ukraine right now lived a modern version of that, while I allowed myself to be subject to th"
  },
  {
    "id": "links-27-sep-2025",
    "title": "Links: Week of 27 Sep 2025",
    "url": "posts/2025/links-27-sep-2025.html",
    "date": "2025-09-27T00:00:00.000Z",
    "dateFormatted": "September 27, 2025",
    "excerpt": "...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "million",
      "beast",
      "videos",
      "youtube",
      "industries",
      "regular",
      "now",
      "money",
      "video",
      "which",
      "000",
      "creating",
      "tools",
      "llms",
      "110",
      "2023",
      "2024",
      "2025",
      "links",
      "week",
      "sep",
      "pulse",
      "days",
      "morning",
      "work",
      "routine",
      "starts",
      "trying",
      "replicate",
      "functionality",
      "use",
      "multiple",
      "prompts",
      "gpts",
      "looking",
      "forward",
      "when",
      "feature",
      "comes",
      "cattle",
      "class",
      "subscriptions",
      "star",
      "mrbeast",
      "building",
      "entertainment",
      "empire",
      "bloomberg",
      "sounds",
      "like"
    ],
    "searchableText": "pulse these days my morning work routine starts with trying to replicate this functionality through the use of multiple prompts and gpts, so i am looking forward to when then feature comes to cattle class subscriptions. youtube star mrbeast is building an entertainment empire - bloomberg beast industries sounds like a regular corporation with regular corporate problems. right now, however, beast industries is hemorrhaging money. it s had three years of losses, including more than 110 million in 2024. the viral videos account for all of it, overwhelming the profits from feastables. donaldson has been spending between 3 million and 4 million on every video he produces for the main youtube channel, most of which lose money. in 2023, beast spent 10 million to 15 million shooting videos it never released to the public because they weren t up to its standards. he also lost tens of millions of dollars producing beast games, a popular show for amazon prime video in which 1,000 people competed for 10 million by, among other things, moving a 10,000-pound boulder. ignoring the hype up top, google does seem to be creating some practical tools with llms. with base llms getting quite good now, i wonder if the next unlock is in creating tools with customized workflows for specific tasks. wrappers. periodic videos",
    "preview": "pulse these days my morning work routine starts with trying to replicate this functionality through the use of multiple prompts and gpts, so i am looking forward to when then feature comes to cattle c...",
    "content": "\nPulse: These days my morning work routine starts with trying to replicate this functionality through the use of multiple prompts and GPTs, so I am looking forward to when then feature comes to cattle class subscriptions.\n\n\n  \n    \n  \n\n\n\nYouTube Star MrBeast Is Building an Entertainment Empire - Bloomberg: Beast Industries sounds like a regular corporation with regular corporate problems. \n\nRight now, however, Beast Industries is hemorrhaging money. It’s had three years of losses, including more"
  },
  {
    "id": "links-20-sep-2025",
    "title": "Links: Week of 20 Sep 2025",
    "url": "posts/2025/links-20-sep-2025.html",
    "date": "2025-09-21T00:00:00.000Z",
    "dateFormatted": "September 21, 2025",
    "excerpt": "1. If you’ve got a compliment, just let it out.\n    ![embed](https://x.com/jayplemons/status/1964775529686688196)...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "told",
      "speaking",
      "reasoning",
      "one",
      "asked",
      "class",
      "fun",
      "same",
      "which",
      "church",
      "model",
      "speech",
      "kids",
      "public",
      "open",
      "ones",
      "make",
      "everyone",
      "shy",
      "how",
      "worked",
      "first",
      "any",
      "none",
      "when",
      "planting",
      "space",
      "not",
      "icpc",
      "problems",
      "experimental",
      "solutions",
      "opposite",
      "think",
      "debate",
      "school",
      "exact",
      "like",
      "half",
      "because",
      "other",
      "loved",
      "scared",
      "day",
      "made",
      "afraid",
      "all",
      "laugh",
      "now",
      "fear"
    ],
    "searchableText": "if you ve got a compliment, just let it out. and the amazing thing is that the opposite works too! i think i mentioned this before but i was a national speech and debate octafinalist in high school and i was able to parlay that into a job running a debate program at an ambitious charter middle school in college. my approach was the exact opposite of this. like half the kids were terrified of public speaking and were only doing it because their tiger moms insisted they had to and the other half loved the attention . i had a lot of trouble getting the scared kids to open up and one day i asked one of the youngest ones what made her so afraid of speaking in front of the class, especially since they were all her friends. and she told me she was afraid she d say something dumb or make a mistake and everyone would make fun of her. and that they d laugh and laugh at her if she froze up. the next day i asked the class if anyone was scared of being made fun of and all the shy kids raised their hands. now i don t actually know if this is the same pathology in adults with fear of public speaking but i suspect it s similar, and now i ll get to how i addressed it which worked fabulously. first i told them that this was a ridiculous fear and that no one would make fun of them. but of course that doesn t do anything lol. but then i told everyone to rip out 10 pieces of paper from their notebooks and crumple them up. and i told them i was going to give a speech. i told them if i said uhh or um or used any filler words they were to throw a paper ball at me and shout shame! 3 times pointing at me. and i gave a terrible speech. and they loved it! it was so much fun for them. but then! i had the students give speeches with the same rules, starting with the confident ones. after the third student the shy ones were volunteering. after the lesson i explained to them that we had accomplished 2 things we had demonstrated how absurd such a reaction really is, because none of them would have ever reacted in that way if they weren t specifically asked to, and none of them had any actual malice even when they did shout shame at their classmates everyone had experienced the comically worst case scenario imaginable of public speaking and survived! so they became the rule during every class and i was told by the other teachers that my shy students had started leading presentations and speaking up in class and some of them asked me how i worked with them. they were horrified when i told them lol. but it worked! this reminds me of boggarts in the harry potter books . church planting when venture capital finds jesus this guy is founding an evangelical church, and i find his ecosystem fascinating. first for its stunning similarities to venture-capital-funded tech start-ups, and then for its simplicity and open-heartedness. none of the dynamics in church planting are unique or even particularly rare, but they are unobfuscated, and that makes church planting the equivalent of a large print book for the social dynamics that favor charismatic narcissists. moon helium deal is biggest purchase of natural resources from space finnish tech firm bluefors, a maker of ultracold refrigerator systems critical for quantum computing, has purchased tens of thousands of liters of helium-3 from the moon spending above 300 million through a commercial space company called interlune. the agreement, which has not been previously reported, marks the largest purchase of a natural resource from space. we are going to have to live here with one another nyt i try to avoid posting political or negative items but this was worth making an excception for. a long and insightful discussion between ezra klein and ben shapiro. eye opening, if you read with an open mind. they traveled to thailand. they wound up cyber scam slaves in myanmar. scary. i am not sure i like graphical news but an interesting experiment. teen depression has declined for the past 4 years, after peaking in 2021. icpc medals for openai and gemini we received the problems in the exact same pdf form, and the reasoning system selected which answers to submit with no bespoke test-time harness whatsoever. for 11 of the 12 problems, the system s first answer was correct. for the hardest problem, it succeeded on the 9th submission. notably, the best human team achieved 11 12. we competed with an ensemble of general-purpose reasoning models we did not train any model specifically for the icpc. we had both gpt-5 and an experimental reasoning model generating solutions, and the experimental reasoning model selecting which solutions to submit. gpt-5 answered 11 correctly, and the last and most difficult problem was solved by the experimental reasoning model. and an advanced version of gemini 2.5 deep think competed live in a remote online environment following icpc rules, under the guidance of the competition organizers. it started 10 minutes after the human contestants and correctly solved 10 out of 12 problems, achieving gold-medal level performance under the same five-hour time constraint. see our solutions here.",
    "preview": "if you ve got a compliment, just let it out. and the amazing thing is that the opposite works too! i think i mentioned this before but i was a national speech and debate octafinalist in high school an...",
    "content": "\nIf you’ve got a compliment, just let it out.\n\n\n  \n    \n  \n\n\n\n\nAnd the amazing thing is that the opposite works too!\n\nI think I mentioned this before but I was a national speech and debate octafinalist in high school and I was able to parlay that into a job running a debate program at an ambitious charter middle school in college. \n\n\n\nMy approach was the exact opposite of this. Like half the kids were TERRIFIED of public speaking and were only doing it because their tiger moms insisted they had "
  },
  {
    "id": "links-14-sep-2025",
    "title": "Links: Week of 6 & 14 Sep 2025",
    "url": "posts/2025/links-14-sep-2025.html",
    "date": "2025-09-14T00:00:00.000Z",
    "dateFormatted": "September 14, 2025",
    "excerpt": "1. [Jeremy Lin Retires After 15 Years That Included ‘Linsanity’ With the Knicks (NYT)](https://www.nytimes.com/2025/08/31/sports/basketball/jeremy-lin...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "not",
      "progress",
      "how",
      "all",
      "what",
      "years",
      "like",
      "get",
      "where",
      "can",
      "llms",
      "swing",
      "much",
      "look",
      "many",
      "day",
      "different",
      "time",
      "some",
      "more",
      "just",
      "gpt",
      "book",
      "read",
      "there",
      "answers",
      "one",
      "packing",
      "going",
      "change",
      "adderall",
      "post",
      "stop",
      "world",
      "other",
      "questions",
      "might",
      "hard",
      "say",
      "models",
      "still",
      "reading",
      "author",
      "projects",
      "term",
      "long",
      "linsanity",
      "knicks",
      "won",
      "best"
    ],
    "searchableText": "jeremy lin retires after 15 years that included linsanity with the knicks nyt the journeyman played for eight n.b.a. teams and won one championship. but he is best known for a brief stretch on the knicks where he electrified fans and the nation. how to feel old 3892 linsanity for 13 years ago and i remember it like it was yesterday! how to resist everyday temptations a guide we can all use, but probably won 39 t. you 39 re overthinking packing the amount of planning and thought that needs to go into the enterprise is surprisingly minimal. count how many days you re going for, then bring the same number of shirts as the number of days minus one unless you have access to laundry, then probably less , 2-4 pairs of pants, a couple nicer dresses if that s your thing and a change of shoes. something to sleep in at night and a bathing suit if you re headed somewhere warm. i always bring an extra pair of underwear and socks because sometimes i like to change throughout the day. then experiment by trying on a bunch items to ensure everything goes together. frankly, it s not that different than figuring out what you re going to wear on a day-to-day basis, which i trust you do all the time. some thinking about packing, maybe some tools i like using packing cubes and a travel scale is a must when flying budget are surprisingly useful but yes, the curve drops sharply. my journey from adhd skeptic to adderall enthusiast at 22, i thought adhd was fake. an excuse for underachieving kids to get accommodations for procrastinating on their homework. from what vague knowledge i had of stimulants like adderall, i regarded them with the same scorn as the accommodations. seventeen years later, i credit adderall with enabling me to build a 10x happier, healthier, more virtuous version of myself to the chagrin of the countless twitter trolls decrying my meth addiction in reply to this recent viral post . here is my story. what is man, that thou art mindful of him? god and iblis debate if human intelligence is hitting a wall. hilarious and insightful. if you meet the singaporean on the road all this effort fifty years of non-stop toil turning a fallow wasteland into fertile earth, and where are all the crops we have to show for it? where are all the local companies that we can point to and be proud of? where are our ericssons and nokias? llms will be like ozempic for golf rob was fantastic but it s not as though i can just do a trackman excursion all the time. yet i remained curious about why my swing was what it was. i had decent power, but lacked the ability to square the ball up with anything approaching consistency. was i destined to always have this problem? and so i turned to llms, feeding the trackman stats into gpt. based on 12 numbers, from one swing, gpt had me clocked. it knew my strengths and weaknesses. it fully understood the specifics of my poor technique. i m sure rob could have walked me through as much, but his time is limited. the machine had all the bandwidth in the world to deal with my over the top swing, how to fix it, and any other questions i might nag it with. a day later, my swing was different and self recorded video sent to google s gemini confirmed the change. swing errors that were decades in the making were corrected in the span of minutes. i m not saying that i ve suddenly made a leap from struggles to break 100 to scratch golfer. i m just saying that a process that could have been expensive and arduous was instead efficient and relatively cheap. i apply the llm s fix, and it tells me whether i ve actually applied it. the feedback is instant and objective. llms will be like ozempic for a lot more than golf. ability to ask unlimited questions without feeling embarrased or paying by the hour is a big deal. imagination is the only thing limiting us. gpt-5 the case of the missing agent it s hard to say exactly why, even with all this progress, current ai models are still so hopeless at dealing with open-ended real-world situations. gpt-5 s inability to recognize that it was incapable of playing minesweeper may indicate that its reasoning abilities do not generalize well. its decision to spend 5 solid hours beating its head against the unimportant side goal of sharing a spreadsheet suggests a lack of training on the importance of setting priorities. the repeated factual errors in gemini 2.5 pro s writeup of its merch store experience click the link and look for editor s notes suggest an inability to keep track of key information over an extended project. claude losing track of the fact that it is not a person is a reminder that in some ways these models really are just shallow imitations of human behavior even as they demonstrate deep capability in other areas . so many benefits and so many limitations. reading with ai reading a non-fiction book from cover-to-cover is not efficient. i used to say that i read books from the outside in. i look at the book flap to find out about the author, who wrote the blurbs, and the subject matter of the book. then i read the introduction and conclusion in order to get the main ideas. if i have read something by a different author that seems relevant, i look for that author in the index, and i head to those pages. and once again, i believe in stop, look, and listen. i start by asking the ai to summarize the key themes of the book. for each theme that the ai lists, i stop and try to put it into my own words. i test my understanding by feeding my words into the ai, in order get confirmation that my interpretation is correct. another way that i ensure understanding is to suggest possible examples or ask the ai to provide examples. how to think about ai progress reproducing the entire post as it really is worth reading the zvi has a good survey post on what is going on with the actual evidence. i have a more general point to make, which i am drawing from my background in austrian capital theory. there are easy projects, and there are hard projects. you might also say short-term vs. long-term investments. the easier, shorter-term projects get done first. for instance, the best llms now have near-perfect answers for a wide range of queries. those answers will not be getting much better, though they may be integrated into different services in higher productivity ways. those improvements will yield an ongoing stream of benefits, but you will not see much incremental progress in the underlying models themselves. ten years from now, the word strawberry still will have three r s, and the llms still will tell us that. there are other questions, such as what is the meaning of life? where the ai answers also will not get much better. i do not mean that statement as ai pessimism, rather the answers can only get so good because the question is not ideally specified in the first place. then there are the very difficult concrete problems, such as in the biosciences or with math olympiad problems, and so on. progress in these areas seems quite steady and i would call it impressive. but it will take quite a few years before that progress is turned into improvements in daily life. again, that does not have to be ai pessimism. just look at how we run our clinical trials, or how long the fda approval process takes for new drugs, or how many people are reluctant to accept beneficial vaccines. i predict that ai will not speed up those processes nearly as much as it ideally might. so the ai world before us is rather rapidly being bifurcated into two sectors a progress already is extreme, and is hard to improve upon, and b progress is ongoing, but will take a long time to be visible to actual users and consumers and so people will complain that ai progress is failing us, but mostly they will be wrong. they will be the victim of cognitive error and biases. the reality is that progress is continuing apace, but it swallows up and renders ordinary some of its more visible successes. what is left behind for future progress can be pretty slow. yet another periodic reminder that mr and the zvi are both must-read for everyone.",
    "preview": "jeremy lin retires after 15 years that included linsanity with the knicks nyt the journeyman played for eight n.b.a. teams and won one championship. but he is best known for a brief stretch on the kni...",
    "content": "\nJeremy Lin Retires After 15 Years That Included ‘Linsanity’ With the Knicks (NYT): \n\nThe journeyman played for eight N.B.A. teams and won one championship. But he is best known for a brief stretch on the Knicks where he electrified fans and the nation.\n\n How to feel old #3892: Linsanity for 13 years ago and I remember it like it was yesterday!\n\nHow to resist everyday temptations: A guide we can all use, but probably won&#39;t. \n\nYou&#39;re Overthinking Packing: \n\nThe amount of planning and thou"
  },
  {
    "id": "links-30-aug-2025",
    "title": "Links: Week of 30 Aug 2025",
    "url": "posts/2025/links-30-aug-2025.html",
    "date": "2025-08-30T00:00:00.000Z",
    "dateFormatted": "August 30, 2025",
    "excerpt": "1. [IST: Indian Spotlight Time](https://indianspotlighttime.substack.com/): \n    > Exploring the India that often escapes headlines through the lived ...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "tokens",
      "more",
      "expensive",
      "something",
      "2025",
      "links",
      "week",
      "aug",
      "ist",
      "indian",
      "spotlight",
      "time",
      "exploring",
      "india",
      "often",
      "escapes",
      "headlines",
      "lived",
      "experiences",
      "abcg",
      "american",
      "born",
      "confused",
      "gora",
      "look",
      "beyond",
      "polished",
      "narratives",
      "obvious",
      "beautiful",
      "contradictions",
      "actually",
      "power",
      "country",
      "getting",
      "good",
      "discussion",
      "why",
      "labs",
      "might",
      "stuggle",
      "profitability",
      "while",
      "true",
      "each",
      "generation",
      "frontier",
      "model",
      "didn",
      "get"
    ],
    "searchableText": "ist indian spotlight time exploring the india that often escapes headlines through the lived experiences of an abcg american born confused gora. it s a look beyond polished narratives and the obvious into the beautiful contradictions that actually power the country. tokens are getting more expensive a good discussion of why the ai labs might stuggle with profitability. while it 39 s true each generation of frontier model didn 39 t get more expensive per token, something else happened. something worse. the number of tokens they consumed went absolutely nuclear. patrick oshaughnessy podcast with joe liemandt, principal alpha school failure of imagination is the only thing holding us back!",
    "preview": "ist indian spotlight time exploring the india that often escapes headlines through the lived experiences of an abcg american born confused gora. it s a look beyond polished narratives and the obvious ...",
    "content": "\nIST: Indian Spotlight Time: \n\nExploring the India that often escapes headlines through the lived experiences of an ABCG: American Born Confused Gora. It’s a look beyond polished narratives and the obvious into the beautiful contradictions that actually power the country.\n\n\n\n\n\n  \n    \n  \n\n\n\ntokens are getting more expensive: A good discussion of why the AI Labs might stuggle with profitability. \n\nwhile it&#39;s true each generation of frontier model didn&#39;t get more expensive per token, somet"
  },
  {
    "id": "links-23-aug-2025",
    "title": "Links: Week of 23 Aug 2025",
    "url": "posts/2025/links-23-aug-2025.html",
    "date": "2025-08-23T00:00:00.000Z",
    "dateFormatted": "August 23, 2025",
    "excerpt": "1. [Why Is Martha’s Vineyard Going Vegan? It’s All About Tick Bites. (NYT)](https://www.nytimes.com/2025/08/12/dining/marthas-vineyard-alpha-gal-tick-...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "camp",
      "people",
      "all",
      "some",
      "animals",
      "chatgpt",
      "what",
      "gpt",
      "can",
      "most",
      "many",
      "long",
      "said",
      "weather",
      "think",
      "not",
      "work",
      "world",
      "prompting",
      "guide",
      "model",
      "why",
      "going",
      "tick",
      "bites",
      "which",
      "known",
      "alpha",
      "syndrome",
      "new",
      "who",
      "samosas",
      "find",
      "hard",
      "when",
      "along",
      "other",
      "deep",
      "indian",
      "high",
      "there",
      "media",
      "events",
      "make",
      "even",
      "seen",
      "woo",
      "experience",
      "too",
      "outside"
    ],
    "searchableText": "why is martha s vineyard going vegan? it s all about tick bites. nyt on the porch of the chilmark general store and at sunset-watching parties on menemsha beach, conversations circle ineluctably to the lone star tick, which after a single bite can leave people with a life-threatening allergy to most meat and dairy. known as alpha-gal syndrome, the condition is changing the way many people shop, cook and eat in a place long known as a food-lover s retreat for its thriving independent farms and restaurants. these new habits may prove to be lasting, as some islanders who initially avoided beef and cheese temporarily, out of necessity, later give them up for good out of preference. it s sort of supersized vegetarianism, said rebecca miller, a farm owner who has the syndrome herself. are samosas unhealthy? some indians find official advice hard to swallow. so, when a recent government advisory put samosas along with other deep-fried indian snacks and western foods such as burgers and french fries on a list of things that should be eaten in moderation because of their high oil and sugar content, there was an unsurprising outcry. social media erupted with memes, and indian media chimed in to say the country s most iconic bites were under attack. rivatez that animals seemingly anticipate events should humble us more. changes in groundwater chemistry, electromagnetic fields and sound waves make animals restless, distressed and even relocate in the west it is seen as woo to contemplate that energy weather humans don t consciously experience can affect our psychology, and yet we forget that we are animals too. even outside extreme weather events, the lunar cycle moves oceans, huge bodies of water. we are, like all animals, primarily made of water. the word lunacy comes from the ancient understanding that our minds can be affected by it an interesting experiment is to log your daily mood for a few months- ups and downs, anxiety joy levels, big arguments with loved ones etc. then afterwards, retroactively chart it against lunar cycles and nasa space weather data that tracks geomagnetic storms, solar flares etc. be open- minded and try it. i, too, used to think this stuff was bs now i think much of modern psychiatry is giving people drugs to tune down people s individual responses to these external inputs, eg bipolar might just indicate high sensitivity how many important scientific breakthroughs lie on the other side of our collective dismissal of woo ? why i believe in agi again first, i m now convinced that chatgpt understands what it reads. second, reasoning models persuade me that chatgpt is creative. third, chatgpt summarizes texts extremely well, which i believe to be a robust measure of intelligence. derek thompson quot the better news is that this is happening at a time when exercise seems to be increasing for many groups, especially the young and old. the bad news is ... deep medicaid cuts and declines in childhood vaccine uptake are not exactly optimistic predictors of american health. quot your review dating men in the bay area not what it says on the label at all! recommended. adults are going to sleep-away camp to make friends. it seems to actually work. anyone that has worked at camp or grown up in the camp world understands there is a powerful people connection that forms at camp, said liam macleod, a longtime camp professional and marketing director at camp no counselors. it s camp magic and it s hard to replicate in the regular world. what is the most profitable thing you have done with chatgpt? on reddit via simon willison in dollar terms, probably crafting fundraising messages for charity event organized by my alumni association. in real terms, physiotherapy for my back and legs. so far. some great examples at the link. failure of imagination remains the biggest hurdle in getting value from llms. ai is designing bizarre new physics experiments that actually work it took months of effort to understand what the ai was doing. it turned out that the machine had used a counterintuitive trick to achieve its goals. it added an additional three-kilometer-long ring between the main interferometer and the detector to circulate the light before it exited the interferometer s arms. adhikari s team realized that the ai was probably using some esoteric theoretical principles that russian physicists had identified decades ago to reduce quantum mechanical noise. no one had ever pursued those ideas experimentally. it takes a lot to think this far outside of the accepted solution, adhikari said. we really needed the ai. gpt-5 prompting guide gpt-5, our newest flagship model, represents a substantial leap forward in agentic task performance, coding, raw intelligence, and steerability. while we trust it will perform excellently out of the box across a wide range of domains, in this guide we ll cover prompting tips to maximize the quality of model outputs, derived from our experience training and applying the model to real-world tasks. we discuss concepts like improving agentic task performance, ensuring instruction adherence, making use of newly api features, and optimizing coding for frontend and software engineering tasks - with key insights into ai code editor cursor s prompt tuning work with gpt-5. we ve seen significant gains from applying these best practices and adopting our canonical tools whenever possible, and we hope that this guide, along with the prompt optimizer tool we ve built, will serve as a launchpad for your use of gpt-5. but, as always, remember that prompting is not a one-size-fits-all exercise - we encourage you to run experiments and iterate on the foundation offered here to find the best solution for your problem. and a tutorial by anthropic. class dismissed alpha school is getting a lot of coverage all of a sudden. long piece about the people and the tech behind it.",
    "preview": "why is martha s vineyard going vegan? it s all about tick bites. nyt on the porch of the chilmark general store and at sunset-watching parties on menemsha beach, conversations circle ineluctably to th...",
    "content": "\nWhy Is Martha’s Vineyard Going Vegan? It’s All About Tick Bites. (NYT): \n\nOn the porch of the Chilmark General Store and at sunset-watching parties on Menemsha Beach, conversations circle ineluctably to the lone star tick, which after a single bite can leave people with a life-threatening allergy to most meat and dairy.\n\n\n\nKnown as alpha-gal syndrome, the condition is changing the way many people shop, cook and eat in a place long known as a food-lover’s retreat for its thriving independent far"
  },
  {
    "id": "links-16-aug-2025",
    "title": "Links: Week of 16 Aug 2025",
    "url": "posts/2025/links-16-aug-2025.html",
    "date": "2025-08-16T00:00:00.000Z",
    "dateFormatted": "August 16, 2025",
    "excerpt": "1. [Face it: you're a crazy person](https://www.experimental-history.com/p/face-it-youre-a-crazy-person): \n    > I meet a lot of people who don’t like...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "water",
      "coffee",
      "all",
      "people",
      "like",
      "one",
      "how",
      "not",
      "things",
      "there",
      "path",
      "person",
      "what",
      "here",
      "third",
      "well",
      "without",
      "meet",
      "don",
      "ask",
      "say",
      "really",
      "love",
      "shop",
      "beans",
      "much",
      "cost",
      "house",
      "interesting",
      "because",
      "easy",
      "running",
      "business",
      "know",
      "almost",
      "life",
      "old",
      "half",
      "always",
      "transitional",
      "period",
      "want",
      "willing",
      "other",
      "saying",
      "rock",
      "roof",
      "struck",
      "nyt",
      "same"
    ],
    "searchableText": "face it you 39 re a crazy person i meet a lot of people who don t like their jobs, and when i ask them what they d rather do instead, about 75 say something like, oh, i dunno, i d really love to run a little coffee shop. if i m feeling mischievous that day, i ask them one question where would you get the coffee beans? if that s a stumper, here are some followups which kind of coffee mug is best? how much does a la marzocco espresso machine cost? would you bake your blueberry muffins in-house or would you buy them from a third party? the point of the coffee beans procedure is this if you can t answer those questions, if you don t even find them interesting , then you should not open a coffee shop, because this is how you will spend your days as a cafe owner. you will not be sitting droopy-lidded in an easy chair, sipping a latte and greeting your regulars as you page through anna karenina . you will be running a small business that sells hot bean water. 50 things i know. and wish i 39 d known sooner it s almost impossible to have an easy life and be interesting. suffering is what gives people texture. and heaven is a set of gradually increasing but attainable challenges. listicle has become a bad word but there is a reason they are popular. a well done one is chef 39 s kiss . 27 notes on growing old er the physicist michael nielsen tells us that the polish-american mathematician stanislaw ulam perceived his life as sharply divided into two halves in the first half, he was always the youngest person in the group. in the second half, he was always the oldest. there was no transitional period. there was no transitional period. and ... the human condition is that we want it all, and we re not willing to make trades deathbed regrets typically have the bias of wanting the other path the path they could have taken without considering the cost of that path. so they say, hey i was really successful and i did all these things, but you know, i would give it all up today to have my family. it s like, well yeah, but you didn t, because you actually chose the path that you re on, and you weren t willing to do that. what you are saying right now is that you want it all. sure. so does everyone. mad respect for whoever decided that there was a business opportunity here and then made it happen. space rock that punched through roof almost struck resident nyt i suspect that he heard three simultaneous things, mr. harris said of the person whose home was hit. one was the collision with his roof, one was a tiny cone of a sonic boom, and a third was it impacting the floor all in the same moment. looking at the photos, i think he would have died if it had struck him. here 39 s another amazing ancient rock story from the nyt. performance art? the ratio of members! great thread from a master. love how he says so much without saying anything. see the photos in the third tweet for a masterpiece as he puts it, the 3rd and the 4th slide. . the infinite well how innovation keeps water flowing solutions from experts follow a familiar pattern, claiming that the only way to avert a crisis is to adopt radical social and behavioral changes, driven by moral proselytizing, government intervention, or both, to save the water supply. environmentalists urge people to replace old toilets with low-flow models, avoid running faucets while brushing their teeth or washing dishes, and switch to eating less water-intensive foods. meanwhile, activists pressure elected officials to impose usage restrictions, ban certain crops in arid regions, and regulate everything from swimming pools to car washes. fortunately the economics of water innovation reveals why the apparent scarcity tends to be self-correcting, without requiring us to adopt ascetic lifestyles or perform symbolic actions like picking up dropped ice cubes to water house plants or writing letters to elected officials. rising prices, not moralizing pleas, lead people to conserve, look for substitutes, recycle resources, and innovate helping to meet demand through alternative means or improved efficiency. the same principles apply to many other things too.",
    "preview": "face it you 39 re a crazy person i meet a lot of people who don t like their jobs, and when i ask them what they d rather do instead, about 75 say something like, oh, i dunno, i d really love to run a...",
    "content": "\nFace it: you&#39;re a crazy person: \n\nI meet a lot of people who don’t like their jobs, and when I ask them what they’d rather do instead, about 75% say something like, “Oh, I dunno, I’d really love to run a little coffee shop.” If I’m feeling mischievous that day, I ask them one question: “Where would you get the coffee beans?”\n\n\n\nIf that’s a stumper, here are some followups: Which kind of coffee mug is best? How much does a La Marzocco espresso machine cost? Would you bake your blueberry muff"
  },
  {
    "id": "links-09-aug-2025",
    "title": "Links: Week of 09 Aug 2025",
    "url": "posts/2025/links-09-aug-2025.html",
    "date": "2025-08-09T00:00:00.000Z",
    "dateFormatted": "August 9, 2025",
    "excerpt": "1. [How to Teach Your Kids Poker, the Easy Way](https://www.bloomberg.com/news/articles/2025-08-08/how-to-teach-your-kids-poker-with-one-card-at-age-f...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "card",
      "bet",
      "poker",
      "one",
      "everyone",
      "there",
      "can",
      "ace",
      "not",
      "stuff",
      "way",
      "else",
      "last",
      "potatoes",
      "highest",
      "hands",
      "though",
      "win",
      "probably",
      "might",
      "game",
      "than",
      "since",
      "pdf",
      "teach",
      "kids",
      "which",
      "check",
      "call",
      "when",
      "who",
      "hand",
      "wins",
      "king",
      "two",
      "order",
      "remember",
      "queen",
      "beats",
      "learn",
      "lot",
      "other",
      "raises",
      "six",
      "estimate",
      "won",
      "able",
      "pair",
      "five",
      "mashed"
    ],
    "searchableText": "how to teach your kids poker, the easy way the right way to begin is with one-card poker. everyone antes one chip and gets one card, face down. you look at your card. there s a single round of betting, which proceeds around the table if no one else has bet, you can bet or check do nothing if anyone in front of you has bet, you can call or match the bet , raise or fold. when everyone has called the last bet or folded, those who are left in the hand show their card. the highest card wins ace is highest, then king, so on down to two. that s it. no pairs, no flushes, no full houses, no complicated order of hands to remember, though you do have to remember that a queen beats a jack. but you learn a lot of poker. you will always win with an ace, but you have to learn to maximize the value of your ace, to induce other people to bet into you and call your raises. one of my proudest moments as a parent was when my daughter first check-raised me with an ace. you ll probably win with a king, but if someone raises you, does that mean that they have an ace and have you beat , or a queen and are overconfident , or a six and are bluffing ? there are 52 cards, so you can estimate the probabilities if you are mathematically inclined, though if you are four you probably won t. you probably won t win with a six, but if you bet it confidently you might bluff everyone else out. if everyone else checks, and you re the last person to bet, you might as well bet you have position, everyone else has a weak hand, and you might be able to steal a pot. the essentials are there. once the kids have mastered this, you can introduce the order of hands gently with two-card poker. any pair beats a high card, highest pair wins. then teach the rest with five-card straight poker. this isn t a great game, but it s a brief stopover on the way to five-card draw, which is a perfectly respectable poker game. texas hold em is not far behind. my father 39 s instant mashed potatoes the chu o-chomping incans were not the last military to rely on dehydrated potatoes for sustenance. in world war ii, the us army experimented with various forms of potato dehydration to help stretch supply lines. the easiest way to get a uniform potato commodity into the hands of g.i.s was to pulverize the potatoes into granules, dehydrate them, and then plan on bringing them back to life with boiling water in an imitation of mashed potatoes . deeper than i would have imagined from the title. a lot more than you wanted to read on college and college admissions . depressing. the imitation game defending against ai 39 s dark side! a few weeks ago, i started receiving a stream of message about an instagram post that i was allegedly starring in, where after offering my views on palantir 39 s valuation, i was soliciting investors to invest with me or with an investment entity that had ties to me . i was not surprised, since i have lived with imitations for years, but i was bemused, since i don 39 t have an instagram account and have not posted on facebook more than once or twice in a decade. in the last few days, those warnings have been joined by others, who have noted that there is now a video that looks and sounds like me, adding to the sales pitch with promises of super-normal returns if they reach out, and presumably send their money in. please don 39 t go looking for these scams online, since the very act of clicking on them can expose you to their reach. it was a matter of time. gpt-5 it just does stuff gpt-5 just does stuff, often extraordinary stuff, sometimes weird stuff, sometimes very ai stuff, on its own. and that is what makes it so interesting. to be clear this wasn 39 t my experience. i gave it a pdf and asked it to estimate something based on the data in the file. it made up all the numbers and suggested they were in tables and pages that didn 39 t exist in the pdf. i was not able to get it focused on the actual information in the pdf despite multiple reminders and other attempts. apparently though, there was a bug in their system yesterday that made it appear dumber. i will try again.",
    "preview": "how to teach your kids poker, the easy way the right way to begin is with one-card poker. everyone antes one chip and gets one card, face down. you look at your card. there s a single round of betting...",
    "content": "\nHow to Teach Your Kids Poker, the Easy Way: \n\nThe right way to begin is with one-card poker. Everyone antes one chip and gets one card, face down. You look at your card. There’s a single round of betting, which proceeds around the table: If no one else has bet, you can bet or check (do nothing); if anyone in front of you has bet, you can call (or match the bet), raise or fold. When everyone has called the last bet or folded, those who are left in the hand show their card. The highest card wins:"
  },
  {
    "id": "links-02-aug-2025",
    "title": "Links: Week of 02 Aug 2025",
    "url": "posts/2025/links-02-aug-2025.html",
    "date": "2025-08-02T00:00:00.000Z",
    "dateFormatted": "August 2, 2025",
    "excerpt": "1. [Philosopher–Builder Summer Reads](https://blog.cosmos-institute.org/p/philosopherbuilder-summer-reads-2025https://blog.cosmos-institute.org/p/phil...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "quot",
      "what",
      "plan",
      "tool",
      "like",
      "doge",
      "good",
      "much",
      "ocean",
      "federal",
      "000",
      "powerpoint",
      "waves",
      "trying",
      "back",
      "week",
      "can",
      "regulations",
      "roughly",
      "which",
      "plans",
      "worthy",
      "right",
      "within",
      "detail",
      "who",
      "doing",
      "means",
      "something",
      "kinda",
      "nice",
      "thought",
      "color",
      "started",
      "looked",
      "saw",
      "fucking",
      "amazing",
      "felt",
      "face",
      "found",
      "too",
      "feel",
      "more",
      "than",
      "life",
      "look",
      "now",
      "wasn",
      "really"
    ],
    "searchableText": "philosopher builder summer reads these aren 39 t generic quot tech books. quot they 39 re works that can shape how serious builders think about what they 39 re creating and why. and the original essay. doge builds ai tool to cut 50 percent of federal regulations the tool, called the doge ai deregulation decision tool, is supposed to analyze roughly 200,000 federal regulations to determine which can be eliminated because they are no longer required by law, according to a powerpoint presentation obtained by the post that is dated july 1 and outlines doge s plans. roughly 100,000 of those rules would be deemed worthy of trimming, the powerpoint estimates mostly through the automated tool with some staff feedback. the powerpoint also suggests the ai tool will save the united states trillions of dollars by reducing compliance requirements, slashing the federal budget and unlocking unspecified external investment. a worthy goal for doge and possibly the right use of ai. if done well. america 39 s ai action plan is pretty good otherwise, while this is far from a perfect plan or the plan i would choose, on the substance it is a good plan, a positive plan, with many unexpectedly good plans within it. there is a lot of attention to detail in ways those i ve asked say reflect people who actually know what they are doing, which was by no means something to be taken for granted. it is hard to imagine that a much better plan could have been approved given who was doing the approving. two long amp good pieces on india this week though i have yet to fully read both. jhanas and jhourney so i went down to the beach. quot kinda nice quot , i thought. the sky had a particularly vibrant blue color, the waves had 39 the right size 39 , their roar was pleasant. i started to walk around trying to continue meditating. i focused my awareness on an arising sensation of open heartedness and then i noticed my eyes tearing up quot huh? i thought quot . i looked again at the ocean and then i saw it. it was fucking amazing. so much color and detail waves within waves, the fractal structure of the foamy crests as they disintegrate back into the ocean. the feeling of the sun on my skin. i felt overwhelmed. as tears ran down my face and lowkey insane grin settled on my face i found myself mumbling quot it 39 s... always been like this!!!! quot quot what the fuck??! quot followed by quot this is too much!! too much!!! quot . the experience seemed to be demanding from me to feel more joy and awe than i was born to feel or something like that. in that precise moment i felt what quot painfully beautiful quot means for the first time in my life. i had to look away. i calmed a bit. i walked a few steps and looked back. the exact same thing happened. quot it 39 s reproducible, hihihihi quot , and i started laughing. then i found a log to sit on, calm down, and look back at the ocean. now it wasn 39 t overwhelming, but quot kinda nice quot was now quot fucking amazing quot . to do list. yes, adam sandler really is a pickup basketball god nyt paywall jackson was struck by the man s attire extra-baggy shorts and an extra-baggy yellow t-shirt. i m trying to figure out does he buy clothes? did he buy them and then just stop buying them? his clothes really might have been from 2008. it soon became apparent, however, that the guy could play. he was a true court general. he impressed jackson with his basketball iq. life in deep when her three-person submersible descended more than 30,000 feet into one of the pacific ocean s deepest trenches, mengran du wasn t sure what they would find. what she saw, she recalled, was unbelievable dense clusters of tubeworms with tentacles tinged bloodred, jutting up like skyscrapers. iridescent snails scaling the worms, like window washers. bristly, white creatures wriggling between them like rush-hour commuters trying to get home for dinner. 10.",
    "preview": "philosopher builder summer reads these aren 39 t generic quot tech books. quot they 39 re works that can shape how serious builders think about what they 39 re creating and why. and the original essay...",
    "content": "\nPhilosopher–Builder Summer Reads: \n\nThese aren&#39;t generic &quot;tech books.&quot; They&#39;re works that can shape how serious builders think about what they&#39;re creating and why.\n\n And the original essay.\n\nDOGE builds AI tool to cut 50 percent of federal regulations: \n\nThe tool, called the “DOGE AI Deregulation Decision Tool,” is supposed to analyze roughly 200,000 federal regulations to determine which can be eliminated because they are no longer required by law, according to a PowerPoi"
  },
  {
    "id": "links-26-jul-2025",
    "title": "Links: Week of 26 Jul 2025",
    "url": "posts/2025/links-26-jul-2025.html",
    "date": "2025-07-26T00:00:00.000Z",
    "dateFormatted": "July 26, 2025",
    "excerpt": "Some readers have commented that I am obsessed with AI. This is not correct. I wish I was. But is there anything more interesting happening in the wor...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "quot",
      "there",
      "brain",
      "2025",
      "don",
      "art",
      "can",
      "what",
      "volume",
      "cocktails",
      "2021",
      "more",
      "world",
      "now",
      "musician",
      "who",
      "composing",
      "new",
      "music",
      "project",
      "behind",
      "american",
      "lucier",
      "electrical",
      "grown",
      "life",
      "around",
      "listen",
      "suppliers",
      "difference",
      "charge",
      "yes",
      "models",
      "costs",
      "won",
      "economy",
      "look",
      "like",
      "hotel",
      "all",
      "every",
      "iba",
      "list",
      "official",
      "102",
      "200",
      "links",
      "week",
      "jul",
      "some"
    ],
    "searchableText": "some readers have commented that i am obsessed with ai. this is not correct. i wish i was. but is there anything more interesting happening in the world right now? i don 39 t think so. musician who died in 2021 resurrected as clump of brain matter, now composing new music art can outlast the artist but what about their artistic impulses? a new art installation project in australia, titled quot revivification, quot raises this question with a very literal interpretation of quot impulse quot using his dna, the team behind the project have performed a quasi-resurrection of the late experimental american composer alvin lucier, creating a sort of brain that continuously composes music on the fly with its errant electrical signals. at the center of the piece is an quot in-vitro brain, quot grown from blood that lucier, who passed away in 2021, donated in the final years of his life. housed in a plinth, it 39 s grown on top of an electrode mesh that connects it to twenty large brass plates placed around the room. visitors can listen as the brain fires off electrical pulses that trigger a transducer and a mallet behind each plate, striking them to produce sound. is this art? is this science? is this composing? gross ery confusion teachout s idea that suppliers make up the difference by charging smaller stores more is also economically incoherent. profit-maximizing firms already charge what the market will bear. if costco s volume justifies a discount, that doesn t mean suppliers can or should charge higher prices to other buyers. yes, there are models where costs change with volume but costs could go down with volume and, in any case, those models don t rely on the folk theory of making up the difference. ais and spontaneous order this isn t to say ai won t help improve economic policy it might, if we listen. but the future economy won t look like a centrally planned machine. it will look like an economy of von neumanns autonomous agents buying, selling, and strategizing in complex interaction. i analysed 25,000 hotel names and found four surprising truths and yes, the cat s out of the bag there are over 200 hotels bristol worldwide, and the reason goes all the way back to an 18th-century english aristocrat whose hotel preferences turned into a naming tradition. i drank every cocktail the international bartenders association, or iba, maintains a list of official cocktails, ones they deem to be the most requested recipes at bars all around the world. it s the closest thing the bartending industry has to a canonical list of cocktails, akin to the american kennel club s registry of dog breeds or a jazz musician s real book of standards. as of 2025, there are 102 iba official cocktails, and as of july 12, 2025, i ve had every one of them. legend. how the system works an essay series on the hidden mechanisms that support modern life and what happens if we don t maintain them this should be amazing. so far, agriculture, water and electricity.",
    "preview": "some readers have commented that i am obsessed with ai. this is not correct. i wish i was. but is there anything more interesting happening in the world right now? i don 39 t think so. musician who di...",
    "content": "Some readers have commented that I am obsessed with AI. This is not correct. I wish I was. But is there anything more interesting happening in the world right now? I don&#39;t think so.\n\nMusician Who Died in 2021 Resurrected as Clump of Brain Matter, Now Composing New Music:\n\nArt can outlast the artist — but what about their artistic impulses?\n\n\n\nA new art installation project in Australia, titled &quot;Revivification,&quot; raises this question with a very literal interpretation of &quot;impuls"
  },
  {
    "id": "links-21-jul-2025",
    "title": "Links: Week of 19 Jul 2025",
    "url": "posts/2025/links-21-jul-2025.html",
    "date": "2025-07-21T00:00:00.000Z",
    "dateFormatted": "July 21, 2025",
    "excerpt": "1. [The Diaspora Paradox](https://substack.com/inbox/post/168173740) Second in a series from [Samir Varma](https://substack.com/@samirvarma)\n    > But...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "kids",
      "why",
      "india",
      "sputnik",
      "who",
      "become",
      "new",
      "marriage",
      "born",
      "get",
      "three",
      "what",
      "openai",
      "french",
      "paradox",
      "second",
      "series",
      "more",
      "first",
      "scientists",
      "called",
      "science",
      "nature",
      "modern",
      "families",
      "organizing",
      "gatherings",
      "can",
      "know",
      "each",
      "other",
      "not",
      "babies",
      "using",
      "people",
      "egg",
      "moment",
      "response",
      "increased",
      "funding",
      "math",
      "foreign",
      "like",
      "deepseek",
      "reflections",
      "there",
      "lot",
      "imo",
      "fry",
      "foods"
    ],
    "searchableText": "the diaspora paradox second in a series from samir varma but here 39 s the paradox that has haunted me for decades why do so many indians who escape india 39 s constraints become more indian abroad? why does the uncle who couldn 39 t be bothered to visit temples in mumbai suddenly become a founding member of the hindu temple in new jersey? why does the software engineer who rebelled against arranged marriage in bangalore now insist their american-born daughter marry within the community? the first in 30 years scientists discover new class of antibiotics led by scientist gerry wright, the team has discovered a powerful new molecule called lariocidin. this promising candidate shows the ability to fight some of the toughest, most drug-resistant bacteria known to science. their groundbreaking findings were published in the journal nature. why we re surrounding our kids with ai we also don t plan on perpetuating modern western parents egregiously hands-off nature with regard to their kids dating and marriage prospects. we already have a going list of agentic, thoughtful, high-achieving families whose kids are close to our kids in age as our kids get older, we ll start organizing gatherings for families in this network where our kids can hang out and get to know each other trips, summer camps, discord servers, study groups, etc. . as our kids reach their late teens and early 20s, we ll begin organizing modern versions of the london season a series of events and gatherings at which our single kids ready for marriage can meet, mix, and get to know each other. did not see this coming. babies made using three people 39 s dna are born free of hereditary disease eight babies have been born in the uk using genetic material from three people to prevent devastating and often fatal conditions, doctors say. the method, pioneered by uk scientists, combines the egg and sperm from a mum and dad with a second egg from a donor woman. the sputnik vs. deep seek moment the answers i pointed out that the us response to sputnik was fierce competition. following sputnik, we increased funding for education, especially math, science and foreign languages, organizations like arpa were spun up, federal funding for r amp d was increased, immigration rules were loosened, foreign talent was attracted and tariff barriers continued to fall. in contrast, the response to what i called the deepseek moment has been nearly the opposite. why did sputnik spark investment while deepseek sparks retrenchment? i examine four explanations from the comments and argue that the rise of zero-sum thinking best fits the data. reflections on openai i left openai three weeks ago. i had joined the company back in may 2024. i wanted to share my reflections because there 39 s a lot of smoke and noise around what openai is doing, but not a lot of first-hand accounts of what the culture of working there actually feels like. chatgpt agent and gold-medal level performance in international math olympiad imo . more on the imo . psychological techniques to persuade ai . spud-tacular how india became a french fry superpower gujarat has become india 39 s capital of french fry production, home to huge factories churning out chips, including facilities belonging to canadian giant mccain foods and india 39 s biggest maker of french fries, hyfun foods. bill ackman changed tennis forever.",
    "preview": "the diaspora paradox second in a series from samir varma but here 39 s the paradox that has haunted me for decades why do so many indians who escape india 39 s constraints become more indian abroad? w...",
    "content": "\nThe Diaspora Paradox Second in a series from Samir Varma\n\nBut here&#39;s the paradox that has haunted me for decades: Why do so many Indians who escape India&#39;s constraints become more Indian abroad? Why does the uncle who couldn&#39;t be bothered to visit temples in Mumbai suddenly become a founding member of the Hindu temple in New Jersey? Why does the software engineer who rebelled against arranged marriage in Bangalore now insist their American-born daughter marry within the community?\n\n"
  },
  {
    "id": "links-12-jul-2025",
    "title": "Links: Week of 12 Jul 2025",
    "url": "posts/2025/links-12-jul-2025.html",
    "date": "2025-07-12T00:00:00.000Z",
    "dateFormatted": "July 12, 2025",
    "excerpt": "1. [Terrified Girls, Helicopters and a Harrowing Scene: A Rescuer’s Account at Camp Mystic (NYT)](https://www.nytimes.com/2025/07/06/us/texas-floods-r...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "scene",
      "girls",
      "camp",
      "ruskan",
      "more",
      "between",
      "days",
      "summer",
      "temperature",
      "165",
      "2000",
      "2020",
      "2025",
      "links",
      "week",
      "jul",
      "terrified",
      "helicopters",
      "harrowing",
      "rescuer",
      "account",
      "mystic",
      "nyt",
      "scott",
      "coast",
      "guard",
      "swimmer",
      "credited",
      "saving",
      "people",
      "all",
      "deadly",
      "floods",
      "central",
      "texas",
      "realized",
      "staying",
      "free",
      "two",
      "extra",
      "spots",
      "helicopter",
      "evacuees",
      "said",
      "told",
      "unit",
      "love",
      "stay",
      "lot",
      "good"
    ],
    "searchableText": "terrified girls, helicopters and a harrowing scene a rescuer s account at camp mystic nyt scott ruskan, a coast guard swimmer, is credited with saving 165 people at the all-girls camp from deadly floods in central texas. mr. ruskan realized that staying on scene would free up two extra spots on his helicopter for the evacuees, he said, so he told his unit, i d love to stay, i could do a lot more good on the ground. he became the main person on scene to both triage and provide emotional support to the survivors. hero. death of partying in the usa the forests are coming back 36 countries, including india and china, gained more tress than they lost, between 2000-2020. levelsio speaks to john collison for a few days this summer, your days will be just a smidge shorter wapo during the summer, the northern hemisphere is tilted toward the sun, which minimizes the difference in temperature between the equator and earth s poles. this smaller temperature variation slows down the jet stream a narrow band of strong winds around 30,000 feet above us and moves it northward.",
    "preview": "terrified girls, helicopters and a harrowing scene a rescuer s account at camp mystic nyt scott ruskan, a coast guard swimmer, is credited with saving 165 people at the all-girls camp from deadly floo...",
    "content": "\nTerrified Girls, Helicopters and a Harrowing Scene: A Rescuer’s Account at Camp Mystic (NYT):\n\nScott Ruskan, a Coast Guard swimmer, is credited with saving 165 people at the all-girls’ camp from deadly floods in Central Texas.\n\n\n\nMr. Ruskan realized that staying on scene would free up two extra spots on his helicopter for the evacuees, he said, so he told his unit, “I’d love to stay, I could do a lot more good on the ground.”\n\n\n\nHe became the main person on scene to both triage and provide emot"
  },
  {
    "id": "links-05-jul-2025",
    "title": "Links: Week of 05 Jul 2025",
    "url": "posts/2025/links-05-jul-2025.html",
    "date": "2025-07-05T00:00:00.000Z",
    "dateFormatted": "July 5, 2025",
    "excerpt": "1. [John Oliver on AI Slop](https://youtu.be/TWpg1RmzAbc?si=lXPyhNZJoJrS9gDC): \n    ![embed](https://youtu.be/TWpg1RmzAbc?si=lXPyhNZJoJrS9gDC)\n    Joh...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "only",
      "more",
      "cps",
      "scale",
      "investigations",
      "growth",
      "interventions",
      "than",
      "medical",
      "microsoft",
      "not",
      "also",
      "john",
      "oliver",
      "people",
      "all",
      "maltreatment",
      "reports",
      "number",
      "probably",
      "cases",
      "involve",
      "neglect",
      "false",
      "both",
      "can",
      "gdp",
      "real",
      "diagnoses",
      "new",
      "medicine",
      "doctors",
      "doctor",
      "need",
      "diagnose",
      "when",
      "300",
      "400",
      "2025",
      "links",
      "week",
      "jul",
      "slop",
      "always",
      "funny",
      "often",
      "insightful",
      "defeating",
      "virus",
      "killed"
    ],
    "searchableText": "john oliver on ai slop john oliver is always funny and often insightful. defeating a virus that killed half a billion people - the plea . timely and important. trigger warning images of diseased people. operation midnight hammer what a story. helicopter money. literally. talk about going out in style. does cps investigate one third of all children in the us? yes. but... the scale of cps investigations in the us is staggering. like all things, this trend began in the late 60s and early 70s as mandatory reporter laws expanded and caused massive growth in child maltreatment reports. since the 90s, the number of reports has stayed pretty stable and the number of substantiated investigations and interventions has been falling. the cps could probably scale back it s interventions for cases of maltreatment that only involve neglect, especially those that only involve lack of supervision rather than physical neglect. other tradeoffs between false positive and false negative investigations and interventions are more difficult to have a strong opinion on given the terrible outcomes on both sides of the trolley track. there are probably some available pareto improving moves. the most straightforward in my view would be increasing staffing and state capacity in family courts so that cases can be reviewed more accurately and without requiring months or years of effort and tens of thousands of dollars on the part of the parents. tech c.e.o. pays 400,000 to conduct the toronto symphony nyt after the performance, cheung and the orchestra received a standing ovation. he said he was grateful for the opportunity. will ai drive 20 annual gdp growth? steam, electricity, computers delivered enormous benefits while their economic importance shrank through success. ai will transform society profoundly. but 20 gdp growth? history says no. medical superintelligence from microsoft? microsoft 39 s llm is not only designed for multiple-choice questions, but also for real medical diagnoses in realistic scenarios and outperforms even top models such as o3. in a large-scale study with over 300 case studies from the new england journal of medicine, the system achieved a diagnostic accuracy of over 80 . this is not only four times higher than the participating doctors, but also marks a qualitative leap the ai was not only more accurate, but also made more economical decisions with around 20 lower costs because it avoided unnecessary tests. a doctor responds microsoft claims their new ai framework diagnoses 4x better than doctors. i 39 m a medical doctor and i actually read the paper. here 39 s my perspective on why this is both impressive and misleading ... ... final thought we don 39 t need ai that can diagnose every rare disease. we need ai that knows when to diagnose and when to reassure. that 39 s the real art of medicine. gymnastics bot using lego spike prime . my weekend project.",
    "preview": "john oliver on ai slop john oliver is always funny and often insightful. defeating a virus that killed half a billion people - the plea . timely and important. trigger warning images of diseased peopl...",
    "content": "\nJohn Oliver on AI Slop:\n\n\n  \n  \n\n    John Oliver is always funny and often insightful. \n\n\nDefeating a Virus That Killed Half a Billion People - The Plea. Timely and important. Trigger warning: Images of diseased people. \n\nOperation Midnight Hammer: What a story. \n\nHelicopter Money. Literally. Talk about going out in style. \n\nDoes CPS Investigate One Third of All Children in the US? Yes. But...\n\nThe scale of CPS investigations in the US is staggering. Like all things, this trend began in the lat"
  },
  {
    "id": "links-28-jun-2025",
    "title": "Links: Week of 28 Jun 2025",
    "url": "posts/2025/links-28-jun-2025.html",
    "date": "2025-06-28T00:00:00.000Z",
    "dateFormatted": "June 28, 2025",
    "excerpt": "A jumbo edition this week after a two-week break that was really not necessary....",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "used",
      "all",
      "oil",
      "nyt",
      "how",
      "what",
      "some",
      "more",
      "than",
      "three",
      "now",
      "best",
      "quot",
      "years",
      "week",
      "two",
      "really",
      "not",
      "mathematical",
      "most",
      "far",
      "who",
      "made",
      "can",
      "just",
      "cooking",
      "when",
      "help",
      "getting",
      "guide",
      "meeting",
      "researchers",
      "may",
      "world",
      "traveled",
      "coming",
      "group",
      "problems",
      "questions",
      "hajj",
      "horseback",
      "people",
      "year",
      "way",
      "festivals",
      "surprised",
      "get",
      "family",
      "any",
      "surprise"
    ],
    "searchableText": "a jumbo edition this week after a two-week break that was really not necessary. at secret math meeting, researchers struggle to outsmart ai on a weekend in mid-may, a clandestine mathematical conclave convened. thirty of the world s most renowned mathematicians traveled to berkeley, calif., with some coming from as far away as the u.k. the group s members faced off in a showdown with a reasoning chatbot that was tasked with solving problems they had devised to test its mathematical mettle. after throwing professor-level questions at the bot for two days, the researchers were stunned to discover it was capable of answering some of the world s hardest solvable problems. i have colleagues who literally said these models are approaching mathematical genius, says ken ono, a mathematician at the university of virginia and a leader and judge at the meeting. hajj on horseback nyt more than 1.5 million people traveled to saudi arabia this year for the hajj. only three of them rode on horseback all the way from spain, recreating the pilgrimage of andalusian muslims centuries ago and sharing their travels in the most modern way with big followings on social media. festivo, all festivals, everywhere in asia, for now a calendar of all festivals. did she or didn t she? she did, and she ll tell you exactly how. nyt i am surprised it took so long to get here and not at all surprised who made it happen. smartest family? new york city s best chefs pick their favorite restaurants nyt is it any surprise he won? the pope as a bishop in peru, robert prevost was often on the lookout for used cars that he could buy cheap and fix up himself for use in parishes around his diocese. with cars that were really broken down, he 39 d watch youtube videos to learn how to fix them. i used to be a high-performing robot and maybe you re not actually trying . quot agency quot is having a moment online as seen in all the quot you can just do things quot memes. interesting. llms in kitchen? i made tofu with peanut sauce today based on a receipe created by claude. honestly, the proportions were off but it wasn 39 t half bad. are llms 10x-ing anyone else in the kitchen? i am so much more confident cooking when i can ask infinite dumb questions and brainstorm ideas, backup plans, substitutes, etc. in the last couple weeks i ve made jerk chicken with coconut rice and mango salsa, chipotle turkey tacos, honey-lime sriracha chicken amp sesame snap peas, skillet-blistered tomato and ravioli, and a fancy dessert. some of these things were just me looking in the fridge and saying uhh this is what i have, help me turn it into something good and so far they ve all been great. i m the stereotypical guy that knows how to make 3 variations on a protein bowl and maybe 2 nicer dishes for impressing girls when i was single and that s about it. it s fun feeling my agency expand and confidence quickly increase in this very practical domain. ai is great. andrej karpathy 39 s keynote at yc . self recommending as some say. kitty olympics ai video is getting better. texan guy recites his electric bill like he s a character in a william faulkner novel. hilarious. ai is transforming indian call centers. for three years, kartikeya kumar hesitated before picking up the phone, anticipating another difficult conversation with another frustrated customer. the call center agent, now 29, had tried everything to eliminate what a colleague called the indian-ism in his accent. he mimicked the dialogue from marvel movies and belted out songs by metallica and pink floyd. relief finally arrived in the form of artificial intelligence. using ai right now a quick guide by ethan mollick every few months i put together a guide on which ai system to use. since i last wrote my guide, however, there has been a subtle but important shift in how the major ai products work. increasingly, it isn 39 t about the best model, it is about the best overall system for most people. the good news is that picking an ai is easier than ever and you have three excellent choices. the challenge is that these systems are getting really complex to understand. i am going to try and help a bit with both. how cultures heal every digital platform is flooding the market with short videos, but the audience is now spending more time with longform video and by a huge margin. flying on frying oil the noodle hawkers in kuala lumpur are getting a nice little bump in profit but who is going stall to stall to check that the oil is in fact used? and what counts as used? one fry or two? clever entrepreneurs have cut out the middleman. virgin palm oil can be substituted for used cooking oil and voila! sustainable aviation fuel is contributing to deforestation in malaysia. malaysia exports far more used cooking oil than oil that it uses. no surprise. the search for mh370 has resumed. nyt . what a mystery. rick perry i m dedicating my life to fighting for a psychedelic drug. nyt yes, rick perry. marcus had lived with my wife, anita, and me at the governor s mansion after coming home from war. he was in constant pain from his injuries and dependent on opioids just to get through the day. he also drank heavily and used nicotine to cope with stress. worse, he was carrying the burdens that come with war grief, trauma and survivor s guilt. for years, we tried to find him help. and for years, nothing worked. but after undergoing ibogaine treatment at a clinic in mexico, marcus came back changed. he no longer needed opioids. he hasn t touched alcohol in years. he even quit chewing copenhagen, a longtime habit. when your father is a swimming coach alpha school i first heard about alpha in may 2024, and in the absence of randomized controlled clarity, i did what any moderately obsessive parent with three elementary-aged kids and an itch for data would do i moved the family across the country to austin for a year and ran the experiment myself unfortunately, despite trying my best we never managed to have identical twins, so i stopped short of running a proper control group. my wife was less disappointed than i was . your semi-regular reminder to subscribe to don 39 t worry about the vase .",
    "preview": "a jumbo edition this week after a two-week break that was really not necessary. at secret math meeting, researchers struggle to outsmart ai on a weekend in mid-may, a clandestine mathematical conclave...",
    "content": "A jumbo edition this week after a two-week break that was really not necessary. \n\nAt Secret Math Meeting, Researchers Struggle to Outsmart AI: \n\nOn a weekend in mid-May, a clandestine mathematical conclave convened. Thirty of the world’s most renowned mathematicians traveled to Berkeley, Calif., with some coming from as far away as the U.K. The group’s members faced off in a showdown with a “reasoning” chatbot that was tasked with solving problems they had devised to test its mathematical mettle"
  },
  {
    "id": "links-01-08-jun-2025",
    "title": "Links: Week of 01 & 08 Jun 2025",
    "url": "posts/2025/links-01-08-jun-2025.html",
    "date": "2025-06-08T00:00:00.000Z",
    "dateFormatted": "June 8, 2025",
    "excerpt": "1. [More kids are beating cancer. Improving the rest of their lives is next.\n (WaPo)](https://www.washingtonpost.com/health/2025/05/25/pediatric-cance...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "what",
      "not",
      "children",
      "when",
      "one",
      "donloe",
      "just",
      "nyt",
      "different",
      "everyone",
      "simbari",
      "because",
      "think",
      "per",
      "mile",
      "2025",
      "more",
      "cancer",
      "all",
      "high",
      "health",
      "years",
      "later",
      "often",
      "talked",
      "less",
      "working",
      "put",
      "paper",
      "writing",
      "time",
      "mcquarrie",
      "made",
      "fact",
      "said",
      "going",
      "why",
      "such",
      "love",
      "heard",
      "way",
      "right",
      "whether",
      "toilet",
      "aired",
      "looks",
      "get",
      "zarna",
      "garg",
      "video"
    ],
    "searchableText": "more kids are beating cancer. improving the rest of their lives is next. wapo when oncologists gave my 5-year-old daughter the all-clear from high-risk neuroblastoma in 2010, i breathed a sigh of relief. but her health needs were just beginning. fifteen years later, the intense and often toxic treatments that saved emily s life have left her with a host of lifelong health challenges hearing loss, stunted height, endocrine and kidney dysfunction, and permanent hair-thinning issues no one talked about during her 18 months of cancer treatment. a good problem to have from one perspective but no less hard to deal with. questions about ai 2025 my working hypothesis is that human cognition improves markedly once pen is put to paper, and in some cases can continue to improve with extended writing but note many prominent failures . this is correct and yet i do this less than i should. time to commit to writing non-link posts weekly? exact instructions challenge youtube fun. a mission impossible fan favorite returns 3 decades later. even he s surprised. nyt but according to the final reckoning director christopher mcquarrie, donloe made a big impact. in fact, he said in an interview, fans frequently asked him when he was going to bring the character back. for a long time, he didn t understand why donloe engendered such love, until he heard the question framed in a different way when is the team going to do right by what they did to donloe? and i realized why william donloe resonated, mcquarrie said. there was a perceived injustice, whether anybody could put their finger on it or not. the rise of the japanese toilet nyt in 1982, a peculiar commercial aired on televisions across japan. an actress in a pink floral dress and an updo drops paint on her hand and futilely attempts to wipe it off with toilet paper. she looks into the camera and asks everyone, if your hands get dirty, you wash them, right? it s the same for your bottom, she continues. bottoms deserve to be washed, too. civilization on the march. zarna garg went from stay-at-home mom to stand-up comedian nyt after 16 years focusing on her husband, shalabh, and her three children zoya, brij and veer ms. garg re-entered the work force in 2019, but not to return to her erstwhile career as a personal injury lawyer. instead, encouraged by her children, she started working the new york open-mic circuit and performing at westside comedy club before headlining at caroline s on broadway by 2020. in 2023, she talked her way into opening for tina fey and amy poehler on their restless leg tour, and prime video aired her special one in a billion. this spring, she made her film debut in the critically acclaimed rom-com a nice indian boy. her second special, practical people win, will air on hulu in july, and she is developing a sitcom called zarna with mindy kaling and kevin hart. the lightcone podcast on prompting video podcast i am hungry for more such reources. chattel childhood trigger warning - fairly explicit start and parts. i don t approve of the simbari childrearing, not because i think the pain and disgust of what the children are forced to do is inherently bad, but because they are forced. to love someone skillfully is to pour fuel on their soul. it s to see the world through their desire, to delight in it, and go i desire you to get what you want. it is the amplification of their will. the simbari people are destroying the will of their children. my parents destroyed my will. and i think, quite seriously, that our current culture is likewise destroying the will of its children en masse. that s what you do to property. worth thinking about although largely i don 39 t agree with this. her will seems to be doing just fine. i think humans are are social animals and whether something traumatizes us or not is often but not always a function of the social context surrounding the event. what happens to the simbari children if it in fact, does happen. i have not verified or heard of this before doesn 39 t traumatize them because everyone around them considers it perfectly normal. in my mental model, the trauma happens, when you feel something shameful or otherwise different has happened to you and everyone looks at you different. artichokes for the photos. high cost of building in us zuckerburg 39 s worth is 226 billion. the ny subway builds tunnels at 4 bil. per mile. sf 39 s bart builds subways at 2 bil. per mile. it 39 s crazy that all of zuckerberg 39 s wealth would build just 8 of the current nyc subway network. meanwhile in paris cost 250 mil. per mile. ufo? the object was precognitive in behavior. the radar data from the spy-1b system showed that the tic tac descended from 28,000 feet to sea level in 0.78 seconds, a feat requiring acceleration up to 5,880 gs. but here 39 s what no one focuses on that data was correlated by both radar and infrared, meaning this was not a sensor glitch or hallucination...it was a multi-spectrum-confirmed, real-world event. and what s worse? the object decelerated to a dead stop mid-air. bonkers!",
    "preview": "more kids are beating cancer. improving the rest of their lives is next. wapo when oncologists gave my 5-year-old daughter the all-clear from high-risk neuroblastoma in 2010, i breathed a sigh of reli...",
    "content": "\nMore kids are beating cancer. Improving the rest of their lives is next.\n (WaPo) \n\nWhen oncologists gave my 5-year-old daughter the all-clear from high-risk neuroblastoma in 2010, I breathed a sigh of relief.\n\n\n\nBut her health needs were just beginning.\n\n\n\nFifteen years later, the intense and often toxic treatments that saved Emily’s life have left her with a host of lifelong health challenges — hearing loss, stunted height, endocrine and kidney dysfunction, and permanent hair-thinning — issues"
  },
  {
    "id": "links-25-may-2025",
    "title": "Links: Week of 25 May 2025",
    "url": "posts/2025/links-25-may-2025.html",
    "date": "2025-05-25T00:00:00.000Z",
    "dateFormatted": "May 25, 2025",
    "excerpt": "A long list today because this week two of my top sources were on fire - [MR](https://marginalrevolution.com) and [NYT](https://nytimes.com)....",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "quot",
      "nyt",
      "new",
      "drivers",
      "than",
      "not",
      "make",
      "content",
      "current",
      "long",
      "because",
      "still",
      "using",
      "time",
      "which",
      "how",
      "critical",
      "thinking",
      "what",
      "skills",
      "more",
      "web",
      "effects",
      "paper",
      "pricing",
      "uber",
      "surplus",
      "profits",
      "two",
      "parents",
      "know",
      "find",
      "one",
      "found",
      "information",
      "who",
      "doesn",
      "open",
      "cognitive",
      "burger",
      "good",
      "sense",
      "surge",
      "welfare",
      "rider",
      "gross",
      "revenue",
      "week",
      "may",
      "sources"
    ],
    "searchableText": "a long list today because this week two of my top sources were on fire - mr and nyt . my parents expected to be retired. instead, they are raising my sister s kids. nyt beautiful, heartbreaking and uplifting. still booting after all these years the people stuck using ancient windows computers none of the above. well... maybe heartbreaking. no need to click the link though, the title says it all. measles cases in europe, the americas skyrocket this is infuriating for two reasons. the second reason is that you wouldn 39 t know it from reading most news that europe has 10x the cases of usa. nyt i can understand, but i had to scroll down 3 pages on bbc website, after searching for quot measles quot to find a story about something other than rfk jr. and texas moms. your fingers wrinkle in the same pattern every time after long exposure to water heh. also apparently they wrinkle to improve underwater grip, not because the skin expands by absorbing water, which would have been hypothesis. how miami schools are leading 100,000 students into the a.i. future nyt 5 weeks ago, someone buried a 22 lb chest with 10,000 of prizes half in gold , somewhere in san francisco. no one has found it yet. this is the only clue. it was found within a day of this post, so clearly the only thing holding back the search was the number of eyes looking. how many other problems is this true for? quot one of main goals in life has been to make my parents proud quot . 92 in iraq, 78 in india. i remember realizing sometime in my early 30s that my parents didn 39 t know the hierarchy of success in my field. as far as they were concerned i was already successful after college and any quot actual quot success wouldn 39 t register with them. i felt the void in my movtivation for quite some time. having your own kids helps with the transition. ai amp critical thinking an interviewer just asked me what skills ai will make more important. my response? critical thinking skills. this is because in the past there was value in creating large quantities of information. that is now costless. the new currency is how to generate, assimilate, interpret, and make that large amount of information actionable. the next question then becomes how do we teach, and improve our own, critical thinking skills? i discuss that in a recent study where i create a critical thinking skills hierarchy. the agentic web and original sin i have been wondering about this problem for a while - who puts up the content for the llms to train on if everyone gets their answers from the chatbots and doesn 39 t visit websites anymore. the problem, as both i and patel noted, is that this ecosystem depends on humans seeing those webpages, not impersonal agents impervious to advertising, which destroys the economics of ad-supported content sites, which, in the long run, dries up the supply of new content for ai. a potential solution first, the protocol layer should have a mechanism for payments via digital currency, i.e. stablecoins. second, ai providers like chatgpt should build an auction mechanism that pays out content sources based on the frequency with which they are cited in ai answers. the result would be a new universe of creators who will be incentivized to produce high quality content that is more likely to be useful to ai, competing in a marketplace a la the open web indeed, this would be the new open web, but one that operates at even greater scale than the current web given the fact that human attention is a scarce resource, while the number of potential agents is infinite. cargo ship crashed into man s yard after crewman fell asleep, police say nyt the 22 best pizza places in new york right now nyt new studies dismiss signs of life on distant planet nyt dang. seo for ai a look at generative engine optimization the best bookstore in nyc, and then some they re 15. wait until you read their newspaper. nyt we still haven t done hot dogs, teddy said. billy agreed hot dogs should be an editorial priority. and we were still very young we had no idea what we were doing, said billy, a junior varsity quarterback whose hair was tousled into a cruciferous mop. know hope! use of digital technologies was associated with reduced risk of cognitive impairment or 0.42, 95 ci 0.35 0.52 and reduced time-dependent rates of cognitive decline hr 0.74, 95 ci 0.66 0.84 . effects remained significant when accounting for demographic, socioeconomic, health and cognitive reserve proxies. paper here. putting claude 4 opus in an open playground to chat with itself led to it diving into philosophical explorations of consciousness, self-awareness, and by 30 turns it eventually started using sanskrit can 39 t wait till nationalist politicians from my home state get their hands on this. sanskrit! toronto burger shop called good fortune burger renamed its menu items to sound like office supplies, helping remote workers potentially expense meals through work accounts. the quot basic steel stapler quot and quot braided hdmi cord are popular. as a reply points out this doesn 39 t make sense because the order is still from a place called good fortune burger. who benefits from surge pricing? what are the welfare effects of surge pricing? using uber data, i develop an empirical model of spatial equilibrium composed of demand, supply, and matching. i find that surge pricing raises total welfare, benefitting riders but hurting drivers. welfare effects differ substantially across sides of the market rider surplus increases by 3.57 of gross revenue, whereas driver surplus and the platform s current profits decrease by 0.98 and 0.50 of gross revenue, respectively. this doesn 39 t make sense. if it hurts the platform or the drivers, why would they do it? after dropping the pearl of wisdom above, i decided to actually read the paper . in the first two pages i found this uber s current profits decrease by 0.50 of gross revenue. this probably does not mean that uber is hurt, but rather that it is willing to forgo current profits to increase rider surplus the right choice if it believes that long-run shareholder value is more closely tied to rider surplus and customer retention than to current profits. makes sense. after this my eyes glazed over and i dropped the paper in claude and asked it why drivers would participate in this. here 39 s what it says the paper acknowledges this is the more problematic finding. quot my findings suggest that drivers might have good reason to complain. their hourly earnings are not much higher than the minimum wage, so even the small effects i find might be a concern. quot however, drivers may not have full information about the counterfactual uniform pricing , and many drivers are part-time workers using uber for supplemental income rather than as their primary employment.",
    "preview": "a long list today because this week two of my top sources were on fire - mr and nyt . my parents expected to be retired. instead, they are raising my sister s kids. nyt beautiful, heartbreaking and up...",
    "content": "A long list today because this week two of my top sources were on fire - MR and NYT. \n\nMy Parents  Expected to Be Retired. Instead, They Are Raising My Sister’s Kids. (NYT): Beautiful, heartbreaking and uplifting. \n\nStill booting after all these years: The people stuck using ancient Windows computers: None of the above. Well... maybe heartbreaking. No need to click the link though, the title says it all. \n\nMeasles cases in Europe, the Americas skyrocket: This is infuriating for two reasons. The "
  },
  {
    "id": "links-18-may-2025",
    "title": "Links: Week of 18 May 2025",
    "url": "posts/2025/links-18-may-2025.html",
    "date": "2025-05-18T00:00:00.000Z",
    "dateFormatted": "May 18, 2025",
    "excerpt": "1. [How to make money betting on the new Pope](https://x.com/domahhhh/status/1920612517631479984): Great discussion of the betting process. Still plen...",
    "type": "links",
    "tags": [
      "links",
      "alpha"
    ],
    "keywords": [
      "like",
      "season",
      "draft",
      "professor",
      "172",
      "week",
      "alpha",
      "late",
      "get",
      "think",
      "loss",
      "not",
      "because",
      "harvard",
      "links",
      "betting",
      "pope",
      "still",
      "plenty",
      "there",
      "quot",
      "minutes",
      "nba",
      "when",
      "points",
      "game",
      "worth",
      "popular",
      "unpopular",
      "policies",
      "magna",
      "carta",
      "original",
      "carpenter",
      "law",
      "school",
      "said",
      "vincent",
      "saying",
      "what",
      "200",
      "1946",
      "1965",
      "2025",
      "may",
      "how",
      "make",
      "money",
      "new",
      "great"
    ],
    "searchableText": "how to make money betting on the new pope great discussion of the betting process. still plenty of luck involved but a reminder that there is plenty of quot alpha quot out there if you look in the right place. maybe i should create a hashtag for these stories. alpha a few minutes later, my jaw dropped as prevost -- the guy i had just amasssed shares in at 200-1 like 20 minutes earlier-- walked out onto the balcony as pope. on the nba and economic theory solving the problem of late season tanking to get a shot at the draft lottery in the nba. quite simple when you think about it. optimal mechanism get points for each loss. in game 1, a loss is worth 1 draft point. as season continues, loss is worth less, becoming negative late. draft position based on draft points. everyone wants to win late in season. early season used to handicap truly bad teams. populism is not popular. success is popular. and singapore is well run precisely because it adopts unpopular technocratic policies like zero tariffs, forced saving, and congestion pricing. and the pap keeps getting re-elected, not despite, but because of those unpopular policies. playing the long game, succesfully, since 1965. harvard paid 27 for a copy of magna carta. surprise! it s an original. to be fair it was 27 in 1946 dollars, but still. alpha professor carpenter was at home in blackheath, south east london, plowing his way through harvard law school s digital images as research for a book when he opened a file named hls ms 172 the catalog name for harvard law school manuscript 172. i get down to 172 and it s a single parchment sheet of magna carta, he said. and i think oh my god, this looks to me for all the world because i read it like an original. professor carpenter emailed professor vincent, who was, at the time, at work in a library in brussels. david sent it with a message saying, what do you think that is? said professor vincent. i wrote back within seconds, saying, you and i both know what that is! i would not have answered like that. a light week on links as it was a heavy week in life.",
    "preview": "how to make money betting on the new pope great discussion of the betting process. still plenty of luck involved but a reminder that there is plenty of quot alpha quot out there if you look in the rig...",
    "content": "\nHow to make money betting on the new Pope: Great discussion of the betting process. Still plenty of luck involved but a reminder that there is plenty of &quot;alpha&quot; out there if you look in the right place. Maybe I should create a hashtag for these stories. #alpha\n\nA few minutes later, my jaw dropped as Prevost -- the guy I had just amasssed shares in at 200-1 like 20 minutes earlier-- walked out onto the balcony as Pope.\n\n\nOn the NBA and economic theory: Solving the problem of late seaso"
  },
  {
    "id": "links-10-may-2025",
    "title": "Links: Week of 10 May 2025",
    "url": "posts/2025/links-10-may-2025.html",
    "date": "2025-05-10T00:00:00.000Z",
    "dateFormatted": "May 10, 2025",
    "excerpt": "1. [You Sent the Message. But Did You Write It?](https://davidduncan.substack.com/p/you-sent-the-message-but-did-you?triedRedirect=true): Hilarious....",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "said",
      "when",
      "points",
      "new",
      "india",
      "mexican",
      "indian",
      "lollipops",
      "lafavers",
      "week",
      "prompt",
      "how",
      "ukraine",
      "video",
      "more",
      "used",
      "soldiers",
      "russian",
      "troops",
      "equipment",
      "called",
      "drones",
      "soon",
      "online",
      "units",
      "really",
      "need",
      "nyt",
      "made",
      "american",
      "outside",
      "men",
      "near",
      "women",
      "lego",
      "drivers",
      "parade",
      "fun",
      "some",
      "one",
      "here",
      "track",
      "bit",
      "unparalleled",
      "misalignments",
      "words",
      "geoguessr",
      "another",
      "boxes",
      "600"
    ],
    "searchableText": "you sent the message. but did you write it? hilarious. chatcident when someone slips and pastes the prompt into the chat or email instead of the polished ai output exposing the wizard behind the curtain. points for kills how ukraine is using video game incentives to slay more russians ukraine 39 s military is turning to incentive schemes used in video games to spur its soldiers to kill more russian troops and destroy their equipment. the program called army of drones bonus rewards soldiers with points if they upload videos proving their drones have hit russian targets. it will soon be integrated with a new online marketplace called brave 1 market, which will allow troops to convert those points into new equipment for their units. how far are you from india, measured in units of india? i really need to update the site to show tweets inline or at least display images. hope claude is up to the task. this is the moment for mexican indian food to flourish nyt a marriage made in heaven. literally. a small, close-knit mexican indian american community formed outside sacramento when a generation of punjabi sikh and muslim men immigrated from india to find work as farmers and loggers beginning in the late 1800s. after the immigration act of 1917 made it near impossible for indian women to immigrate, hundreds of these men married mexican women. new kinds of cooking emerged from their idiosyncratic home kitchens and a handful of restaurants the families went on to run. lego built full-size f1 cars for the miami gp drivers parade. that was the most fun drivers parade we ve ever had, ferrari s lewis hamilton said. some dirty driving from this one here gasly ! that was great fun. they ll have to sweep the track, there s quite a bit of lego debris on the track, max verstappen said. a bit different, that s for sure! tim urban on ai. in 2015. really need to add the tweet feature. unparalleled misalignments i think i have shared this before but some things are worth sharing twice. this is a list of unparalleled misalignments, pairs of non-synonymous phrases where the words in one phrase are each synonyms of the words in the other. butt dial booty call father figure dad bod local girl near miss globalization did not hollow out the american middle class pro-prompting a master in action. prompt used for geoguessr by kelsey tuoc, in the last week 39 s link on ai playing geoguessr. boy accidentally orders 70,000 lollipops on amazon. panic ensues. nyt on sunday morning, as holly lafavers was preparing to go to church, a delivery worker dropped off a 25-pound box of lollipops in front of her apartment building in lexington, ky. and another. and then another. soon, 22 boxes of 50,600 lollipops were stacked five boxes high in two walls of dum-dums. that was when ms. lafavers heard what no parent wants to hear her child had unwittingly placed a massive online order. mom, my suckers are here! said her son, liam, who had gone outside to ride his scooter. i panicked, ms. lafavers, 46, said. i was hysterical.",
    "preview": "you sent the message. but did you write it? hilarious. chatcident when someone slips and pastes the prompt into the chat or email instead of the polished ai output exposing the wizard behind the curta...",
    "content": "\nYou Sent the Message. But Did You Write It?: Hilarious.\n\n Chatcident: When someone slips and pastes the prompt into the chat or email instead of the polished AI output – exposing the wizard behind the curtain.\n\n\nPoints for kills: How Ukraine is using video game incentives to slay more Russians: \n\nUkraine&#39;s military is turning to incentive schemes used in video games to spur its soldiers to kill more Russian troops and destroy their equipment.\n\n\n\nThe program — called Army of Drones bonus — r"
  },
  {
    "id": "links-04-may-2025",
    "title": "Links: Week of 04 May 2025",
    "url": "posts/2025/links-04-may-2025.html",
    "date": "2025-05-04T00:00:00.000Z",
    "dateFormatted": "May 4, 2025",
    "excerpt": "1. [How to make hard choices (YouTube)](https://youtu.be/8GQZuzIdeQQ?si=ERdOHec3NsK6sdvP): A great video and especially personally relevant right now....",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "how",
      "video",
      "very",
      "man",
      "bite",
      "arm",
      "200",
      "may",
      "great",
      "right",
      "now",
      "just",
      "good",
      "close",
      "also",
      "can",
      "identify",
      "any",
      "photo",
      "snakes",
      "times",
      "two",
      "long",
      "venom",
      "left",
      "found",
      "macro",
      "most",
      "650",
      "2025",
      "links",
      "week",
      "make",
      "hard",
      "choices",
      "youtube",
      "especially",
      "personally",
      "relevant",
      "playing",
      "geoguessr",
      "apparently",
      "still",
      "makes",
      "errors",
      "course",
      "amazed",
      "got",
      "limited",
      "clues"
    ],
    "searchableText": "how to make hard choices youtube a great video and especially personally relevant right now. just how good is o3 at playing geoguessr apparently very good. it still makes errors of course, but i was amazed at how close it got with very limited clues. worth repeating this bit from last weeks link it s also deeply dystopian. technology can identify locations from photographs now. it s vitally important that people understand how easy this is if you have any reason at all to be concerned about your safety, you need to know that any photo you share even a photo as bland as my example above could be used to identify your location. universal antivenom may grow out of man who let snakes bite him 200 times nyt the video is just under two and a half minutes long. a slim man with close-cropped hair walks into a room, pulls a long black mamba whose venom can kill within an hour from a crate and allows it to bite his left arm. immediately after, he lets a taipan from papua new guinea bite his right arm. thanks for watching, he calmly tells the camera, his left arm bleeding, and then exits. over nearly 18 years, the man, tim friede, 57, injected himself with more than 650 carefully calibrated, escalating doses of venom to build his immunity to 16 deadly snake species. he also allowed the snakes mostly one at a time, but sometimes two, as in the video to sink their sharp fangs into him about 200 times. ken rogoff on conversations with tyler great discussion on so many different topics - china, pakistan, us, chess. i found it very insightful. macro utopia economics heavy list today but i have found scott sumner to have the most useful and probably most accurate predictions about macro.",
    "preview": "how to make hard choices youtube a great video and especially personally relevant right now. just how good is o3 at playing geoguessr apparently very good. it still makes errors of course, but i was a...",
    "content": "\nHow to make hard choices (YouTube): A great video and especially personally relevant right now. \n\nJust how good is O3 at  playing GeoGuessr: Apparently very good. It still makes errors of course, but I was amazed at how close it got with very limited clues. Worth repeating this bit from last weeks link:\n\nIt’s also deeply dystopian. Technology can identify locations from photographs now. It’s vitally important that people understand how easy this is—if you have any reason at all to be concerned "
  },
  {
    "id": "links-26-apr-2025",
    "title": "Links: Week of 26 Apr 2025",
    "url": "posts/2025/links-26-apr-2025.html",
    "date": "2025-04-26T00:00:00.000Z",
    "dateFormatted": "April 26, 2025",
    "excerpt": "A lot of NYT links today. For all its flaws, of which there might be many, the NYT is incomparable. \n1. Good advice from [Ross Douthat](https://www.ny...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "can",
      "people",
      "even",
      "don",
      "new",
      "game",
      "also",
      "what",
      "photo",
      "all",
      "york",
      "board",
      "like",
      "year",
      "media",
      "know",
      "long",
      "most",
      "male",
      "important",
      "because",
      "used",
      "radio",
      "station",
      "any",
      "links",
      "nyt",
      "there",
      "child",
      "learn",
      "drive",
      "just",
      "read",
      "expensive",
      "aren",
      "night",
      "food",
      "big",
      "one",
      "who",
      "where",
      "shared",
      "another",
      "egg",
      "life",
      "click",
      "not",
      "eggs",
      "company",
      "really"
    ],
    "searchableText": "a lot of nyt links today. for all its flaws, of which there might be many, the nyt is incomparable. good advice from ross douthat have the child. practice the religion. found the school. support the local theater, the museum, the opera or concert hall, even if you can see it all on youtube. pick up the paintbrush, the ball, the instrument. learn the language even if there s an app for it. learn to drive, even if you think soon waymo or tesla will drive for you. put up headstones, don t just burn your dead. sit with the child, open the book, and read. or play a boardgame? new york can be expensive, overwhelming and intimidating, and sometimes it is hard for people to connect. a martini can cost 25 in a bar that s too noisy for conversation, and raucous nightclubs aren t for everyone. so a free, monthly b.y.o.b. bring your own board game night in an office building food court has become a big hit. in addition to werewolf, people were playing classics, like chess and mahjong, but also relatively newer games, including catan, splendor, hues and cues, saboteur, nertz, wavelength, blokus and camel up. board game events and clubs have grown in popularity in recent years in new york and across the country. this one is organized by richard ye, a 24-year-old who works in finance. he bills the event as new york city s largest board game meet-up, and a video of mr. ye celebrating his march gathering where 500 people were in attendance was widely shared on social media. file another one under youcanjustdothings. what i didn t know about the egg industry horrified me as a life-long vegetarian who can 39 t even imagine turning vegan, i try to avoid evangelizing about what people should eat. despite the click-baity headline and not the most objective tone, the scientific brekthrough here is worth cheering. called in ovo sexing, it determines the sex of the chick embryo long before it hatches, allowing the producers to get rid of the male eggs and hatch only the females. this is important because i had no idea that while the ladies enjoyed shelter and sunshine, fresh bugs and freedom, their newborn brothers faced a gruesome fate shared by 6.5 billion male chicks around the world each year. these male birds can t lay eggs but also aren t raised for meat. because they come from egg-laying breeds, they don t grow big or fast enough to be used for food. so they are ground up alive or gassed to death. questions about the future of ai by dwarkesh patel i haven 39 t read most of this but what i have is great. another important question about ai by radek sienkiewicz why do ai company logos look like buttholes? click the link. they really do. in a year will this still make news? australian radio network arn , the media company behind kiis, as well as gold and iheart, used an ai-generated female asian host to broadcast 4 hours of midweek radio, without disclosing it. this probably still will it seems very odd that cada hired a new ethnically-diverse woman to their youth station and then just forgot to tell anyone. it s notable because arn is the whitest thing in media since the night king and his throng of walkers on game of thrones. the network is also home of australia s most expensive, complained about and censured radio show, kyle and jackie o. penn station s not-so-secret other life the people s dance studio penn station is first and foremost a transportation hub, said aaron donovan, the deputy communications director for the metropolitan transportation authority. but you know, as long as folks abide by the rules and regulations that govern the use of the space and don t block platforms or interfere with passenger flows, we generally don t have any problem with what s going on. watching o3 guess a photo s location is surreal, dystopian and wildly entertaining by simon willison first, this is really fun. watching the model s thought process as it churns through the photo, pans and zooms and discusses different theories about where it could be is wildly entertaining. it s like living in an episode of csi. it s also deeply dystopian. technology can identify locations from photographs now. it s vitally important that people understand how easy this is if you have any reason at all to be concerned about your safety, you need to know that any photo you share even a photo as bland as my example above could be used to identify your location.",
    "preview": "a lot of nyt links today. for all its flaws, of which there might be many, the nyt is incomparable. good advice from ross douthat have the child. practice the religion. found the school. support the l...",
    "content": "A lot of NYT links today. For all its flaws, of which there might be many, the NYT is incomparable. \n\nGood advice from Ross Douthat: \n\nHave the child. Practice the religion. Found the school. Support the local theater, the museum, the opera or concert hall, even if you can see it all on YouTube. Pick up the paintbrush, the ball, the instrument. Learn the language — even if there’s an app for it. Learn to drive, even if you think soon Waymo or Tesla will drive for you. Put up headstones, don’t ju"
  },
  {
    "id": "links-19-apr-2025",
    "title": "Links: Week of 19 Apr 2025",
    "url": "posts/2025/links-19-apr-2025.html",
    "date": "2025-04-19T00:00:00.000Z",
    "dateFormatted": "April 19, 2025",
    "excerpt": "1. [How \"The Joker\" Took Down The Texas Lottery (WSJ Paywall)](https://www.wsj.com/us-news/texas-lottery-gamblers-jackpot-win-40e3d6fb): What a story....",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "lottery",
      "there",
      "tickets",
      "texas",
      "numbers",
      "day",
      "via",
      "how",
      "many",
      "team",
      "such",
      "all",
      "commission",
      "moon",
      "any",
      "can",
      "just",
      "stevens",
      "quot",
      "paywall",
      "also",
      "people",
      "play",
      "choose",
      "ticket",
      "allowed",
      "set",
      "print",
      "marantelli",
      "one",
      "com",
      "printing",
      "like",
      "terminals",
      "winner",
      "drawing",
      "pot",
      "saturday",
      "operation",
      "crew",
      "game",
      "called",
      "picking",
      "some",
      "other",
      "computer",
      "build",
      "including",
      "power",
      "human"
    ],
    "searchableText": "how quot the joker quot took down the texas lottery wsj paywall what a story. there is plenty of alpha out there, if you know where and how to look. also, brute force is underrated. sadly behind a paywall and there 39 s lot more to it than the gist below in texas, as in many states, most people who play the lottery go to a store with a machine, choose numbers, then walk away with a ticket. back in 2023, texas also allowed online lottery-ticket vendors to set up shops to print tickets for their customers. marantelli s team recruited one such seller, struggling startup lottery.com, to help with the logistics of buying and printing the millions of tickets. like all lotto retailers, it would collect a 5 sales commission. the texas lottery commission allowed dozens of the terminals that print tickets to be delivered to the four workshops set up by the team. that april 19, the commission announced that there had been no winner in that day s drawing. the next drawing, with an even larger pot, would be three days later, on a saturday. the group sprang into action. the printing operation ran day and night. the team had converted each number combination into a qr code. crew members scanned the codes into the terminals using their phones, then scrambled to organize all the tickets in boxes such that they could easily locate the winning numbers. the game called for picking six numbers from 1 to 54. for a pro gambler, some sets of numbers such as 1,2,3,4,5,6 aren t worth picking because so many other players choose them, which would split the pot. marantelli s operation bought 99.3 of the possibilities. money moved to lottery.com from ranogajec s accounts held under the name john wilson in the isle of man, a tax haven off the u.k. coast, taking a circuitous route via an escrow account at a detroit law firm, according to people familiar with the transfers and bank statements reviewed by the journal. the crew hit the jackpot that saturday. one of their tickets was the sole winner. the moon should be a computer love the ambition. so much fun to read. there are other reasons to build a moon computer, including to avoid the regulatory hurdles to build the energy centers needed to power centralized ai clusters and as a sovereignty play in the increasingly fraught geopolitical game on the road to developing artificial general intelligence agi a system with the ability to solve virtually any cognitive task a human can. we of, course, don t have to mine the moon just to replicate a single human mind, but we might have to do so to power superintelligence, same in kind but vastly superior to our own. how bad are these regulations exactly? stevens a hackable ai assistant via simon willison so many cool projects, so little time. the assistant is called stevens, named after the butler in the great ishiguro novel remains of the day. every morning it sends a brief to me and my wife via telegram, including our calendar schedules for the day, a preview of the weather forecast, any postal mail or packages we re expected to receive, and any reminders we ve asked it to keep track of. all written up nice and formally, just like you d expect from a proper butler. beyond the daily brief, we can communicate with stevens on-demand we can forward an email with some important info, or just leave a reminder or ask a question via telegram chat. every a great site focused on ai related stories. obvious travel advice despite being only 0.3 of the world s population, australians seem to make up 10 of overseas visitors everywhere on the planet. do not be disturbed by this well-known optical illusion.",
    "preview": "how quot the joker quot took down the texas lottery wsj paywall what a story. there is plenty of alpha out there, if you know where and how to look. also, brute force is underrated. sadly behind a pay...",
    "content": "\nHow &quot;The Joker&quot; Took Down The Texas Lottery (WSJ Paywall): What a story. There is plenty of alpha out there, if you know where and how to look. Also, brute force is underrated. Sadly behind a paywall and there&#39;s lot more to it than the gist below:\n\nIn Texas, as in many states, most people who play the lottery go to a store with a machine, choose numbers, then walk away with a ticket. Back in 2023, Texas also allowed online lottery-ticket vendors to set up shops to print tickets fo"
  },
  {
    "id": "update-12-apr-2025",
    "title": "Update: 12 Apr 2025",
    "url": "posts/2025/update-12-apr-2025.html",
    "date": "2025-04-12T00:00:00.000Z",
    "dateFormatted": "April 12, 2025",
    "excerpt": "After a few more iterations with Claude, the website is looking a lot better but it isn't working that much better. The Archives link on top right thr...",
    "type": "notes",
    "tags": [
      "post"
    ],
    "keywords": [
      "now",
      "quot",
      "fixed",
      "not",
      "more",
      "there",
      "also",
      "get",
      "posts",
      "website",
      "better",
      "working",
      "top",
      "page",
      "cms",
      "set",
      "can",
      "2025",
      "update",
      "apr",
      "few",
      "iterations",
      "claude",
      "looking",
      "lot",
      "isn",
      "much",
      "archives",
      "link",
      "right",
      "throws",
      "poorly",
      "formatted",
      "huge",
      "black",
      "approved",
      "thoughts",
      "smaller",
      "blue",
      "version",
      "header",
      "redundant",
      "many",
      "other",
      "issues",
      "managed",
      "login",
      "see",
      "all",
      "useless"
    ],
    "searchableText": "after a few more iterations with claude, the website is looking a lot better but it isn 39 t working that much better. the archives link on top right throws up a poorly formatted page. 1 the huge, black quot approved thoughts quot at the top of the page and the smaller blue version in the header are redundant. 2 there are many other issues to be fixed. i also managed to get the cms set up so that i could login and see all the posts in the cms. 3 it is useless though because the posts i create there do not show up on the site. so there is some solid debugging needed before i can get more ambitious here. still i am quite chuffed that i have this set up and working. between the markets and a potential relocation, i have not devoted any time to this website. hopefully that changes soon. i have also decided another project i want to try my hand at. more as i get started. thought for the day if you ask quot do i feel like doing this now quot , you won 39 t do it. certainly not regularly. first, figure out how to stop the question. footnotes this is now fixed. this is also now fixed, although i am not sure if it is an improvement. this was almost fixed but broke again and i have given up for now. when on the road, i can add posts directly via github so, i am good for now.",
    "preview": "after a few more iterations with claude, the website is looking a lot better but it isn 39 t working that much better. the archives link on top right throws up a poorly formatted page. 1 the huge, bla...",
    "content": "After a few more iterations with Claude, the website is looking a lot better but it isn&#39;t working that much better. The Archives link on top right throws up a poorly formatted page.1 The huge, black  &quot;Approved Thoughts&quot; at the top of the page and the smaller blue version in the header are redundant.2 There are many other issues to be fixed. \nI also managed to get the CMS set up so that I could login and see all the posts in the CMS.3 It is useless though because the posts I create "
  },
  {
    "id": "links-12-apr-2025",
    "title": "Links: Week of 12 Apr 2025",
    "url": "posts/2025/links-12-apr-2025.html",
    "date": "2025-04-12T00:00:00.000Z",
    "dateFormatted": "April 12, 2025",
    "excerpt": "1. [Digital hygiene](https://karpathy.bearblog.dev/digital-hygiene/) by [Andrej Karpathy](https://karpathy.ai/): I discovered this just a little late ...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "series",
      "set",
      "one",
      "great",
      "all",
      "what",
      "more",
      "week",
      "want",
      "there",
      "detective",
      "recommended",
      "try",
      "first",
      "books",
      "chandler",
      "read",
      "plenty",
      "just",
      "where",
      "getting",
      "some",
      "recommendations",
      "already",
      "recommend",
      "which",
      "across",
      "devices",
      "many",
      "free",
      "life",
      "also",
      "like",
      "big",
      "scandinavian",
      "story",
      "most",
      "high",
      "prompt",
      "need",
      "any",
      "two",
      "john",
      "crowd",
      "sourced",
      "franchises",
      "suggestions",
      "start",
      "often",
      "connelly"
    ],
    "searchableText": "digital hygiene by andrej karpathy i discovered this just a little late to include in the last weeks post, where it would have been the perfect companion piece along with this one on getting phished. i practice some of these recommendations already and wholeheartedly recommend the password manager, for example. i use dashlane , which is about 60 a year if you want to sync across devices, but there are many free tools out there. bitwarden offers all the essential features, including syncing across devices, for free and the paid versions are cheaper too. i plan to explore his solutions for credit cards privacy.com this weekend. work-life separation is also great advice, which i did not follow in the past but am doing at my new ish job. flight to unkown destinations . would you take one? doesn 39 t seem like a big deal to me. as a reply to the tweet says, unlikely they will put you in a war zone, so if it is in schengen, how bad could it be? i am probably clueless... scandinavian airlines are running unknown destination flights. you buy a ticket and board the plane. then you find out where you are going. would you do it? kim shin-jo, 82, failed north korean assassin, dies as pastor in the south nyt paywall what a story and what a life! and this story is straight out of hollywood, but without the happy ending. getting the most from deep research models after a fair bit of experimentation, i 39 ve built a claude project that handles all the repeatable high-effort prompt engineering like source selection for you. it asks for your preferences, clarifies what you need, and produces a well-structured prompt that you can then feed into any dr model. two high-value excerpts from john authers bloomberg newsletters here follows a crowd-sourced literary tip. i asked yesterday for recommendations on great detective franchises for easy reading in stressful times, and you delivered. i ve had so many suggestions that this will need to come in installments. to start, the name you ve recommended most often, and with greatest enthusiasm, is michael connelly and his harry bosch series the detective loves jazz and lives in the la hills . other entrants includes the dave robicheaux series by james lee burke set in louisiana and starting with the neon rain , arnaldur indridason s really good, bleak icelandic stuff try jar city first . volker kutscher s babylon berlin series, set in weimar germany. robert van gulik s judge dee stories written some decades ago and set in ancient china try willow pattern . also the martin beck books set in 1960-70s sweden and written over 10 years by maj sjowall and per wahloo a husband and wife team, and godparents of scandinavian noir roseanna is recommended and the harry hole books by jo nesbo , set in norway. to be clear, i didn t mention raymond chandler s marlowe books because i ve already read all of them. if you ve never dipped into chandler, you have a treat in store perhaps start with the big sleep. and as more than one of you said connelly was as good as chandler, i definitely want to read one of his. i ll have plenty more suggestions tomorrow. please, if you have any more to recommend, let me know. herewith another installment in our crowd-sourced tour of great detective fiction franchises. you might want to try abir mukherjee s wyndham and banerjee series is set in india under the british raj the canadian writer eric wright s john salter series, set in toronto philip kerr s bernie gunther series, set in nazi germany the whitstable pearl mysteries by julie wassmer who used to be a scriptwriter for eastenders so there are plenty of cliffhangers andrea camilleri s inspector montalbano series, featuring sicily and plenty of great food and death of a red heroine, the first of the inspector chen series by qiu xiaolong in contemporary shanghai. this comes highly recommended by andy rothman of sinology, long one of my favorite guides to all things china, and by remarkable coincidence i had picked up a copy of this book from a neighborhood bookshelf earlier this week. so that s what i ll read next. more detectives next week. drew breunig via simon willison the first generation of ai-powered products often called ai wrapper apps, because they just are wrapped around an llm api were quickly brought to market by small teams of engineers, picking off the low-hanging problems. but today, i m seeing teams of domain experts wading into the field, hiring a programmer or two to handle the implementation, while the experts themselves provide the prompts, data labeling, and evaluations. for these companies, the coding is commodified but the domain expertise is the differentiator. s anand a great website from a college senior. on campus he was know as stud anand.",
    "preview": "digital hygiene by andrej karpathy i discovered this just a little late to include in the last weeks post, where it would have been the perfect companion piece along with this one on getting phished. ...",
    "content": "\nDigital hygiene by Andrej Karpathy: I discovered this just a little late to include in the last weeks post, where it would have been the perfect companion piece along with this one on getting phished. \n I practice some of these recommendations already and wholeheartedly recommend the password manager, for example. I use Dashlane, which is about $60 a year if you want to sync across devices, but there are many free tools out there. Bitwarden offers all the essential features, including syncing a"
  },
  {
    "id": "links-06-apr-2025",
    "title": "Links: Week of 06 Apr 2025",
    "url": "posts/2025/links-06-apr-2025.html",
    "date": "2025-04-06T00:00:00.000Z",
    "dateFormatted": "April 6, 2025",
    "excerpt": "1. [Myanmar Earthquake passing through Europe](https://x.com/zaibatsu/status/1905813574930382865?s=48): I experienced the shaking in Bangkok. First, I...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "essay",
      "dizzy",
      "even",
      "agree",
      "there",
      "understand",
      "rejection",
      "ratio",
      "going",
      "now",
      "right",
      "can",
      "more",
      "quot",
      "2025",
      "2027",
      "links",
      "week",
      "apr",
      "myanmar",
      "earthquake",
      "passing",
      "europe",
      "experienced",
      "shaking",
      "bangkok",
      "first",
      "thought",
      "getting",
      "realization",
      "struck",
      "kind",
      "disorienting",
      "walking",
      "stairs",
      "building",
      "periodically",
      "feeling",
      "didn",
      "feel",
      "real",
      "almost",
      "just",
      "drill",
      "joke",
      "human",
      "odysseus",
      "translation",
      "too",
      "preferred"
    ],
    "searchableText": "myanmar earthquake passing through europe i experienced the shaking in bangkok. first, i thought i was getting dizzy before the realization struck. it was kind of disorienting walking down the stairs of the building, periodically feeling dizzy. it didn 39 t feel real, almost as if it was just a drill or a joke. ai vs. human odysseus translation i, too, preferred the ai version. even if you don 39 t agree with the ranking, it is clearly good enough. tough out there for kids hard to understand the rejection ratio. i was originally going to link to a thread by a university professor with experience in admissions, critiquing his personal essay but she has locked her account now, i assume after it went viral. if i recall correctly, she felt his essay did not show the right attitude for various reasons. many on twitter and i disagreed but even if you agree with her take, the essay highlights a very impressive person and seems factually accurate . so i struggle to understand the rejection ratio. if he can fall for a phishing attack, so can you and they are only going to get more sophisticated. be careful out there and step up your safety protocols. ai 2027 i have yet to fully read this but it is a lot more quot optimistic quot on ai progress than i am right now and at least somewhat scary.",
    "preview": "myanmar earthquake passing through europe i experienced the shaking in bangkok. first, i thought i was getting dizzy before the realization struck. it was kind of disorienting walking down the stairs ...",
    "content": "\nMyanmar Earthquake passing through Europe: I experienced the shaking in Bangkok. First, I thought I was getting dizzy before the realization struck. It was kind of disorienting walking down the stairs of the building, periodically feeling dizzy. It didn&#39;t feel real, almost as if it was just a drill or a joke. \n\nAI vs. Human: Odysseus Translation: I, too, preferred the AI version. Even if you don&#39;t agree with the ranking, it is clearly good enough. \n\nTough out there for kids: Hard to und"
  },
  {
    "id": "links-30-mar-2025",
    "title": "Links: Week of 30 Mar 2025",
    "url": "posts/2025/links-30-mar-2025.html",
    "date": "2025-03-30T00:00:00.000Z",
    "dateFormatted": "March 30, 2025",
    "excerpt": "1. [Unintentionally hilarious](https://www.washingtonpost.com/world/interactive/2025/greenland-trump-defense-russia-china/):...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "more",
      "world",
      "app",
      "two",
      "seals",
      "which",
      "how",
      "see",
      "conversations",
      "without",
      "actual",
      "enhancements",
      "homeschooling",
      "makes",
      "much",
      "tokyo",
      "japan",
      "city",
      "don",
      "right",
      "375",
      "2025",
      "links",
      "week",
      "mar",
      "unintentionally",
      "hilarious",
      "danish",
      "defense",
      "ministry",
      "also",
      "plans",
      "fund",
      "dogsled",
      "teams",
      "protect",
      "000",
      "square",
      "mile",
      "northeast",
      "greenland",
      "national",
      "park",
      "largest",
      "hardcore",
      "sirius",
      "patrols",
      "viewed",
      "danes",
      "navy"
    ],
    "searchableText": "unintentionally hilarious the danish defense ministry also plans to fund two more dogsled teams to protect the 375,000-square-mile northeast greenland national park, the largest in the world. these would be the hardcore sirius patrols, viewed by the danes as the navy seals of the arctic, which began operations during world war ii. two. not one. how to vibe code? a fairly decent app and when you see his conversations with chatgpt, its mostly just plain english. does a programming background help. sure, but you can go quite far without any. here are the actual conversations a. starting the app b. enhancements c. more enhancements d. deploy to iphone e. the actual app why we ended up homeschooling tl dr homeschooling makes it much easier to individualize education, which makes it more efficient and meaningful. tokyo vs. rest of japan this is called the sponge city effect in my little world of demographics. in a declining region we often see the biggest city soaking up population since jobs and health services etc cluster in a single area rather than spreading out. japan has been shrinking for three decades while tokyo happily grows. how much would you need to be paid to live on a deserted island for 1.5 years and do nothing but kill seals? what it says on the label. best take people are rightfully upset about this atlantic story because it gets at a truly alarming issue being added to large, ongoing group texts without consent true that! your brain will invent fake problems for you if you don 39 t go out and find real ones i don 39 t know if this is the right path, but its the right destination",
    "preview": "unintentionally hilarious the danish defense ministry also plans to fund two more dogsled teams to protect the 375,000-square-mile northeast greenland national park, the largest in the world. these wo...",
    "content": "\nUnintentionally hilarious: \n\nThe Danish Defense Ministry also plans to fund two more dogsled teams to protect the 375,000-square-mile Northeast Greenland National Park, the largest in the world. These would be the hardcore Sirius patrols, viewed by the Danes as the Navy SEALs of the Arctic, which began operations during World War II.\n\nTwo. Not one.\n\nHow to vibe code?: A fairly decent app and when you see his conversations with ChatGPT, its mostly just plain english. Does a programming backgroun"
  },
  {
    "id": "links-22-mar-2025",
    "title": "Links: Week of 22 Mar 2025",
    "url": "posts/2025/links-22-mar-2025.html",
    "date": "2025-03-22T00:00:00.000Z",
    "dateFormatted": "March 22, 2025",
    "excerpt": "1. [The Kids Are Not All Right](https://magazine.ucsf.edu/kids-not-all-right) via [MR](https://marginalrevolution.com/marginalrevolution/2025/03/what-...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "jeffrey",
      "not",
      "quot",
      "premium",
      "via",
      "all",
      "heart",
      "surgery",
      "every",
      "yes",
      "there",
      "marital",
      "600",
      "any",
      "pain",
      "five",
      "lawson",
      "most",
      "than",
      "models",
      "years",
      "also",
      "happiness",
      "sex",
      "1972",
      "humans",
      "can",
      "anything",
      "how",
      "much",
      "today",
      "weeks",
      "common",
      "pda",
      "open",
      "children",
      "days",
      "little",
      "given",
      "just",
      "child",
      "babies",
      "doctor",
      "vegetarian",
      "chicken",
      "popular",
      "dishes",
      "outside",
      "state",
      "less"
    ],
    "searchableText": "the kids are not all right via mr reminder that humans, often the smartest humans, can believe anything. wonder how much of the coventional wisdom today falls in this category. two weeks after his birth, jeffrey s health took a turn for the worse he developed a heart defect common in premature infants patent ductus arteriosus, or pda. jeffrey was scheduled for open-heart surgery and transferred to the nearest children s hospital. in those days, surgery for pda was invasive. holes were cut on either side of jeffrey s tiny neck and chest to insert a catheter into his jugular vein. his little body was opened from breastbone to backbone, his flesh lifted aside, ribs pried apart, and a blood vessel near his heart tied off, and then all the tissues were stitched back together. baby jeffrey felt everything every incision, every internal repair, every stitch. the medical team had not given their fragile patient any drugs, any comfort, anything to protect him from the excruciating pain of open-heart surgery just a paralyzing agent to keep him still during the procedure. five weeks later, jeffrey passed away. in the days before her child s death, jill lawson learned a shocking fact anesthetizing babies for surgery was not common practice. after jeffrey died, lawson called his doctor for reassurance. surely, she thought, her child had been given something for the pain. the anesthesiologist informed me that she had not used any anesthesia or analgesia on jeffrey, lawson wrote in an account of her son s experience. the doctor told the grieving mother it hadn t even occurred to her to do so because it had never been demonstrated that babies can feel pain. peelraja via mr the paradox of india punjab is over 60 vegetarian, but tandoori chicken and butter chicken are its most popular dishes outside the state. tamil nadu is less than 1 vegetarian, but its quot pure veg quot idly, dosa, sambhar, pongal, etc are its most popular dishes outside the state. the seneca via daring fireball the seneca is my middle finger to the aesthetic homogeneity and economic over-optimization of 21st century life. a keyboard for the low, low price of 3,600. yes, a computer keyboard. yes, us . although to be fair, it is not 3,600. its quot from 3,600 quot . my thoughts on the future of quot ai quot via simon willison i have very wide error bars on the potential future of large language models, and i think you should too. specifically, i wouldn 39 t be surprised if, in three to five years, language models are capable of performing most all? cognitive economically-useful tasks beyond the level of human experts. and i also wouldn 39 t be surprised if, in five years, the best models we have are better than the ones we have today, but only in normal ways where costs continue to decrease considerably and capabilities continue to get better but there 39 s no fundamental paradigm shift that upends the world order. the anatomy of marital happiness via mr since 1972, the general social survey has periodically asked whether people are happy with yes, maybe or no type answers. here i use a net happiness measure, which is percentage yes less percentage no with maybe treated as zero. average happiness is around 20 on this scale for all respondents from 1972 to the last pre-pandemic survey 2018 . however, there is a wide gap of around 30 points between married and unmarried respondents. this marital premium is this paper s subject. i describe how this premium varies across and within population groups. these include standard socio demographics age, sex, race education, income and more. i find little variety and thereby surface a notable regularity in us socio demography there is a substantial marital premium for every group and subgroup i analyze, and this premium is usually close to the overall 30-point average. this holds not just for standard characteristics but also for those directly related to marriage like children and sex and sex preference . i also find a cohabitation premium , but it is much smaller 10 points than the marital premium. the analysis is mainly visual, and there is inevitably some interesting variety across seventeen figures, such as a 5-point increase in recent years.",
    "preview": "the kids are not all right via mr reminder that humans, often the smartest humans, can believe anything. wonder how much of the coventional wisdom today falls in this category. two weeks after his bir...",
    "content": "\nThe Kids Are Not All Right via MR:   Reminder that humans, often the smartest humans, can believe anything. Wonder how much of the coventional wisdom today falls in this category. \n\nTwo weeks after his birth, Jeffrey’s health took a turn for the worse: He developed a heart defect common in premature infants – patent ductus arteriosus, or PDA. Jeffrey was scheduled for open-heart surgery and transferred to the nearest children’s hospital.\n\n\n\nIn those days, surgery for PDA was invasive. Holes wer"
  },
  {
    "id": "links-15-mar-2025",
    "title": "Links: Week of Mar 15 2025",
    "url": "posts/2025/links-15-mar-2025.html",
    "date": "2025-03-15T00:00:00.000Z",
    "dateFormatted": "March 15, 2025",
    "excerpt": "1. [Australian man survives 100 days with artificial heart in world-first success](https://www.theguardian.com/australia-news/2025/mar/12/australian-m...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "heart",
      "man",
      "australian",
      "artificial",
      "world",
      "first",
      "more",
      "than",
      "nyt",
      "paywall",
      "china",
      "not",
      "100",
      "week",
      "days",
      "success",
      "become",
      "total",
      "implant",
      "behind",
      "blood",
      "can",
      "complete",
      "quot",
      "high",
      "speed",
      "rail",
      "leads",
      "trains",
      "want",
      "people",
      "smiths",
      "500",
      "2021",
      "2025",
      "3692",
      "links",
      "mar",
      "survives",
      "via",
      "nico",
      "mccarty",
      "failure",
      "person",
      "walk",
      "hospital",
      "researchers",
      "doctors",
      "operation",
      "announced"
    ],
    "searchableText": "australian man survives 100 days with artificial heart in world-first success via nico mccarty an australian man with heart failure has become the first person in the world to walk out of a hospital with a total artificial heart implant. the australian researchers and doctors behind the operation announced on wednesday that the implant had been an unmitigated clinical success after the man lived with the device for more than 100 days before receiving a donor heart transplant in early march. the bivacor total artificial heart, invented by queensland-born dr daniel timms, is the world s first implantable rotary blood pump that can act as a complete replacement for a human heart, using magnetic levitation technology to replicate the natural blood flow of a healthy heart. inflation expectations by political party affiliation entry 3692 in quot politics makes you stupid quot . broccoli, the man and vegetable behind the bond franchise what a story . the shift from a mindset of scarcity to one of abundance is overdue. nyt paywall the article itself has a strong partisan tone. i hope the book is different. in the time california has spent failing to complete its 500-mile high-speed rail system, china has built more than 23,000 miles of high-speed rail. china does not spend years debating with judges over whether it needs to move a storage facility. that power leads to abuse and imperiousness. it also leads to trains. i do not want america to become china. but i do want it to be able to build trains. some vegans were harmed in the watching of this movie nyt paywall even as a vegetarian, this seems over the top. people might think a glass of milk is innocuous, she said. it s not. it s full of violence. in search of a boring business nyt paywall on bizbuysell, the popular listings site where the rizzos found the smiths, corporate refugees ditching the 9-to-5 have surged to 42 percent of buyers, roughly double the 2021 figure. meanwhile, nearly a quarter of american small businesses are owned by people 65 and older, making the smiths part of a silver tsunami of sellers. cognitive security is now as important as basic literacy must read link of the week. between this stuff and use of ai in scams, i am more than a little scared. is this good or bad? policy can be hard.",
    "preview": "australian man survives 100 days with artificial heart in world-first success via nico mccarty an australian man with heart failure has become the first person in the world to walk out of a hospital w...",
    "content": "\nAustralian man survives 100 days with artificial heart in world-first success via Nico McCarty: \n\nAn Australian man with heart failure has become the first person in the world to walk out of a hospital with a total artificial heart implant.\n\n\n\nThe Australian researchers and doctors behind the operation announced on Wednesday that the implant had been an “unmitigated clinical success” after the man lived with the device for more than 100 days before receiving a donor heart transplant in early Ma"
  },
  {
    "id": "links-08-mar-2025",
    "title": "Links: Week of Mar 08 2025",
    "url": "posts/2025/links-08-mar-2025.html",
    "date": "2025-03-08T00:00:00.000Z",
    "dateFormatted": "March 8, 2025",
    "excerpt": "1. [James Harrison: The Man Who Saved 2.4 Million Babies](https://www.bbc.com/news/articles/c5y4xqe60gyo): Hall of Fame. \n2. Coincidentally, this week...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "hall",
      "games",
      "week",
      "who",
      "fame",
      "playing",
      "card",
      "clearly",
      "different",
      "2025",
      "links",
      "mar",
      "james",
      "harrison",
      "man",
      "saved",
      "million",
      "babies",
      "coincidentally",
      "both",
      "tyler",
      "cowen",
      "karthik",
      "shared",
      "memories",
      "kids",
      "today",
      "sister",
      "mentioned",
      "younger",
      "newphew",
      "started",
      "dungeons",
      "dragons",
      "recently",
      "played",
      "board",
      "boys",
      "especially",
      "covid",
      "fun",
      "more",
      "another",
      "entry",
      "sure",
      "come",
      "one",
      "guy",
      "legend",
      "way"
    ],
    "searchableText": "james harrison the man who saved 2.4 million babies hall of fame. coincidentally, this week both tyler cowen and karthik s shared memories of playing card games as kids. and then today my sister mentioned my younger newphew had started playing dungeons and dragons recently. we have played card games and board games with our boys, especially during covid and it was fun. clearly we should do more of this. another entry to the hall of fame. a different hall, sure, but come one, clearly this guy is a legend. a different way of learning math? via zvi , who belongs in a third hall. can 39 t fault him for lacking ambition but perhaps this is the rare tweet that should have been an article. a cheeto shaped like the pokemon charizard sells for nearly 90,000 . nyt paywall but do you really need to read anything else? honey on a razor blade something about the actual visualization struck a chord with me.",
    "preview": "james harrison the man who saved 2.4 million babies hall of fame. coincidentally, this week both tyler cowen and karthik s shared memories of playing card games as kids. and then today my sister menti...",
    "content": "\nJames Harrison: The Man Who Saved 2.4 Million Babies: Hall of Fame. \nCoincidentally, this week both Tyler Cowen and Karthik S shared memories of playing card games as kids. And then today my sister mentioned my younger newphew had started playing Dungeons and Dragons recently. We have played card games and board games with our boys, especially during COVID and it was fun. Clearly we should do more of this.  \nAnother entry to the hall of fame. A different hall, sure, but come one, clearly this g"
  },
  {
    "id": "links-01-mar-2025",
    "title": "Links: Week of Mar 01 2025",
    "url": "posts/2025/links-01-mar-2025.html",
    "date": "2025-03-01T00:00:00.000Z",
    "dateFormatted": "March 1, 2025",
    "excerpt": "1. [A.I. and Vibecoding Helped Me Create My Own Software](https://www.nytimes.com/2025/02/27/technology/personaltech/vibecoding-ai-software-programmin...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "not",
      "scene",
      "naked",
      "common",
      "years",
      "report",
      "most",
      "enough",
      "maybe",
      "actor",
      "actors",
      "time",
      "2006",
      "2012",
      "watch",
      "other",
      "see",
      "what",
      "bit",
      "complex",
      "one",
      "think",
      "how",
      "there",
      "nudity",
      "screen",
      "when",
      "imagine",
      "being",
      "quot",
      "2025",
      "links",
      "week",
      "mar",
      "vibecoding",
      "helped",
      "create",
      "own",
      "software",
      "limitation",
      "here",
      "imagination",
      "humanoid",
      "robots",
      "coming",
      "wild",
      "dogs",
      "stop",
      "paying",
      "good"
    ],
    "searchableText": "a.i. and vibecoding helped me create my own software the limitation here is my imagination. humanoid robots are coming. wild dogs will not stop me from paying good money for a bot that can iron and fold clothes. first world problem? nebraska man struggles to change daughter s name from unakite thirteen hotel . for two years. michelle trachtenberg i did not watch buffy or any of her other work but it is always depressing to see so many child celebrities die early deaths. this job is hazardous. to be clear cause of death is not known and i do not want to speculate. what struck me was this bit in the report in a 2012 interview with complex magazine, she recalled a scene in the 2006 film beautiful ohio, starring william hurt and rita wilson, that featured her naked tush. it was, she said, probably one of the most horrendous moments of my life. it would take an army or martin scorsese to ever get me naked again, she added. as a viewer, i almost never think about the person behind the character. sure if a christian bale loses nearly 30kg for a role, its visible enough and stark enough that one is forced to think about the how of it. but for the most part, i watch the program and move on. maybe if there is something really interesting or shocking, a comment to my so. so it is a jarring to see that the impact of a brief scene stuck with the actor for years after the fact. these days there is enough nudity on screen that most of us are desensitized to seeing it and i hope the actors are too, to performing them. even in 2006 or 2012, when maybe it was less common, i would not have imagined an actor, and especially an american 1 actor, would be so traumatized by such a scene. maybe it is because she grew up in a time when that was a much bigger deal that it was harder on her. perhaps actors like her were the trailblazers and paid a price and it is easier for actors now. it is, however, possible to imagine a possibility where being naked on screen is traumatizing, no matter how common and acceptable. according to claude, the quot being naked in public quot dream genre is common across cultures and age groups and more common in adoloscents. if that is the case i shudder to imagine the cost of all the content on netflix and other services in a few years time. the report also has a bit on another scene she was not happy about. and guess what? at the time and thankfully no longer , the report carried a photo from that scene. footnotes though, it turns out, america has a complex relationship with nudity and sexuality. who 39 da thunk!",
    "preview": "a.i. and vibecoding helped me create my own software the limitation here is my imagination. humanoid robots are coming. wild dogs will not stop me from paying good money for a bot that can iron and fo...",
    "content": "\nA.I. and Vibecoding Helped Me Create My Own Software: The limitation here is my imagination. \n\nHumanoid Robots are coming. Wild dogs will not stop me from paying good money for a bot that can iron and fold clothes. \n\nFirst world problem?: Nebraska Man Struggles to Change Daughter’s Name From ‘Unakite Thirteen Hotel’. For two years. \n\nMichelle Trachtenberg: I did not watch Buffy or any of her other work but it is always depressing to see so many child celebrities die early deaths. This job is ha"
  },
  {
    "id": "a-few-thoughts-on-llms",
    "title": "A few thoughts on LLMs",
    "url": "posts/2025/a-few-thoughts-on-llms.html",
    "date": "2025-03-01T00:00:00.000Z",
    "dateFormatted": "March 1, 2025",
    "excerpt": "I need to sit down and combine some of these thoughts into a coherent piece but for now, I just want to dump  it all here for reference later. I doubt...",
    "type": "post",
    "tags": [
      "post",
      "LLM"
    ],
    "keywords": [
      "llm",
      "quot",
      "content",
      "llms",
      "all",
      "market",
      "than",
      "one",
      "context",
      "can",
      "become",
      "data",
      "thoughts",
      "need",
      "combine",
      "some",
      "any",
      "high",
      "create",
      "product",
      "lots",
      "window",
      "experience",
      "model",
      "more",
      "going",
      "training",
      "start",
      "amp",
      "good",
      "few",
      "sit",
      "coherent",
      "piece",
      "now",
      "just",
      "want",
      "dump",
      "here",
      "reference",
      "later",
      "doubt",
      "original",
      "certainly",
      "seen",
      "elsewhere",
      "structure",
      "makers",
      "may",
      "end"
    ],
    "searchableText": "i need to sit down and combine some of these thoughts into a coherent piece but for now, i just want to dump it all here for reference later. i doubt any of these are original and i have certainly seen some elsewhere. market structure for llm makers may end up being like the airline market. high fixed cost to set up, hard to create a product differentiation that users care about other than price , lots of competitors entering, at least in part due to the quot prestige quot of owning one. lots of utility for consumers but hardly any profit for producers. an llm with an infinite context window, one that can contain all my life, will be an entirely different product than an llm with a limited context window. you can never have enough when it comes to context windows. notwithstanding 1, quot personality quot makes a huge difference in the experience of working with an llm and the ability to create the right one could determine whether a model can dominate a market or a niche. claude sonnet 3.5 absolutely had than special sauce in my experience. we need a lot more of it. this. i don t see how we re going to avoid a situation where the internet become lousy with ai-created, pseudo academic writing filled with made up facts and quotes, which will then get cemented into knowledge as those articles become the training fodder for future models. but combine it with the fact that if we all start getting our answers from llms, the online content amp ad based business model goes caput and then what is the incentive for people to put up good content on the web? none. but anyone who has good proprietary, verified, high-quality data amp content will potentially control the value for the customer even as base llms become a commodity. therefore does more data and content start going behind the paywall? if it doesn 39 t it becomes training data and cannot be monetized.",
    "preview": "i need to sit down and combine some of these thoughts into a coherent piece but for now, i just want to dump it all here for reference later. i doubt any of these are original and i have certainly see...",
    "content": "I need to sit down and combine some of these thoughts into a coherent piece but for now, I just want to dump  it all here for reference later. I doubt any of these are original and I have certainly seen some elsewhere. \n\nMarket structure for LLM makers may end up being like the airline market. High fixed cost to set up, hard to create a product differentiation that users care about (other than price), lots of competitors entering, at least in part due to the &quot;prestige&quot; of owning one. L"
  },
  {
    "id": "links-23-feb-2025",
    "title": "Links: Week of 23 Feb 2025",
    "url": "posts/2025/links-23-feb-2025.html",
    "date": "2025-02-23T00:00:00.000Z",
    "dateFormatted": "February 23, 2025",
    "excerpt": "1. [50 years of Travel Tips](https://kk.org/thetechnium/50-years-of-travel-tips/): Some great tips. \n    >For the best travel experiences you need eit...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "time",
      "real",
      "money",
      "can",
      "much",
      "llms",
      "right",
      "some",
      "lot",
      "world",
      "don",
      "think",
      "how",
      "using",
      "matters",
      "there",
      "2025",
      "week",
      "travel",
      "tips",
      "great",
      "need",
      "more",
      "what",
      "understand",
      "one",
      "without",
      "hiv",
      "prevention",
      "now",
      "systems",
      "even",
      "fun",
      "thing",
      "genius",
      "why",
      "quot",
      "work",
      "prompt",
      "engineering",
      "however",
      "post",
      "consensus",
      "projections",
      "still",
      "talent",
      "everyone",
      "100",
      "2035",
      "links"
    ],
    "searchableText": "50 years of travel tips some great tips. for the best travel experiences you need either a lot of money, or a lot of time. of the two modes, it is far better to have more time than money. although it tries, money cannot buy what time delivers. you have enough time to attend the rare festival, to learn some new words, to understand what the real prices are, to wait out the weather, or to get to that place that takes a week in a jeep. time is the one resource you can give yourself, so take advantage of this if you are young without money. 100 hiv prevention ...we now have evidence that in real-world use it can do something that has never been seen before twice-yearly injections in thousands of female trial volunteers in high-risk areas south africa and uganda showed a one hundred per cent prevention rate of hiv infection. stable systems x i don t think a lot of people appreciate how much of their overall lifestyle and relative certainty is backstopped by a steady, boring stability of systems they don t understand or even realize exist. ai or no i x me using llms for fun little personal projects wow this thing is such a genius why do we even need humans anymore. me trying to deploy llms in messy real-world environments why is this thing so unbelievably stupid and dumb. this fits with my experience. but also for doing quot real quot work, prompt engineering matters. giving the right instructions in the right order does make a difference. see more scepticism in this thread . along with some of the comments i am hearing satya nadella made in his podcast with dwarkesh , i wonder if we are seeing a vibe shift on ai? my llm codegen workflow atm via i have been building so many small products using llms. it has been fun, and useful. however, there are pitfalls that can waste so much time. a while back a friend asked me how i was using llms to write software. i thought oh boy. how much time do you have! and thus this post. again, for real work, prompt engineering matters. consensus projections on ai x i think grok 3 came in right at expectations, so i don 39 t think there is much to update in terms of consensus projections on ai still accelerating development, speed is a moat, compute still matters, no obvious secret sauce to making a frontier model if you have talent amp chips. three observations obligatory link to every sam altman post. anyone in 2035 should be able to marshall the intellectual capacity equivalent to everyone in 2025 everyone should have access to unlimited genius to direct however they can imagine. there is a great deal of talent right now without the resources to fully express itself, and if we change that, the resulting creative output of the world will lead to tremendous benefits for us all.",
    "preview": "50 years of travel tips some great tips. for the best travel experiences you need either a lot of money, or a lot of time. of the two modes, it is far better to have more time than money. although it ...",
    "content": "\n50 years of Travel Tips: Some great tips. \n\nFor the best travel experiences you need either a lot of money, or a lot of time. Of the two modes, it is far better to have more time than money. Although it tries, money cannot buy what time delivers. You have enough time to attend the rare festival, to learn some new words, to understand what the real prices are, to wait out the weather, or to get to that place that takes a week in a jeep. Time is the one resource you can give yourself, so take adv"
  },
  {
    "id": "links-9-feb-2025",
    "title": "Links: Week of 09 Feb 2025",
    "url": "posts/2025/links-9-feb-2025.html",
    "date": "2025-02-09T00:00:00.000Z",
    "dateFormatted": "February 9, 2025",
    "excerpt": "1. [Translating with LLMs](https://news.ycombinator.com/item?id=42897856): A fantastic guide from a professional translator on how he is using LLMs to...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "brother",
      "more",
      "hard",
      "not",
      "than",
      "stranger",
      "saving",
      "llms",
      "how",
      "can",
      "things",
      "thing",
      "professional",
      "day",
      "ask",
      "just",
      "wisdom",
      "thought",
      "tarriffs",
      "dad",
      "gay",
      "now",
      "when",
      "one",
      "value",
      "life",
      "any",
      "real",
      "say",
      "five",
      "million",
      "concede",
      "great",
      "all",
      "2025",
      "links",
      "week",
      "feb",
      "translating",
      "fantastic",
      "guide",
      "translator",
      "using",
      "job",
      "better",
      "queries",
      "simply",
      "claude",
      "like",
      "colleague"
    ],
    "searchableText": "translating with llms a fantastic guide from a professional translator on how he is using llms to do his job better. for my day to day queries, i simply ask claude, like i would ask a colleague or a friend and it just works. but for professional work, correctly prompting the llms improves the quality of output significantly. i hope to find and create more such examples. wisdom wisdom ii a lot of ai cheerleading takes this form . yes, you can just do things. i have also thought and posted along those lines. but as gergely points out, the hard thing in building a payment system is not the code - its fraud, aml, kyc, tax, reporting, reconcilliation... that is true for most other hard things too. the hard thing in pharma is not finding the compound but getting the trials and approvals done. the hard thing in politics in not the manifesto but the consensus. tarriffs and modern supply chains tarriffs are more disruptive than i thought. how my dad reconciled his god and his gay son beautiful. this is me with my dad, bill white. for decades, he has been an evangelical pastor. before i was born, he wrote a letter to my future wife. he didn t know what we both do now that i m gay. when i came out nearly 16 years later, it shook his faith and fractured his church. but it never separated us. i wanted to understand how. so i read his journals. strongly endorse one of the reasons making things is satisfying is that it 39 s a concrete demonstration of the notion that you can have some amount of control over your environment and circumstances. passive media consumption is the opposite of that. should you value the life of your brother more than that of a stranger? but again, this is a distraction from any real issue! oh, you should value the life of your brother more than a stranger? you don t say? i m hearing this for the first time! now let s kill five million foreign children to fund one sixth of a broadband boondoggle. i am happy to concede that if you face a choice between saving a stranger and saving your brother, save your brother! or your cousin, or your great-uncle, or your seven-times-great-grand-nephew-twice-removed. i ll concede all of this, immediately, because it s all fake none of your relatives were ever in any danger. the only point of this whole style of philosophical discussion is so that you can sound wise as you say ah, but is not saving your brother more important than saving a complete stranger? then sentence five million strangers to death for basically no benefit while your brother continues to be a successful real estate agent in des moines. when will i be able to write so well?",
    "preview": "translating with llms a fantastic guide from a professional translator on how he is using llms to do his job better. for my day to day queries, i simply ask claude, like i would ask a colleague or a f...",
    "content": "\nTranslating with LLMs: A fantastic guide from a professional translator on how he is using LLMs to do his job better. \n For my day to day queries, I simply ask Claude, like I would ask a colleague or a friend and it just works. But for professional work, correctly prompting the LLMs improves the quality of output significantly. I hope to find (and create) more such examples. \n\nWisdom: \n \n\nWisdom II: A lot of AI cheerleading takes this form. Yes, you can just do things. I have also thought and p"
  },
  {
    "id": "links-03-feb-2025",
    "title": "Links: Week of 03 Feb 2025",
    "url": "posts/2025/links-03-feb-2025.html",
    "date": "2025-02-03T00:00:00.000Z",
    "dateFormatted": "February 3, 2025",
    "excerpt": "> Most books should have been blog posts, most blog posts should have been tweets and most tweets should never have been written. - Unknown Tweeter...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "links",
      "most",
      "how",
      "week",
      "blog",
      "posts",
      "tweets",
      "set",
      "myself",
      "cricket",
      "league",
      "eliot",
      "not",
      "book",
      "failure",
      "failed",
      "startup",
      "first",
      "advice",
      "more",
      "than",
      "using",
      "400",
      "2025",
      "feb",
      "books",
      "never",
      "written",
      "unknown",
      "tweeter",
      "another",
      "heavy",
      "can",
      "help",
      "right",
      "now",
      "fake",
      "arrangements",
      "might",
      "suggested",
      "featured",
      "professional",
      "grade",
      "online",
      "audience",
      "find",
      "worth",
      "watching",
      "fact",
      "players"
    ],
    "searchableText": "most books should have been blog posts, most blog posts should have been tweets and most tweets should never have been written. - unknown tweeter another set of ai-heavy links. i can t help myself right now. set up a fake cricket league these arrangements might have suggested that the league featured professional-grade cricket that an online audience would find worth watching, but in fact, the players weren t established cricketers or even skilled amateurs. they were locals that davda had recruited with the promise of paying 400 rupees about 3.50 per day twice what people in the area make in daily wages working on farms and for local businesses. respect. how to choose a religion nyt paywall but for the general obligation imposed upon us all, as time-bound creatures in a world shot through with intimations of transcendence, a different eliot line is apt for us, there is only the trying. the rest is not our business. i didn t know eliot plagiarized the gita. the book is called believe why everyone should be religious . i hope to read this book. i am not a failure lessons learned from six and a half failed startup attempts. i am a sucker for these stories, having a failed startup in my recent past. the conclusion conveniently helps me feel good about the failure. agency how to prepare for an ai future coincidentally, i ran into a number of pieces on this topic last week. the first one from tyler cowen and the second from nate silver . both have the same advice in the first place use llms more than you do and for more things than you do. using ai to build a nuclear fusor combining the wisdom of the previous two links. using ai to improve learning i would love to see how the tutor was created. perhaps i, too, need to take the advice from links 4 amp 5 and do this project myself.",
    "preview": "most books should have been blog posts, most blog posts should have been tweets and most tweets should never have been written. - unknown tweeter another set of ai-heavy links. i can t help myself rig...",
    "content": "\nMost books should have been blog posts, most blog posts should have been tweets and most tweets should never have been written. - Unknown Tweeter\n\nAnother set of AI-heavy links. I can’t help myself right now.\n\nSet up a fake cricket league: \n\nThese arrangements might have suggested that the league featured professional-grade cricket that an online audience would find worth watching, but in fact, the players weren’t established cricketers or even skilled amateurs. They were locals that Davda had "
  },
  {
    "id": "links-27-jan-2025",
    "title": "Links: Week of 27 Jan 2025",
    "url": "posts/2025/links-27-jan-2025.html",
    "date": "2025-01-27T00:00:00.000Z",
    "dateFormatted": "January 27, 2025",
    "excerpt": "1. [Why Is Homeowners Insurance Getting So Expensive?](https://www.construction-physics.com/p/why-is-homeowners-insurance-getting) by Brian Potter via...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "links",
      "great",
      "gell",
      "mann",
      "read",
      "see",
      "amnesia",
      "just",
      "article",
      "2025",
      "getting",
      "via",
      "question",
      "there",
      "important",
      "climate",
      "change",
      "next",
      "also",
      "physics",
      "effect",
      "newspaper",
      "some",
      "subject",
      "know",
      "case",
      "story",
      "cause",
      "quot",
      "turn",
      "page",
      "news",
      "since",
      "note",
      "only",
      "trump",
      "week",
      "jan",
      "why",
      "homeowners",
      "insurance",
      "expensive",
      "brian",
      "potter",
      "piece",
      "objectively",
      "exploring",
      "lot",
      "coverage",
      "recent"
    ],
    "searchableText": "why is homeowners insurance getting so expensive? by brian potter via mr a great piece objectively exploring a question getting a lot of coverage after the recent la fires. there s so much i love about this link. original, deep analysis of an important question debunking the popular narrative climate change, see next two links . also, a great blog on construction physics? with 51k subscribers! isn t internet the best? gell-mann amnesia first described by michael crichton and apparently nothing to do with gell-mann. he just gave it an important sounding name to have it taken seriously. gell -mann amnesia effect is as follows. you open the newspaper to an article on some subject you know well. in murray 39 s case, physics. in mine, show business. you read the article and see the journalist has absolutely no understanding of either the facts or the issues. often, the article is so wrong it actually presents the story backward reversing cause and effect. i call these the quot wet streets cause rain quot stories. paper 39 s full of them. in any case, you read with exasperation or amusement the multiple errors in a story, and then turn the page to national or international affairs, and read as if the rest of the newspaper was somehow more accurate about palestine than the baloney you just read. you turn the page, and forget what you know. i should make a spaced repetition card for this. bjorn lomborg a good follow if you want to see less depressing news about climate change, for instance that polar bear population has been increasing since the 1960s or that the great barrier reef is doing just fine. do note that his work is also subject to gell-mann amnesia. only reason i am posting this is because i am right now in the land of the great ufo scare of 2025, new jersey. trump appointed cia director? on fox news? former texas congressman? there should be an emoji for that. here s a palate cleanser via alex tabarrok at mr . jokic. watch till the end for the reaction. is it better to bribe trump by purchasing his memecoin or his stock? not financial advice. no ai in the links at least, although i cannot confirm or deny if an ai was involved in the selection of these links. programming note since i am traveling for the next few weeks, some of those letters may only contain the links section.",
    "preview": "why is homeowners insurance getting so expensive? by brian potter via mr a great piece objectively exploring a question getting a lot of coverage after the recent la fires. there s so much i love abou...",
    "content": "\nWhy Is Homeowners Insurance Getting So Expensive? by Brian Potter via MR: A great piece objectively exploring a question getting a lot of coverage after the recent LA fires. There’s so much I love about this link. Original, deep analysis of an important question debunking the popular narrative (climate change, see next two links). Also, a great blog on Construction Physics? With 51K subscribers! Isn’t internet the best?\n\nGell-Mann Amnesia: First described by Michael Crichton and apparently noth"
  },
  {
    "id": "the-one-where-i-set-up-a-website",
    "title": "The One Where I(?) Set Up a Website",
    "url": "posts/2025/the-one-where-i-set-up-a-website.html",
    "date": "2025-01-26T00:00:00.000Z",
    "dateFormatted": "January 26, 2025",
    "excerpt": "[This](https://approvedthoughts.com/) is the website in question. Bookmark it. Or don’t....",
    "type": "post",
    "tags": [
      "post"
    ],
    "keywords": [
      "claude",
      "website",
      "not",
      "can",
      "just",
      "models",
      "project",
      "where",
      "context",
      "like",
      "all",
      "some",
      "model",
      "which",
      "one",
      "set",
      "better",
      "chat",
      "few",
      "only",
      "cloudflare",
      "other",
      "services",
      "while",
      "lot",
      "how",
      "there",
      "what",
      "asked",
      "much",
      "fix",
      "step",
      "more",
      "question",
      "people",
      "think",
      "any",
      "steps",
      "went",
      "because",
      "here",
      "work",
      "different",
      "code",
      "going",
      "things",
      "projects",
      "even",
      "maybe",
      "best"
    ],
    "searchableText": "this is the website in question. bookmark it. or don t. many people are asking if this can even be called a website. these people are losers. sad. the finest people i know think its a great website, maybe the best website in the history of the world. nobody knows websites like i do. anyhoo. it all began when i decided to shift this letter to a website last week. having purchased a few web domains before, it took me only a few minutes to buy approvedthoughts.com from cloudflare. unlike godaddy etc. who offer a promotional price bundles and then jack it up on renewals, cloudflare offers at-cost registration renewals and i have good experience with some of their other services, so it was an easy choice. for all my talk about using ai models, i hadn t really used them for any type of programming project tech support roles. i figured this was the perfect opportunity for me to try out if i could actually create something useful with the help of one of these models. for context, while i have an undergraduate degree in computer applications, i have never programmed professionally and frankly did barely any programming during the course itself. i am probably a bit better than someone who has never done any programming, but not by a lot. for context also, i could obviously just spend 20 on a paid service that would be absolutely trivial to set up and manage but where s the fun in that? this is how i started on claude 3.5 sonnet i have recently purchased a domain for a website. i used cloudflare for purchasing the domain. i would now like to set up a wordpress or other website at the domain. walk me through the steps of doing this. the sonnet is the most intelligent model by anthropic. it is the go to model at the moment for a lot of the people i follow and the only model i pay for. the project went through multiple chats because after a while, in each chat, i would start getting this message here, for the first time, i used a trick i had recently seen i think on twitter. ok - i have saved and deployed on cloudflare. however i am getting the message that this chat has become too long. can you provide a status update that i can use with another ai chatbot to continue this work? and it did! i pasted the update in another chat and the conversation continued there as if it was the same chat! you can check out the first chat here . i think hope it has no confidential information. i won t be sharing the remaining chats because they do have some of my account credentials. this one should provide enough context for most of what i am discussing here though. so how d it go? well you ve seen the website , so clearly not as well as i d hoped. that said, i am continuing with the project and based on what i have learned so far, i am hopeful i will eventually get it working. it is still remarkable that i got this far, considering that i have zero experience with the technologies services involved. claude successfully walked me through setting up 3 different services cloudflare, github and hugo and had them work with each other to serve up the site. all of this happened within a couple of hours and with me blindly following its instructions - copying and pasting code where it asked me to, choosing the options it asked me to and only making high level decisions, like which theme i liked for the blog, which require no technical sophistication. for the most part, all of this was one-shot , meaning it told me to do something, in plain english, i did the thing and it all worked. where it required a second shot, it was because i hadn t provided the full context e.g. that i was using a mac and not a pc. and once i clarified that, it adjusted the directions for all subsequent steps. in fact, because i use claude almost exclusively, i had forgotten how much better it is that some of the other models at being almost human . this chat is not very different from how i would interact with it support engineer at work. just randomly dropping bits of context or asides and having it be incorporated correctly into subsequent interactions as relevant. in one of the subsequent chats, it seemed to me like claude was stuck or going around in circles, without fixing the problem, so i decided to switch to the newly launched deepseek-r1 reasoning model. while the r1 made immediate progress where claude was stuck, the experience of working with the r1 was just so much harder. unlike claude, which understood that i was not technically sophisticated, and only gave tasks of a manageable size at each stage, the r1 would just throw a laundry list of complex tasks at me. for e.g. there s a set of 3 commands i needed to run on the terminal app on my mac, after every change to the code. this would push the changes to github. every time there would be only minor changes to these commands. claude would provide these commands every time, unprompted. r1 would not. claude also seemed to just understand better where we were in the overall project at all times. so if it asked me to do three things and if i went back with a question about the first thing, it would help me fix that and then go back to the remaining two items in the list. r1 did not seem to have as good an understanding of the overall project and did not seem to appreciate that if i was asking a question about step 2 of 5, that steps 3-5 still needed to be done after it answered the question about step 2. of course, the answer to step 2 would have 5 steps, so now i have to scroll back and forth to figure out which step of which step i am on. so despite being a stronger model, i found it discouraging and just much harder with the r1 to have to keep track of where we were in the project. what went wrong? i suspect the website would be looking a lot better if i had just followed claude s guidance. in fact, even now, i think it is at a stage where i can post these weekly updates there with some extra effort. but i knew i was going to be traveling for a few weeks and so after the site was ready for me to start posting content, i asked claude if we could also set up a cms, content management system, for the website. that way i could post from anywhere instead of just from my desktop and include links and images in the posts with minimal effort. things went off the rails pretty much immediately. without getting into a lot of detail, we encountered a bug while setting up the authorization setup for the cms. claude kept suggesting various tweaks but nothing worked. it felt to me like we were going around in circles, trying the same things over and over again. i even asked claude to look at the entire conversation and figure out if it was going around in circles. it gave itself a clean chit. of the 6 or so hours i have spend on this project, my guess is 4-5 have been trying to resolve this issue. my suspicion is that claude is trained on an older version of the various services projects i am using and therefore could not fix these errors. eventually i gave up with claude and took the project over to deepseek r1. it made some progress, identifying some errors claude had made, e.g. key files located in wrong folders, wrong parameters etc. however since neither of the models can really take over and look at the code themselves, they may not be able to fix issues caused by my mistakes in implementing their directions. maybe ai agents will fix this issue in future. in any event, the project is on pause as i travel and i am wondering whether i should start from scratch with deepseek instead of trying to fix the current version. what did i learn? a lot. despite the hiccup, i feel comfortable that these models can help me do projects that i just couldn t have done before. i intend to try more projects, and of course, finish this one. different models have very different skills and it s important to figure out which model is the best for a given task. while claude is the easiest to talk to, almost like a person, it really helps to understand how to prompt other models to get the best out of them. providing more context and better instructions can result in much better results. larger context windows will change everything. a model that can keep your entire life in context will be multiple orders of magnitude more helpful than the current models. i am a little more skeptical than before about llms becoming generally intelligent or superintelligent. their ability to deal with problems that are not in their training data seems limited. maybe agentic models will overcome some of this but breakthroughs in for e.g. fundamental physics seem unlikely. obviously i am extrapolating from a tiny sample but that s the direction in which i have updated my priors. what s next? i have a few ideas i want to work on once not if! i finish the website. i wonder if i can set up a web server on my old mac and run a few basic services off it. for e.g. creating a url shortening service like bitly or a qr code generation service. this from simon willison is my inspiration. 14 projects in 1 week. no rocket science but just small, useful things here and there. or, if i am more ambitious, that custom spaced repetition app built by andy matuschak, i mentioned couple of weeks ago. is truly customized software possible? i hope it is.",
    "preview": "this is the website in question. bookmark it. or don t. many people are asking if this can even be called a website. these people are losers. sad. the finest people i know think its a great website, m...",
    "content": "This is the website in question. Bookmark it. Or don’t.\nMany people are asking if this can even be called a website. These people are losers. Sad. The finest people I know think its a great website, maybe the best website in the history of the world. Nobody knows websites like I do.\nAnyhoo.\nIt all began when I decided to shift this letter to a website last week. Having purchased a few web domains before, it took me only a few minutes to buy approvedthoughts.com from Cloudflare. Unlike GoDaddy et"
  },
  {
    "id": "newsletter-vs-website",
    "title": "Newsletter vs. Website",
    "url": "posts/2025/newsletter-vs-website.html",
    "date": "2025-01-19T00:00:00.000Z",
    "dateFormatted": "January 19, 2025",
    "excerpt": "Having done a throat clearing piece the first week and the one writing idea I actually had when starting the newsletter, the second week, this week I ...",
    "type": "post",
    "tags": [
      "post"
    ],
    "keywords": [
      "week",
      "learn",
      "also",
      "here",
      "website",
      "how",
      "better",
      "even",
      "newsletter",
      "one",
      "writing",
      "last",
      "there",
      "much",
      "teaching",
      "year",
      "clear",
      "lot",
      "trying",
      "who",
      "words",
      "money",
      "not",
      "can",
      "bar",
      "barely",
      "need",
      "make",
      "messes",
      "having",
      "done",
      "throat",
      "clearing",
      "piece",
      "first",
      "idea",
      "actually",
      "when",
      "starting",
      "second",
      "finally",
      "forced",
      "think",
      "direction",
      "want",
      "take",
      "letter",
      "enjoyed",
      "heading",
      "rabbit"
    ],
    "searchableText": "having done a throat clearing piece the first week and the one writing idea i actually had when starting the newsletter, the second week, this week i was finally forced to think about the direction i want to take with this letter. i enjoyed heading down the rabbit hole of how to learn better last week. i already knew that there was much i needed to learn about teaching after struggling to homeschool the boys for a year recently. last week it also became clear that i also had to learn a lot about learning. as it happens, this is also a space where a lot is changing yes, ai, duh! and one that is even otherwise relevant to me given the presence of two reluctant learners that i am even more reluctantly trying to support. so it seemed like a natural beat to walk. i subscribe to a few substacks and as i trawled through them i realised that the only reason i subscribed to each of them was because they were written by experts who also happen to have an amazing way with the words. here s a sample money stuff by matt levine - goat of newsletters. it s not even close. and daily? get outta here don 39 t worry about the vase by zvi mowshowitz - i can t believe it s free. bits about money by patrick mckenzie patio11 - how is a software engineer teaching me about my job? in other words, i have a very high bar for who i let into my inbox. i could write about how to learn better but clearly i am not the preeminent expert on the topic, i am barely getting started. it would be hard for me to clear my own bar for quite some time, if ever. and if i am going sustain this, i need to enjoy what i am doing. i need to be able to experiment, make messes and generally figure things out. it occurred to me that a better medium for that kind of a goal might be a website rather than spamming people in their inboxes. it will give me the freedom to play around with the format, topics, content amp timing and make the aforementioned messes without worrying too much. now my wife thinks i am trying to wiggle out of my new year s resolution with this talk, but frankly, she barely knows me, so we can safely ignore that possibility. so here s the plan i will continue writing here on a weekly basis till the website is setup and then move everything over there.",
    "preview": "having done a throat clearing piece the first week and the one writing idea i actually had when starting the newsletter, the second week, this week i was finally forced to think about the direction i ...",
    "content": "Having done a throat clearing piece the first week and the one writing idea I actually had when starting the newsletter, the second week, this week I was finally forced to think about the direction I want to take with this letter.\nI enjoyed heading down the rabbit hole of how to learn better last week. I already knew that there was much I needed to learn about teaching after struggling to homeschool the boys for a year recently. Last week it also became clear that I also had to learn a lot about"
  },
  {
    "id": "links-19-jan-2025",
    "title": "Links: Week of 19 Jan 2025",
    "url": "posts/2025/links-19-jan-2025.html",
    "date": "2025-01-19T00:00:00.000Z",
    "dateFormatted": "January 19, 2025",
    "excerpt": "1. This feels accurate.  😅. He says AGI but looking at the next link I wonder if this is true for plain old AI.\n    ![embed](https://x.com/davidskrue...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "weeks",
      "now",
      "glutes",
      "week",
      "next",
      "twitter",
      "who",
      "time",
      "can",
      "skill",
      "doing",
      "core",
      "links",
      "looking",
      "link",
      "two",
      "ago",
      "see",
      "chatgpt",
      "nyt",
      "paywall",
      "how",
      "better",
      "few",
      "feed",
      "block",
      "everyone",
      "talks",
      "politics",
      "than",
      "amp",
      "piece",
      "writing",
      "open",
      "each",
      "fit",
      "good",
      "only",
      "productivity",
      "many",
      "right",
      "there",
      "lot",
      "some",
      "war",
      "india",
      "not",
      "where",
      "one",
      "when"
    ],
    "searchableText": "this feels accurate. . he says agi but looking at the next link i wonder if this is true for plain old ai. two weeks ago, it was will smith eating pizza. now its this. click the link to see the video. whatsapp university is about to go nuts. she is in love with chatgpt nsfw. nyt paywall. and you thought k-dramas were stealing your spouse. the serendipity machine or how to use twitter better. a few years ago i implemented a simple algorithm on my twitter feed a. block everyone who talks about politics and b. block everyone who is is dissing attacking anyone anything. in less than a month my feed stopped being the anxiety inducing, doomscrolling nightmare that it was and transformed into the best source of learning amp inspiration on internet. this piece takes you to the next level. committing to writing this newsletter has also been great. now instead of mindlessly flicking my finger and consuming, i have a purpose every time i open twitter. its almost energising to engage actively with each tweet, thoughtfully considering whether its fit to be served to my exceptionally smart and good-looking audience. e x gt 0 an open letter to elon your top engineers and programmers are only able to work 80-hour weeks because they can hire nannies and maids, ride in ubers, and order food delivery. high-skill productivity depends on an abundance of complementary low-skill productivity. as a repeat immigrant, i have many thoughts on this debate going on in us right now. there s a lot that is wrong with a policy of focusing exclusively on so called skill or merit based immigration. this piece from bryan caplan makes some good points. the war for india i am enjoying this talk by prof. sarah paine of the naval war college. she talks about the history of international conflict and politics in south asia and the role to us amp russia. i did not know that india supported china s bid for a permanent seat on the un security council. better ways to wear a polo always a pleasure to see a master in action. networking conferences where there s plated cantaloupe. chef s kiss . here s another one from derek fix your glutes. nyt paywall strongly endorse. really helps when trying to hold a fart but many other benefits too. my frail-as-porcelain glutes the cluster of tissue from hip to thigh tasked with keeping the body upright and on occasion propelling it forward were causing a domino chain of damage, and had most likely been doing so for some time. to compensate for the glutes infirmity, my ankles, knees, hips and even my shoulders and arms had to thrash madly, taking on vast and uneven amounts of pressure, often far more than they were structurally fit to bear and only after i started remedying my gluteal amnesia real medical term did it become clear how little i knew about basic affairs like walking, standing and sitting or living, for that matter . within a week of the mandated twisting and shimmying and clam-shelling, my spine was noticeably straighter, smoother. four weeks later and i could finally walk without pain again. it took three months more to fully rebalance my loopy musculature and break into a manageable jog but when i did, i noticed a wondrous new power to each step and spring. my reawakened haunch muscles were doing their job. for the last two months, i have been doing a core workout formulated personally for me by who else? chatgpt, with a special focus on glutes and i can feel the difference, not just in my ability, but my willingness to do things. core strength is underrated and it isn t just about the abs. you can have a six-pack and a weak core. i happen to have one of those. that s it for this week. it seems like my writing and links are all ai all the time but that isn t the intention. however it is a space where a lot of fun stuff is happening right now and so that s the path of least resistant. i will be on the road for the next few weeks so programming may be light. hopefully the website will be ready soon.",
    "preview": "this feels accurate. . he says agi but looking at the next link i wonder if this is true for plain old ai. two weeks ago, it was will smith eating pizza. now its this. click the link to see the video....",
    "content": "\nThis feels accurate.  😅. He says AGI but looking at the next link I wonder if this is true for plain old AI.\n\n\n  \n    \n  \n\n\n\n\nTwo weeks ago, it was Will Smith eating pizza. Now its this. Click the link to see the video. WhatsApp University is about to go nuts.\n\n\n  \n    \n  \n\n\n\nShe Is in Love With ChatGPT (NSFW. NYT Paywall.) And you thought K-Dramas were stealing your spouse.\n\nThe Serendipity Machine or how to use Twitter better. A few years ago I implemented a simple algorithm on my twitter fe"
  },
  {
    "id": "spaced-repetition",
    "title": "Spaced Repetition",
    "url": "posts/2025/spaced-repetition.html",
    "date": "2025-01-12T00:00:00.000Z",
    "dateFormatted": "January 12, 2025",
    "excerpt": "What is Spaced Repetition (SR)?...",
    "type": "post",
    "tags": [
      "post"
    ],
    "keywords": [
      "can",
      "how",
      "cards",
      "repetition",
      "more",
      "not",
      "used",
      "train",
      "spaced",
      "what",
      "learning",
      "when",
      "first",
      "thing",
      "anki",
      "thought",
      "few",
      "just",
      "knowledge",
      "sure",
      "one",
      "claude",
      "information",
      "here",
      "learn",
      "review",
      "remember",
      "maybe",
      "better",
      "some",
      "apps",
      "great",
      "dwarkesh",
      "using",
      "material",
      "system",
      "use",
      "status",
      "quo",
      "bias",
      "having",
      "between",
      "don",
      "know",
      "answer",
      "workflows",
      "someone",
      "technique",
      "something",
      "next"
    ],
    "searchableText": "what is spaced repetition sr ? claude says spaced repetition is a learning technique that involves reviewing information at gradually increasing intervals. here 39 s how it works when you first learn something new, you review it fairly soon like the next day . if you remember it well, you wait a bit longer before the next review maybe 3 days . if you still remember it well, you extend the interval further perhaps a week, then two weeks, then a month . the key principles behind spaced repetition are the spacing effect information is better remembered when studying is spread out over time rather than crammed into a single session. the testing effect actively recalling information strengthens memory more effectively than passive review. this may not sound revolutionary. after all, some version of this is how we prepared for our exams. but the important thing is that unlike the 90s, there s an app for that anki , mochi amp others . the app handles the spacing and repetition, making it more practical, reliable and scalable. when i first learned about and used sr apps years ago, i thought, wow! it would have been great to have this in school. this will be great for the boys in a few years. i never used the technique until last year when i used anki for homeschooling the kids in hindi. you can get many ready-made decks free amp paid on the anki website, but creating your own necessary for specific requirements was a chore, and i stopped after a few months. i thought sr was for students until i saw a dwarkesh patel podcast with dan shipper using it to learn more broadly. it wasn t limited to coursework or vocabulary but included concepts. he claims it allows for better understanding of linkages and patterns over time. but what had my jaw drop was that he used claude chatgpt to create the cards! of course. just throw in the material you are learning into claude, ask it to create sr cards for the material and you re done. it may need some editing or creating additional cards, but it s generally good enough. it can even output in anki file format. rope in an ai and the amount of knowledge you can include in your sr system just explodes. while researching this piece, i revisited alexey guzey s original post that introduced me to the concept. i didn t remember this, but the first thing he talks about is to use sr for instilling novel thought patterns. front card saying no back card if i want to say no, i will stop and make sure this is not just status quo bias coz it probably is status quo bias sucks. does this one solve it? beautifully so. although several months had passed before it finally kicked in, the number of times i noticed saying no out of status quo bias, then having this thought come up and make me retroactively reverse the initial no is in the tens already. will this work? i am not sure, but between how dwarkesh is using sr and this, i feel the case for having my own sr system is growing stronger. hopefully, i ll have an update in a few weeks. how do you train? tyler cowen s post inspired by david perell planted another bug in my brain. athletes train. musicians train. performers train. but knowledge workers don t. recently, one of my favorite questions to bug people with has been what is it you do to train that is comparable to a pianist practicing scales? if you don t know the answer to that one, maybe you are doing something wrong or not doing enough. or maybe you are optimally? not very ambitious? here s his answer . of course, i didn t know the answer to that one. watching andy matuschak study quantum mechanics with dwarkesh patel who else? led to a few realisations. having the right tools and workflows and being good at them is a huge productivity unlock. in the video, andy uses custom software that allows him to do much more, faster. he reads, creates sr cards, and reviews material on the fly. he also knows how to put mathematical symbols in his notes, making useful cards so much more quickly. what is the difference in learning between someone manually revising from a textbook before an exam as i used to do and someone using a custom sr system, ai-generated sr cards, and a workflow to push those cards daily? huge. this year, i plan to practice getting better with the keyboard. how long can i work on my desktop without touching the mouse? to switch between windows and apps, and use functions within apps? sure, i can do ctrl c and ctrl v. but can i effortlessly do alt e s v f paste special gt formulas in excel ? can i do 50 other menu actions across multiple programs? can i set up workflows for routine processes and use ai to automate? the second thing that struck me was the depth of his learning approach. sure, it s a tough topic, but he spent 20 min on the first page, asking questions, drawing connections, testing himself, and revising. i don t recall engaging with my coursework so diligently. the last thing that occurred to me is how important and hard it is to learn these hacks tricks workflows. some people just know and others never do. here s a great resource for this tacit knowledge. i m glad someone recognised the importance of the concept, named it, and created a knowledge base.",
    "preview": "what is spaced repetition sr ? claude says spaced repetition is a learning technique that involves reviewing information at gradually increasing intervals. here 39 s how it works when you first learn ...",
    "content": "What is Spaced Repetition (SR)?\nClaude says:\n\nSpaced repetition is a learning technique that involves reviewing information at gradually increasing intervals. Here&#39;s how it works:\n\n\n\nWhen you first learn something new, you review it fairly soon (like the next day). If you remember it well, you wait a bit longer before the next review (maybe 3 days). If you still remember it well, you extend the interval further (perhaps a week, then two weeks, then a month).\n\n\n\nThe key principles behind spac"
  },
  {
    "id": "links-12-jan-2025",
    "title": "Links: Week of 12 Jan 2025",
    "url": "posts/2025/links-12-jan-2025.html",
    "date": "2025-01-12T00:00:00.000Z",
    "dateFormatted": "January 12, 2025",
    "excerpt": "...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "most",
      "company",
      "know",
      "see",
      "asml",
      "hall",
      "how",
      "great",
      "what",
      "like",
      "even",
      "there",
      "more",
      "one",
      "never",
      "brienna",
      "machines",
      "2025",
      "now",
      "confident",
      "believe",
      "first",
      "tools",
      "turn",
      "beyond",
      "superintelligence",
      "here",
      "can",
      "massively",
      "scientific",
      "doing",
      "science",
      "fiction",
      "few",
      "while",
      "still",
      "work",
      "google",
      "bing",
      "linkedin",
      "last",
      "year",
      "advice",
      "indispensable",
      "machine",
      "didn",
      "thing",
      "euv",
      "million",
      "maybe"
    ],
    "searchableText": "reflections - sam altman we are now confident we know how to build agi as we have traditionally understood it. we believe that, in 2025, we may see the first ai agents join the workforce and materially change the output of companies. we continue to believe that iteratively putting great tools in the hands of people leads to great, broadly-distributed outcomes. we are beginning to turn our aim beyond that, to superintelligence in the true sense of the word. we love our current products, but we are here for the glorious future. with superintelligence, we can do anything else. superintelligent tools could massively accelerate scientific discovery and innovation well beyond what we are capable of doing on our own, and in turn massively increase abundance and prosperity. this sounds like science fiction right now, and somewhat crazy to even talk about it. that s alright we ve been there before and we re ok with being there again. we re pretty confident that in the next few years, everyone will see what we see, and that the need to act with great care, while still maximizing broad benefit and empowerment, is so important. given the possibilities of our work, openai cannot be a normal company. emphasis mine. those are tall claims. more from zvi here . how to grow a 3tn market cap? - john gruber. when you search for google on bing, bing attempts to trick you into thinking the results page is google. don t know if i should laugh or cry. having spent more time on linkedin last year than anyone should ever have to, i fully endorse this advice. via shaan puri . it s the most indispensable machine in the world and it depends on this woman - wsj paywall . one can never get enough of asml brienna hall has the most valuable role that you ll never see at the most vital company that you ve never heard of. until she began working at asml last year, she didn t know the first thing about the company. she also didn t know what she would be doing as a customer-support engineer a fancy mechanic, as she calls herself. it s the machine that produces the most advanced microchips on the planet. it was built with scientific technologies that sound more like science fiction breakthroughs so improbable that they were once dismissed as impossible. and it has transformed wafers of silicon into the engines of modern life. even today, there are only a few hundred of these euv machines in existence and they are ludicrously expensive. the one that hall maintains cost 170 million, while the latest models sell for roughly 370 million. but maybe the most remarkable thing about these invaluable machines is that they re all made by the same company asml. asml is the glue holding the chip business together. that s because this one dutch company is responsible for all of the euv lithography systems that help make the chips in so many of your devices. like your phone. and your computer. and your tablet. and your tv. maybe even your car, too. these machines have become indispensable. and they depend on the invisible work of brienna hall. truly a case of following the previous tweet s advice. brienna hall still has a linkedin profile, but i give it another 18 months at most. meta announcements . if you ve been hiding under a rock and missed this on the airwaves. not much to add but zuck knows how to nail a pivot.",
    "preview": "reflections - sam altman we are now confident we know how to build agi as we have traditionally understood it. we believe that, in 2025, we may see the first ai agents join the workforce and materiall...",
    "content": "\nReflections - Sam Altman:\n\nWe are now confident we know how to build AGI as we have traditionally understood it. We believe that, in 2025, we may see the first AI agents “join the workforce” and materially change the output of companies. We continue to believe that iteratively putting great tools in the hands of people leads to great, broadly-distributed outcomes.\n\n\n\nWe are beginning to turn our aim beyond that, to superintelligence in the true sense of the word. We love our current products, b"
  },
  {
    "id": "links-05-jan-2025",
    "title": "Links: Week of 05 Jan 2025",
    "url": "posts/2025/links-05-jan-2025.html",
    "date": "2025-01-05T00:00:00.000Z",
    "dateFormatted": "January 5, 2025",
    "excerpt": "1. [How to be More Agentic](https://usefulfictions.substack.com/p/how-to-be-more-agentic) by [Cate Hall](https://x.com/catehall) - Staying with the ne...",
    "type": "links",
    "tags": [
      "links"
    ],
    "keywords": [
      "more",
      "book",
      "how",
      "life",
      "questions",
      "just",
      "claude",
      "reading",
      "lot",
      "2025",
      "year",
      "theme",
      "without",
      "stars",
      "mind",
      "dwarkesh",
      "podcast",
      "don",
      "already",
      "generative",
      "recently",
      "question",
      "too",
      "ask",
      "what",
      "sure",
      "answer",
      "doing",
      "asking",
      "cloud",
      "atlas",
      "first",
      "pages",
      "struggling",
      "understand",
      "used",
      "links",
      "week",
      "jan",
      "agentic",
      "cate",
      "hall",
      "staying",
      "new",
      "resolution",
      "twitter",
      "meme",
      "goes",
      "can",
      "things"
    ],
    "searchableText": "how to be more agentic by cate hall - staying with the new year resolution theme as the twitter meme goes, you can just do things. life without stars stanets and ploons by julian gough - could most life in the universe exist without stars, in the deep oceans on icy moons of large planets? how to do the jhanas by nadia asparouhova will smith eating spaghetti - the pace of progress in ai is mind boggling. how dwarkesh patel uses ai a podcast by dan shipper - also subscribe to dwarkesh s podcast if you don t already. a tutorial on teaching data analytics with generative ai by robert l. bray the last two are a great if you are thinking about how to incorporate generative ai in your work or life. a hack i learned recently is anytime i have a question i am too embarrassed worried lazy to ask the right person or even google for, i just ask claude or chatgpt. here are some examples of questions that would have gone unanswered but for the chatbots. a piece i was reading mentioned that starlink s low earth orbit satellites have a useful life of 5 years. i wondered what happens to them afterwards. sure i could have googled that1 and probably found the answer somewhere in the top 3 links2. but having the bot answer your exact question has a lot less friction than doing that and i find i am asking a lot more of these questions. i recently started reading cloud atlas by david mitchell, apparently a modern classic. after the first 10 pages i was really struggling to understand what was going on and ordinarily i would have just dropped the book. instead, i asked claude i am reading the book cloud atlas. i am struggling to understand the theme through the first few pages. i got this response the book is structured in a unique way, with six nested stories that span different time periods and genres. each story is interrupted halfway through, only to be concluded in reverse order in the second half of the book. no risk of spoilers and i suddenly felt more comfortable navigating the book. claude has already changed my mind on multiple questions and i am sure will keep doing so. i hereby declare 2025 the year of asking more questions. did you know that in ios at least this button allows you to dictate text? i used to think it was to send a voice message don t do that but no, this types it out and does a pretty good job of it too. this deserves to be used a lot more.",
    "preview": "how to be more agentic by cate hall - staying with the new year resolution theme as the twitter meme goes, you can just do things. life without stars stanets and ploons by julian gough - could most li...",
    "content": "\nHow to be More Agentic by Cate Hall - Staying with the new year resolution theme… as the twitter meme goes, you can just do things.\n\nLife Without Stars: Stanets and Ploons by Julian Gough - Could most life in the Universe exist without stars, in the deep oceans on icy moons of large planets?\n\nHow to do the jhanas by Nadia Asparouhova\n\nWill Smith eating spaghetti - the pace of progress in AI is mind boggling.\n\nHow Dwarkesh Patel uses AI a podcast by Dan Shipper - Also subscribe to Dwarkesh’s pod"
  }
]